{
    "<|startofgame|>": 0,
    "e4": 1,
    "c5": 2,
    "Be2": 3,
    "Nc6": 4,
    "d3": 5,
    "g6": 6,
    "f4": 7,
    "Bg7": 8,
    "Nf3": 9,
    "e6": 10,
    "O-O": 11,
    "Nge7": 12,
    "c3": 13,
    "Be3": 14,
    "b6": 15,
    "d4": 16,
    "d5": 17,
    "e5": 18,
    "cxd4": 19,
    "Bd7": 20,
    "Nc3": 21,
    "a6": 22,
    "Rc1": 23,
    "b5": 24,
    "a3": 25,
    "Qb6": 26,
    "Bf2": 27,
    "Na5": 28,
    "g4": 29,
    "Rfc8": 30,
    "Kh1": 31,
    "Nc4": 32,
    "Qc2": 33,
    "Rc7": 34,
    "Bd3": 35,
    "Rac8": 36,
    "Bh4": 37,
    "Qf2": 38,
    "N6a5": 39,
    "f5": 40,
    "Be8": 41,
    "fxe6": 42,
    "Ne2": 43,
    "Nxb2": 44,
    "Rxc7": 45,
    "Bb1": 46,
    "Rf7": 47,
    "Ng3": 48,
    "Nbc4": 49,
    "Qe2": 50,
    "Nb3": 51,
    "Bf6": 52,
    "Nxd4": 53,
    "Qxd4": 54,
    "Rd1": 55,
    "Qb2": 56,
    "Qxb2": 57,
    "g5": 58,
    "Bf8": 59,
    "Bxa3": 60,
    "Nd4": 61,
    "h4": 62,
    "b4": 63,
    "Bc2": 64,
    "a5": 65,
    "h5": 66,
    "a4": 67,
    "hxg6": 68,
    "Bxg6": 69,
    "b3": 70,
    "Rd3": 71,
    "Rh3": 72,
    "Rh7": 73,
    "Bc8": 74,
    "Nb5": 75,
    "Rd7": 76,
    "b2": 77,
    "a2": 78,
    "Bh7+": 79,
    "Kf8": 80,
    "Rf3": 81,
    "Bxf6": 82,
    "Rxf6+": 83,
    "Rf1": 84,
    "Rxf1+": 85,
    "Kg2": 86,
    "a1=Q": 87,
    "Nxa1": 88,
    "bxa1=Q": 89,
    "Rg1+": 90,
    "Kf3": 91,
    "Qf1#": 92,
    "<|endofgame|>": 93,
    "Nf6": 94,
    "c4": 95,
    "g3": 96,
    "Bb4+": 97,
    "Bd2": 98,
    "Be7": 99,
    "Bg2": 100,
    "c6": 101,
    "Na6": 102,
    "Nb4": 103,
    "Bxb4": 104,
    "Ne5": 105,
    "Nd7": 106,
    "Nd3": 107,
    "dxe4": 108,
    "Bxe4": 109,
    "Nxe4": 110,
    "Qxe4": 111,
    "f6": 112,
    "Qc7": 113,
    "Nb6": 114,
    "Rad8": 115,
    "Nd2": 116,
    "Ndc4": 117,
    "dxe5": 118,
    "Bxc5": 119,
    "Rxd8": 120,
    "Qxd8": 121,
    "Qb3": 122,
    "Kh8": 123,
    "Na8": 124,
    "Qb8": 125,
    "Nab6": 126,
    "fxe5": 127,
    "Ne3": 128,
    "Bf7": 129,
    "axb5": 130,
    "cxb5": 131,
    "Qc3": 132,
    "bxc4": 133,
    "Qxa5": 134,
    "Bd4": 135,
    "Qa3": 136,
    "h6": 137,
    "Nf5": 138,
    "Rd8": 139,
    "Qe7": 140,
    "Bxf2+": 141,
    "Rxd1": 142,
    "Qxf7": 143,
    "Qg8": 144,
    "Qh5": 145,
    "Qd5+": 146,
    "Kh3": 147,
    "Qe8+": 148,
    "Qg6": 149,
    "Qf8": 150,
    "Nh4": 151,
    "Rd6": 152,
    "Qc8+": 153,
    "Ng6+": 154,
    "Rxg6": 155,
    "Qxg6": 156,
    "Bxb2": 157,
    "d6": 158,
    "Bc4": 159,
    "Re1": 160,
    "Bf1": 161,
    "Nbd2": 162,
    "Ngf6": 163,
    "Ne8": 164,
    "Nf1": 165,
    "Nb8": 166,
    "Ba6": 167,
    "Bxa6": 168,
    "Rxa6": 169,
    "exf6": 170,
    "Bg5": 171,
    "Bf4": 172,
    "N1h2": 173,
    "Nd6": 174,
    "Qxe6": 175,
    "Ne4": 176,
    "Qh3": 177,
    "Rad1": 178,
    "Ra7": 179,
    "Bxe5": 180,
    "Ng4": 181,
    "Raf7": 182,
    "Rxd5": 183,
    "Rxf4": 184,
    "gxf4": 185,
    "Re2": 186,
    "Rxe4": 187,
    "Qg2": 188,
    "Nf3+": 189,
    "Kf1": 190,
    "Qa6+": 191,
    "cxd5": 192,
    "e3": 193,
    "Bg4": 194,
    "f3": 195,
    "Bh5": 196,
    "Nge2": 197,
    "Bg3": 198,
    "Bg6": 199,
    "Nf4": 200,
    "Bd6": 201,
    "Rc8": 202,
    "Bxg3": 203,
    "hxg3": 204,
    "Qd6": 205,
    "Nxe5": 206,
    "Qxe5": 207,
    "Qd4": 208,
    "exd4": 209,
    "Rc4": 210,
    "Rxc1": 211,
    "Re8": 212,
    "Kf2": 213,
    "Re7": 214,
    "Rc8+": 215,
    "Rc5": 216,
    "Ke7": 217,
    "Rc7+": 218,
    "Ke6": 219,
    "Rxb7": 220,
    "Ke3": 221,
    "Qd8": 222,
    "Qd2": 223,
    "Be6": 224,
    "Rfd1": 225,
    "Rac1": 226,
    "Nd5": 227,
    "exf5": 228,
    "gxf5": 229,
    "Bh6": 230,
    "Rg8": 231,
    "Bxg7+": 232,
    "Rxg7": 233,
    "Qxd6": 234,
    "exf4": 235,
    "Qxd7": 236,
    "Bxc4": 237,
    "Rxd7": 238,
    "Bxg8": 239,
    "Rxd1+": 240,
    "Kxg8": 241,
    "Rd5": 242,
    "Nxf5": 243,
    "Re1+": 244,
    "Kh2": 245,
    "Nf2": 246,
    "Rxb2": 247,
    "Kg3": 248,
    "Nh1+": 249,
    "Kg4": 250,
    "Rg2+": 251,
    "Kh5": 252,
    "Kf7": 253,
    "Kh6": 254,
    "Kf6": 255,
    "Kxh7": 256,
    "Rxa2": 257,
    "Nh6": 258,
    "Rh2": 259,
    "Ng4+": 260,
    "Re5+": 261,
    "Kd6": 262,
    "Nxh2": 263,
    "exd5": 264,
    "Nxd5": 265,
    "h3": 266,
    "Qxd8+": 267,
    "Kxd8": 268,
    "Bxb7": 269,
    "Nc2+": 270,
    "Ke2": 271,
    "Bxa8": 272,
    "Kc7": 273,
    "Bxa7": 274,
    "Bxc6": 275,
    "Kxc6": 276,
    "Na3": 277,
    "Nc2": 278,
    "Nxc2": 279,
    "Bxc2": 280,
    "Ra8": 281,
    "Bb3": 282,
    "Kd3": 283,
    "Nc5+": 284,
    "Kc3": 285,
    "Rb8": 286,
    "Kxc5": 287,
    "Rb3+": 288,
    "Kc2": 289,
    "Kd1": 290,
    "Rxf2": 291,
    "Qd3": 292,
    "Bb4": 293,
    "Nxc6": 294,
    "bxc6": 295,
    "Bxc3+": 296,
    "Qxc3": 297,
    "Qxc6": 298,
    "Ba4": 299,
    "Qb4": 300,
    "Rxc4": 301,
    "gxf6": 302,
    "Rc2": 303,
    "Bb7": 304,
    "Ba8": 305,
    "dxe6": 306,
    "Qb7": 307,
    "Bc5+": 308,
    "Qf6": 309,
    "Qxf4": 310,
    "Rxa8": 311,
    "Nxc4": 312,
    "Rfd8": 313,
    "Rf8": 314,
    "Qe4": 315,
    "Qf5": 316,
    "Qxf5": 317,
    "Bg1": 318,
    "Kg7": 319,
    "gxh5": 320,
    "axb4": 321,
    "Rb5": 322,
    "Rxb4": 323,
    "Rd3+": 324,
    "Rxg3": 325,
    "Rb7+": 326,
    "Kg6": 327,
    "Ngf3": 328,
    "dxc5": 329,
    "Nbd4": 330,
    "Ne6": 331,
    "Nxg4": 332,
    "hxg4": 333,
    "Bxg4": 334,
    "Nh2": 335,
    "Bh3": 336,
    "Bxf1": 337,
    "Qxf1": 338,
    "Raf8": 339,
    "Rf4": 340,
    "Ng6": 341,
    "Nxf4": 342,
    "Qa4+": 343,
    "Qd7": 344,
    "Qe3+": 345,
    "O-O-O": 346,
    "Qe6": 347,
    "Bxc3": 348,
    "Ng5": 349,
    "Qg4": 350,
    "Qxf6": 351,
    "Kb1": 352,
    "Nxd7": 353,
    "Nxf8": 354,
    "Bf5": 355,
    "Nc5": 356,
    "Rae1": 357,
    "Bc6": 358,
    "Bxd5": 359,
    "Rc3": 360,
    "Rb1": 361,
    "bxc3": 362,
    "Rfc1": 363,
    "Rb3": 364,
    "Qxe6+": 365,
    "Bc5": 366,
    "Bb6": 367,
    "Na4": 368,
    "Nxb6": 369,
    "axb6": 370,
    "Bxc6+": 371,
    "Qf4": 372,
    "Rxf1": 373,
    "Qg4+": 374,
    "Nxd6": 375,
    "Rxd6": 376,
    "Kb8": 377,
    "Qd5": 378,
    "Qxg7": 379,
    "Qd1+": 380,
    "Qe6+": 381,
    "Qd2+": 382,
    "Qh8+": 383,
    "Ka7": 384,
    "Nc8+": 385,
    "Ka6": 386,
    "Qxf3": 387,
    "Ka5": 388,
    "Qh5+": 389,
    "Qe2+": 390,
    "Kg1": 391,
    "Qe1+": 392,
    "dxc4": 393,
    "Nbd7": 394,
    "Qb1": 395,
    "bxa4": 396,
    "Nxa4": 397,
    "Qa7": 398,
    "Rxc8+": 399,
    "Bxc8": 400,
    "Nxe7": 401,
    "Kxe7": 402,
    "Ke8": 403,
    "Bxb5": 404,
    "Kd8": 405,
    "Ba5": 406,
    "N2b3": 407,
    "Qc1": 408,
    "Nxe3": 409,
    "Rxe3": 410,
    "Rg3": 411,
    "Bc7": 412,
    "Be5": 413,
    "Re3": 414,
    "Qe1": 415,
    "Qh4": 416,
    "Ned4": 417,
    "Qh6": 418,
    "Rcd8": 419,
    "Bxd4": 420,
    "Bf3": 421,
    "Rxf3": 422,
    "exf3": 423,
    "Nxb7": 424,
    "Qxa6": 425,
    "Rbd7": 426,
    "Kh7": 427,
    "a7": 428,
    "Qxb1+": 429,
    "Rxa7": 430,
    "Rab7": 431,
    "Rxb6": 432,
    "Rb2+": 433,
    "Rb1+": 434,
    "Qxg3": 435,
    "Rd8+": 436,
    "Ke4": 437,
    "Qg5": 438,
    "Bxd3": 439,
    "Qxd3": 440,
    "Ne7": 441,
    "Nxe6": 442,
    "Qg6+": 443,
    "Kd7": 444,
    "Qxg7+": 445,
    "cxb4": 446,
    "Qxf2+": 447,
    "Kxf2": 448,
    "Rhf8": 449,
    "Rxf6": 450,
    "e3+": 451,
    "Bxe3": 452,
    "Ngxe3": 453,
    "Kxf6": 454,
    "Nxh4+": 455,
    "Rxg2+": 456,
    "Ra2": 457,
    "Nfd6": 458,
    "Rd2+": 459,
    "Ne4+": 460,
    "Kb4": 461,
    "Ka4": 462,
    "Ra2+": 463,
    "Kb3": 464,
    "Nf8": 465,
    "Nb1": 466,
    "Nfe4": 467,
    "Nxg3": 468,
    "fxg6": 469,
    "Nfd2": 470,
    "Rxe1": 471,
    "Nh3+": 472,
    "Bxh2": 473,
    "Kxh2": 474,
    "Qxg2+": 475,
    "Qxg2": 476,
    "Bxg2": 477,
    "Kxg2": 478,
    "Nf4+": 479,
    "Re6": 480,
    "Rxc6": 481,
    "Rc6+": 482,
    "Kf5": 483,
    "Rc5+": 484,
    "Kf4": 485,
    "Ng2+": 486,
    "Nxa5": 487,
    "Nf5+": 488,
    "Nxd8": 489,
    "Nb7": 490,
    "fxg5": 491,
    "Kxe5": 492,
    "Kh4": 493,
    "Kd5": 494,
    "Kxh5": 495,
    "Kg5": 496,
    "Nxg6": 497,
    "Kxg6": 498,
    "Kc6": 499,
    "Kb7": 500,
    "Kd4": 501,
    "Kc4": 502,
    "Kxa5": 503,
    "Kb6": 504,
    "Kc5": 505,
    "Kxb4": 506,
    "b6+": 507,
    "Kb5": 508,
    "Kc8": 509,
    "Ka8": 510,
    "Nfxd5": 511,
    "Bxe7": 512,
    "Qxe7": 513,
    "Rxc8": 514,
    "Rxc5": 515,
    "Qxc5": 516,
    "Qd1": 517,
    "Nxb4": 518,
    "gxh4": 519,
    "Be4": 520,
    "b3+": 521,
    "Nb5+": 522,
    "Kxb3": 523,
    "Bd1": 524,
    "Ng8": 525,
    "gxh3": 526,
    "Bxh3": 527,
    "Ng5+": 528,
    "Nxh3": 529,
    "Ng1": 530,
    "Nxh5": 531,
    "f2": 532,
    "Rab1": 533,
    "Qa5": 534,
    "Rbd1": 535,
    "Bxg5": 536,
    "Qxg5": 537,
    "Qxb5": 538,
    "Rg6": 539,
    "Qg3": 540,
    "Qf1+": 541,
    "Qd6+": 542,
    "Qe5": 543,
    "Qe5+": 544,
    "Bb2": 545,
    "Rdd8": 546,
    "Ne1": 547,
    "Rxe6": 548,
    "Ree8": 549,
    "Nf6+": 550,
    "Nxe8+": 551,
    "Rxe8": 552,
    "Kg8": 553,
    "Ba2": 554,
    "Qxa3": 555,
    "Rxf8+": 556,
    "Bxf8": 557,
    "Qd8+": 558,
    "Bxf7": 559,
    "Nxf7": 560,
    "Rxf7": 561,
    "Qa1+": 562,
    "cxd6": 563,
    "d7": 564,
    "d8=Q": 565,
    "Bxd8": 566,
    "Rb6+": 567,
    "Ke5": 568,
    "Ra5": 569,
    "Ra6": 570,
    "Rxg5": 571,
    "Rxh5": 572,
    "Rh8": 573,
    "Kxb2": 574,
    "h7": 575,
    "h8=Q+": 576,
    "Qg8+": 577,
    "Qf3": 578,
    "g7": 579,
    "g8=Q": 580,
    "Rhc8": 581,
    "Qxh7": 582,
    "Rxb2+": 583,
    "Ka1": 584,
    "Qxc4": 585,
    "Qb5+": 586,
    "bxc5": 587,
    "Bxh4": 588,
    "Qxd5": 589,
    "Qb5": 590,
    "Rfb1": 591,
    "Bxg7": 592,
    "Kxg7": 593,
    "Qc3+": 594,
    "Rb2": 595,
    "Bh1": 596,
    "Nd8": 597,
    "Qxg4": 598,
    "Qxc7": 599,
    "Qe8": 600,
    "Qc4": 601,
    "Rd2": 602,
    "Ng7": 603,
    "Rf5": 604,
    "Nc7": 605,
    "Nxb5": 606,
    "Rxb5": 607,
    "Bb5": 608,
    "Bxd7+": 609,
    "Rb8+": 610,
    "Qa4": 611,
    "Bxf7+": 612,
    "Bxf3": 613,
    "Nxf3+": 614,
    "Qxe3": 615,
    "Nh5": 616,
    "Rae8": 617,
    "Qc5": 618,
    "Rff1": 619,
    "Ra1": 620,
    "Qxb2+": 621,
    "Re4": 622,
    "Rxf5+": 623,
    "Ref7": 624,
    "Nxc5": 625,
    "Rd4": 626,
    "Ra1+": 627,
    "Nxc3": 628,
    "Ba3": 629,
    "Rfe1": 630,
    "Rxf8": 631,
    "Qe3": 632,
    "Rc6": 633,
    "Bd5": 634,
    "Rb6": 635,
    "d2": 636,
    "Rxc2": 637,
    "d1=Q": 638,
    "Rxa4": 639,
    "Rxh3+": 640,
    "Kd2": 641,
    "Rh4": 642,
    "Ra3": 643,
    "c7": 644,
    "Ndf6": 645,
    "Nxf6+": 646,
    "Nxf6": 647,
    "Rhe1": 648,
    "Qxd2": 649,
    "Bxd2": 650,
    "Rhe8": 651,
    "Bxe6+": 652,
    "Bxe6": 653,
    "Rexd2": 654,
    "Rg4": 655,
    "Rff4": 656,
    "Rxg4": 657,
    "Rxh4": 658,
    "Rxg2": 659,
    "Rxc6+": 660,
    "Rd6+": 661,
    "Ra5+": 662,
    "Rh5": 663,
    "Rg6+": 664,
    "Rf6": 665,
    "Rg7+": 666,
    "Rg1": 667,
    "Rxb3+": 668,
    "Rg5+": 669,
    "Ra3+": 670,
    "Rg4+": 671,
    "Rg3+": 672,
    "Rxa3": 673,
    "Kb2": 674,
    "Ka2": 675,
    "Ra3#": 676,
    "Qxb7": 677,
    "Qa6": 678,
    "Bxd7": 679,
    "Rxc3": 680,
    "Ne2+": 681,
    "Qf3+": 682,
    "Qh1+": 683,
    "Re8+": 684,
    "Ng2": 685,
    "Rxe1+": 686,
    "Nxe1": 687,
    "Qa2+": 688,
    "Qxd3+": 689,
    "Kxd3": 690,
    "Bxf2": 691,
    "Nxc1": 692,
    "Qc6+": 693,
    "Qh1": 694,
    "Qh2+": 695,
    "Qh3+": 696,
    "Nd4+": 697,
    "Ne7+": 698,
    "e7": 699,
    "Ng8+": 700,
    "Nf7": 701,
    "Kxf4": 702,
    "Nxg6+": 703,
    "Qf6+": 704,
    "Nfd7": 705,
    "Nxd3": 706,
    "Bxh6": 707,
    "Qxh6": 708,
    "gxf3": 709,
    "Qxa2": 710,
    "Rec1": 711,
    "Qg5+": 712,
    "Qc4+": 713,
    "Qxf8": 714,
    "Qxf3+": 715,
    "Bh7": 716,
    "Qxb4": 717,
    "Qxb3": 718,
    "Nxa3": 719,
    "Nc1": 720,
    "Rhg8": 721,
    "Bxc1": 722,
    "Rcd1": 723,
    "R6xd5": 724,
    "f5+": 725,
    "Qxe5+": 726,
    "Rge8": 727,
    "Qc6": 728,
    "f7": 729,
    "Rexe7": 730,
    "f8=Q+": 731,
    "Qfxe7": 732,
    "Nd6+": 733,
    "Bxd6": 734,
    "Bxf4": 735,
    "Rfe8": 736,
    "Qb6+": 737,
    "Qc8": 738,
    "Bb8": 739,
    "Qxe4+": 740,
    "Bc3": 741,
    "Rde7": 742,
    "Rce1": 743,
    "Rge1": 744,
    "dxe3+": 745,
    "Rce7": 746,
    "Rxe7+": 747,
    "Rxe7": 748,
    "Rg2": 749,
    "Re3+": 750,
    "Bc1": 751,
    "Rxe2": 752,
    "Bxb6": 753,
    "c2": 754,
    "c1=Q": 755,
    "Bd8": 756,
    "Qf7+": 757,
    "Qxg6#": 758,
    "Bxd2+": 759,
    "Rxd4": 760,
    "Red8": 761,
    "Nh7": 762,
    "Bxd1": 763,
    "fxe4": 764,
    "c8=Q": 765,
    "Nd1": 766,
    "Qh6+": 767,
    "Rxf5": 768,
    "Qg7": 769,
    "Nxf5+": 770,
    "Bxf5": 771,
    "Kxe3": 772,
    "Rd1+": 773,
    "Kc1": 774,
    "Re5": 775,
    "Rxh3": 776,
    "Rb4": 777,
    "cxb2+": 778,
    "b7": 779,
    "h2": 780,
    "b8=Q": 781,
    "h1=Q": 782,
    "Qd7+": 783,
    "exd7": 784,
    "Kxd7": 785,
    "Qa2": 786,
    "Bxa5": 787,
    "Kxf8": 788,
    "Rab8": 789,
    "Qxc1": 790,
    "Qf2+": 791,
    "Rxf7+": 792,
    "Qa8+": 793,
    "Kxf7": 794,
    "Qb7+": 795,
    "Qh1#": 796,
    "Qa1": 797,
    "Qxa1": 798,
    "Rxa1": 799,
    "Rca6": 800,
    "Ra4": 801,
    "Ra7+": 802,
    "Rxh6": 803,
    "Rxd2": 804,
    "Kxd2": 805,
    "Bxe3+": 806,
    "Qf5+": 807,
    "Rgf1": 808,
    "Rg7": 809,
    "Rag8": 810,
    "Qf7": 811,
    "Bxf3+": 812,
    "Nxf3": 813,
    "Rxg7+": 814,
    "Rxg1+": 815,
    "Kxg1": 816,
    "Qf1": 817,
    "Qc1+": 818,
    "Nc8": 819,
    "hxg5": 820,
    "Kxg5": 821,
    "h7+": 822,
    "f8=Q": 823,
    "Nxe4+": 824,
    "Qg7#": 825,
    "Nh3": 826,
    "Bxa1": 827,
    "exf7+": 828,
    "Bxb8": 829,
    "g6+": 830,
    "Kxf1": 831,
    "Nac5": 832,
    "Rh1": 833,
    "Rxb7+": 834,
    "Nf7+": 835,
    "dxc6": 836,
    "Rdxd7+": 837,
    "Nd5+": 838,
    "R1xa2": 839,
    "Raxg2+": 840,
    "Rxg8": 841,
    "hxg8=Q": 842,
    "Nxg8": 843,
    "Bb5+": 844,
    "Nd7+": 845,
    "Rfxd8": 846,
    "Rd7+": 847,
    "bxa5": 848,
    "Kxc4": 849,
    "Kxa4": 850,
    "fxg4": 851,
    "Nxh1": 852,
    "Rxh1": 853,
    "Rf1+": 854,
    "Rf6+": 855,
    "Re6+": 856,
    "Rf8#": 857,
    "Qf4+": 858,
    "Rf1#": 859,
    "Raf1": 860,
    "Reg7": 861,
    "Rg5": 862,
    "Qxf2": 863,
    "Qxc2": 864,
    "Rh8+": 865,
    "h6+": 866,
    "Nxe7+": 867,
    "Bxa2": 868,
    "Rxe8+": 869,
    "Qxe8": 870,
    "Qg7+": 871,
    "Qe7+": 872,
    "Qh4#": 873,
    "Qxb6": 874,
    "Rde8": 875,
    "Rea8": 876,
    "Rcc2": 877,
    "Raxc1+": 878,
    "Rxd1#": 879,
    "Rdf1": 880,
    "Rhf1": 881,
    "Rf2": 882,
    "bxa3": 883,
    "Rxe5": 884,
    "Kxa3": 885,
    "Rh6": 886,
    "Qxc4+": 887,
    "Qxh2+": 888,
    "Rxf4+": 889,
    "Qxf4+": 890,
    "fxe3": 891,
    "Qxe3+": 892,
    "Rbe8": 893,
    "Rfe6": 894,
    "Qxa7": 895,
    "Bxh7+": 896,
    "Bxh5": 897,
    "Bc6+": 898,
    "Bd7+": 899,
    "Rxe5+": 900,
    "Rd5+": 901,
    "Ra6+": 902,
    "Re4+": 903,
    "Ka3": 904,
    "Rh6+": 905,
    "Rf2+": 906,
    "Nd3+": 907,
    "cxd3": 908,
    "Rxd3": 909,
    "g2": 910,
    "Nbc3": 911,
    "Qh4+": 912,
    "Qxd5+": 913,
    "Ngxe5": 914,
    "Bxf4+": 915,
    "Bxe5+": 916,
    "Bh4+": 917,
    "Be1": 918,
    "Qxh4": 919,
    "Rhd1": 920,
    "Rf7+": 921,
    "Rhd8": 922,
    "Rdc1": 923,
    "R4c2": 924,
    "Qxa4": 925,
    "Rh2+": 926,
    "R1d2": 927,
    "Rf8+": 928,
    "exf4+": 929,
    "Ne5+": 930,
    "N7b6": 931,
    "Be5+": 932,
    "Nxe2": 933,
    "Re2+": 934,
    "Na7": 935,
    "Rb7": 936,
    "Rxc1+": 937,
    "Nxg7": 938,
    "Qxc8": 939,
    "Nxg5": 940,
    "Rgxg7+": 941,
    "Rh7+": 942,
    "Rdg7+": 943,
    "Kxb5": 944,
    "Rh5+": 945,
    "Rh3+": 946,
    "c7+": 947,
    "Qxd2+": 948,
    "Nxb3": 949,
    "axb3": 950,
    "Rc2+": 951,
    "Ke1": 952,
    "Rxb3": 953,
    "Rxh7": 954,
    "Ba7": 955,
    "bxa6": 956,
    "Rfb8": 957,
    "Nxa7": 958,
    "Nbxd2": 959,
    "Nb7+": 960,
    "Kxd4": 961,
    "Nc6+": 962,
    "Nc4+": 963,
    "Nd2+": 964,
    "Kxh4": 965,
    "Na3+": 966,
    "Nc3+": 967,
    "Bc4+": 968,
    "Rxb1": 969,
    "Qxb1": 970,
    "Rxa5": 971,
    "Qxe7+": 972,
    "Rxd2+": 973,
    "Na2": 974,
    "Ra8+": 975,
    "Qe4+": 976,
    "Kxh6": 977,
    "Qf8+": 978,
    "g4+": 979,
    "fxg5+": 980,
    "cxb6": 981,
    "Rc1+": 982,
    "Ba1": 983,
    "Rhg1": 984,
    "Rdg1": 985,
    "Qb8+": 986,
    "R4g3": 987,
    "R1g2": 988,
    "e2": 989,
    "exd6": 990,
    "Nxh6+": 991,
    "gxh6": 992,
    "Qxh5": 993,
    "Rexe4": 994,
    "Reh4": 995,
    "exd3": 996,
    "Qxh8": 997,
    "Rxh8+": 998,
    "Kxh8": 999,
    "Nxa2": 1000,
    "Bxb3": 1001,
    "Qxb3+": 1002,
    "Rxh6+": 1003,
    "Rdxf7": 1004,
    "gxf7": 1005,
    "Nde4": 1006,
    "Nxa6": 1007,
    "Qxh6+": 1008,
    "Kxe2": 1009,
    "Bxb5+": 1010,
    "Raxd4": 1011,
    "Raa6": 1012,
    "Rdd7": 1013,
    "Rde6": 1014,
    "Rxg6+": 1015,
    "Re7+": 1016,
    "g7+": 1017,
    "g8=Q+": 1018,
    "Bh8": 1019,
    "Nbxc5": 1020,
    "Nxd1": 1021,
    "Nbc6": 1022,
    "Qxa8": 1023,
    "bxc2": 1024,
    "Qb3+": 1025,
    "Nc7+": 1026,
    "Rxa7+": 1027,
    "Nxg4+": 1028,
    "Nxd3+": 1029,
    "Bxf6+": 1030,
    "Rdc8": 1031,
    "Kxb6": 1032,
    "Bc8+": 1033,
    "a8=Q": 1034,
    "Rxa8+": 1035,
    "Kxa8": 1036,
    "Bf5+": 1037,
    "Ne8#": 1038,
    "Nde2": 1039,
    "N6d7": 1040,
    "Nab3": 1041,
    "Qxg3+": 1042,
    "Bg8": 1043,
    "Bf5#": 1044,
    "Nce5": 1045,
    "Rhc1": 1046,
    "Nxd5+": 1047,
    "Rxb8+": 1048,
    "Rxh8": 1049,
    "Bxc5+": 1050,
    "Be4+": 1051,
    "Qxc3+": 1052,
    "Bxc4+": 1053,
    "Bc2+": 1054,
    "Reb1": 1055,
    "N2xa3": 1056,
    "c4+": 1057,
    "Bf3+": 1058,
    "Ndxe5": 1059,
    "Ree1": 1060,
    "Raxc8": 1061,
    "Ndb6": 1062,
    "Nxe2+": 1063,
    "Nc1+": 1064,
    "Nb3+": 1065,
    "Kxf5": 1066,
    "Kxg3": 1067,
    "g3+": 1068,
    "g1=Q": 1069,
    "Nce6": 1070,
    "Nfd5": 1071,
    "gxf5+": 1072,
    "hxg4+": 1073,
    "Kxg4": 1074,
    "Rxa2+": 1075,
    "Kxd1": 1076,
    "d6+": 1077,
    "dxc7": 1078,
    "fxg4+": 1079,
    "Rh7#": 1080,
    "Qxd1+": 1081,
    "Rfd8+": 1082,
    "Ne6+": 1083,
    "Nxb5+": 1084,
    "Rc3+": 1085,
    "Rxd8+": 1086,
    "Rhb1": 1087,
    "N6d4": 1088,
    "g5+": 1089,
    "Ne1+": 1090,
    "Nbd5": 1091,
    "Ba3+": 1092,
    "Qxc5+": 1093,
    "Kxe8": 1094,
    "Qxe1": 1095,
    "Bg5+": 1096,
    "Bh2": 1097,
    "Kxe6": 1098,
    "Bd4+": 1099,
    "Bxe2": 1100,
    "Qh8": 1101,
    "Rh1+": 1102,
    "Kxf3": 1103,
    "Qh2": 1104,
    "Rc4#": 1105,
    "Qa5+": 1106,
    "Rec8": 1107,
    "dxe7": 1108,
    "N3d2": 1109,
    "hxg3+": 1110,
    "Rde1": 1111,
    "a5+": 1112,
    "Rfb2": 1113,
    "Raa3": 1114,
    "Rxe6+": 1115,
    "Qxd1": 1116,
    "Bb6+": 1117,
    "f4+": 1118,
    "gxf4+": 1119,
    "Nxd2": 1120,
    "Qxa6+": 1121,
    "Bf4+": 1122,
    "Qxe8+": 1123,
    "Qxh3+": 1124,
    "Nfxd3+": 1125,
    "Nxf4+": 1126,
    "Ne3+": 1127,
    "Kxc3": 1128,
    "Na4+": 1129,
    "Qxe2": 1130,
    "Qxg4+": 1131,
    "Rf5+": 1132,
    "Rcf1": 1133,
    "Rf7#": 1134,
    "Ng3+": 1135,
    "Nxf1+": 1136,
    "Rfg8": 1137,
    "Ndb5": 1138,
    "Ncd7": 1139,
    "Nxe8": 1140,
    "N8g7": 1141,
    "Red1": 1142,
    "Nexg3": 1143,
    "e6+": 1144,
    "Qxh4+": 1145,
    "Nh6+": 1146,
    "N2g3": 1147,
    "fxg3": 1148,
    "Qa8": 1149,
    "dxe3": 1150,
    "Nec6": 1151,
    "Nbxc6": 1152,
    "Rhb8": 1153,
    "axb4+": 1154,
    "bxa5+": 1155,
    "Kxd6": 1156,
    "N1c3": 1157,
    "Bxe7+": 1158,
    "Rxd6+": 1159,
    "Rff7": 1160,
    "Qg1+": 1161,
    "Qd3+": 1162,
    "Qc2+": 1163,
    "Qxg6+": 1164,
    "h3+": 1165,
    "h2+": 1166,
    "h1=Q#": 1167,
    "Nxh7": 1168,
    "Bxg5+": 1169,
    "gxf7+": 1170,
    "Qxd4+": 1171,
    "Nce4": 1172,
    "Rbf8": 1173,
    "Rgf7": 1174,
    "R6f7": 1175,
    "Rfxf3+": 1176,
    "dxc3": 1177,
    "Bh6+": 1178,
    "a1=Q+": 1179,
    "Nh1": 1180,
    "Be6+": 1181,
    "f7+": 1182,
    "dxc2": 1183,
    "Qa7+": 1184,
    "Qxb2#": 1185,
    "Ndf3": 1186,
    "Nfe5": 1187,
    "Rxa1+": 1188,
    "Rxd7+": 1189,
    "Qg2+": 1190,
    "Qxh3": 1191,
    "Nxh6": 1192,
    "Be3+": 1193,
    "Ncxe4": 1194,
    "Nxf2": 1195,
    "Nf2+": 1196,
    "Qc7+": 1197,
    "Reg1": 1198,
    "Bc7+": 1199,
    "N2xf4": 1200,
    "Bc3+": 1201,
    "Qh7+": 1202,
    "Qc5+": 1203,
    "Ba7+": 1204,
    "Kxd5": 1205,
    "f1=Q": 1206,
    "Qb8#": 1207,
    "Rfe7": 1208,
    "Rae2": 1209,
    "Qxb7+": 1210,
    "Bd3+": 1211,
    "Bxd4+": 1212,
    "Qb2+": 1213,
    "Qh7": 1214,
    "Qxf6+": 1215,
    "Rxc2+": 1216,
    "Nxc7": 1217,
    "Rdd2": 1218,
    "Rxh2": 1219,
    "Rhg2+": 1220,
    "Rbg2+": 1221,
    "Rcc7": 1222,
    "Rgg2": 1223,
    "exf3+": 1224,
    "f3+": 1225,
    "Bg4+": 1226,
    "Qxh1": 1227,
    "Rxh5+": 1228,
    "R8xd6": 1229,
    "Nge5": 1230,
    "Rxb8": 1231,
    "Qxb8": 1232,
    "Nxc8": 1233,
    "Qb1+": 1234,
    "Qxh7+": 1235,
    "Qxd7+": 1236,
    "fxg6+": 1237,
    "e8=Q#": 1238,
    "Kxe1": 1239,
    "bxc5+": 1240,
    "Bxh7": 1241,
    "Ndc3": 1242,
    "N5c3": 1243,
    "Ncb8": 1244,
    "Rec6": 1245,
    "R4c5": 1246,
    "Rfe2": 1247,
    "dxc5+": 1248,
    "Be1+": 1249,
    "Bd5+": 1250,
    "Bxg4+": 1251,
    "Nce2": 1252,
    "Nxe6+": 1253,
    "Bh2+": 1254,
    "Rbd8": 1255,
    "Nxb8": 1256,
    "fxe5+": 1257,
    "Kxe4": 1258,
    "Rxd3+": 1259,
    "Bxh8": 1260,
    "Kxa6": 1261,
    "Qg3+": 1262,
    "Nxf7+": 1263,
    "b5+": 1264,
    "Rd8#": 1265,
    "Ndc5": 1266,
    "Bxf8+": 1267,
    "Rg8+": 1268,
    "Rxd4+": 1269,
    "Bxd8+": 1270,
    "dxe5+": 1271,
    "exd4+": 1272,
    "R1e2": 1273,
    "Rxe2+": 1274,
    "Bb3+": 1275,
    "h8=Q": 1276,
    "Qd4+": 1277,
    "Rb5+": 1278,
    "b1=Q": 1279,
    "Rce8": 1280,
    "Qa4#": 1281,
    "Qe2#": 1282,
    "Nxa8": 1283,
    "Nxg2+": 1284,
    "Rf4+": 1285,
    "Nxe3+": 1286,
    "O-O-O+": 1287,
    "Kxc7": 1288,
    "Nef6": 1289,
    "Rxg4+": 1290,
    "Bd2+": 1291,
    "N1d2": 1292,
    "Nce7": 1293,
    "axb5+": 1294,
    "Nf1+": 1295,
    "Kxc8": 1296,
    "Nxf1": 1297,
    "exd7+": 1298,
    "Rbc8": 1299,
    "Ncxe5": 1300,
    "Nxh4": 1301,
    "Rdf2": 1302,
    "Rxf3+": 1303,
    "g8=Q#": 1304,
    "Qe5#": 1305,
    "Bxe1": 1306,
    "Naxc4": 1307,
    "Bxh1": 1308,
    "Rxe4+": 1309,
    "Qxg7#": 1310,
    "Rdf7": 1311,
    "R3f5": 1312,
    "R2f4+": 1313,
    "Rf5#": 1314,
    "bxc4+": 1315,
    "Bxc7": 1316,
    "Nxa7+": 1317,
    "Ngxe4": 1318,
    "Bxh2+": 1319,
    "gxf2": 1320,
    "Nh5+": 1321,
    "R8f4": 1322,
    "Rdb1": 1323,
    "Ncd5": 1324,
    "axb7": 1325,
    "Kxg3+": 1326,
    "Bb2+": 1327,
    "Ke8+": 1328,
    "Bxg3+": 1329,
    "Rc4+": 1330,
    "Ra4+": 1331,
    "dxe6+": 1332,
    "cxb6+": 1333,
    "exf6+": 1334,
    "R2e6+": 1335,
    "R8e7+": 1336,
    "b8=Q+": 1337,
    "Raa8": 1338,
    "Qbxc5": 1339,
    "Raa1": 1340,
    "Qcxf4": 1341,
    "Qcd8+": 1342,
    "Qdh8#": 1343,
    "R4c7": 1344,
    "Rdg7": 1345,
    "N8c6": 1346,
    "Rcc8": 1347,
    "Nxg2": 1348,
    "Nxb3+": 1349,
    "cxb3": 1350,
    "Bxe4+": 1351,
    "Nxb4+": 1352,
    "b4+": 1353,
    "Nge4": 1354,
    "R3d2": 1355,
    "e4+": 1356,
    "Bc1+": 1357,
    "Rcb1": 1358,
    "Rxb6+": 1359,
    "N4c6": 1360,
    "Neg5": 1361,
    "Rfe1+": 1362,
    "Rdd3": 1363,
    "Rbc3+": 1364,
    "Rec3+": 1365,
    "e8=Q+": 1366,
    "Qg1": 1367,
    "Qaf3+": 1368,
    "Qgg4+": 1369,
    "Qgf3+": 1370,
    "Qfe3": 1371,
    "Qec1": 1372,
    "Qcc2": 1373,
    "Qaxc6": 1374,
    "Q7c6": 1375,
    "Qxc6+": 1376,
    "Bxd6+": 1377,
    "Na6+": 1378,
    "Rb4+": 1379,
    "Ned6": 1380,
    "cxb7": 1381,
    "Nxf2+": 1382,
    "Qh6#": 1383,
    "Bxa4": 1384,
    "gxh2+": 1385,
    "Rxe3+": 1386,
    "Rdg8": 1387,
    "R8xg7": 1388,
    "Naxc5": 1389,
    "Rbe1": 1390,
    "Qxg5+": 1391,
    "Rxg5+": 1392,
    "e1=Q": 1393,
    "Qxb5+": 1394,
    "Rg8#": 1395,
    "Bxg2+": 1396,
    "R6c5": 1397,
    "fxe7": 1398,
    "Bxd3+": 1399,
    "Qxf7+": 1400,
    "Rad3": 1401,
    "Kxb7": 1402,
    "Rbxd6": 1403,
    "fxe4+": 1404,
    "Bg1+": 1405,
    "Rfa8": 1406,
    "R8a3": 1407,
    "Red7": 1408,
    "Qxf5+": 1409,
    "Rfc7": 1410,
    "Kxc2": 1411,
    "gxh5+": 1412,
    "Nb2": 1413,
    "Qe1#": 1414,
    "Rbd5": 1415,
    "Ne5#": 1416,
    "Rxc4+": 1417,
    "Rec5": 1418,
    "Rcf2+": 1419,
    "Rgf2+": 1420,
    "Rfd2": 1421,
    "Rxf2+": 1422,
    "Nxg5+": 1423,
    "Ra1#": 1424,
    "Qhxf8": 1425,
    "Raa7": 1426,
    "Reb8": 1427,
    "d5+": 1428,
    "cxd5+": 1429,
    "Nec3": 1430,
    "R8c6": 1431,
    "Rca5": 1432,
    "Rbb2": 1433,
    "Ned5": 1434,
    "Qxb4+": 1435,
    "Nde7": 1436,
    "Rhxe7": 1437,
    "Rdd1": 1438,
    "Nfg5": 1439,
    "Re8#": 1440,
    "Qhf6": 1441,
    "Qgxf5+": 1442,
    "Qfd5+": 1443,
    "Qec6+": 1444,
    "Qdb5+": 1445,
    "Qca6#": 1446,
    "Rxg3+": 1447,
    "R1d6+": 1448,
    "Nbxd7": 1449,
    "Rbb7": 1450,
    "Bxb8+": 1451,
    "Kxb8": 1452,
    "Rhh7": 1453,
    "d2+": 1454,
    "Qb3#": 1455,
    "Bh3+": 1456,
    "cxb2": 1457,
    "N1e2": 1458,
    "Qa1#": 1459,
    "Rff8": 1460,
    "Rdf8": 1461,
    "dxe2": 1462,
    "Ne8+": 1463,
    "Nxc7+": 1464,
    "Rc8#": 1465,
    "Rbe6": 1466,
    "Rxa5+": 1467,
    "Rfxf7": 1468,
    "Bxe8+": 1469,
    "Bh5+": 1470,
    "Qxc7+": 1471,
    "Kg5+": 1472,
    "Bg6+": 1473,
    "Qxa8+": 1474,
    "Rxc5+": 1475,
    "Rxd5+": 1476,
    "Qd5#": 1477,
    "Rcb3": 1478,
    "Ndxe4": 1479,
    "Ncxd4": 1480,
    "Rbc7": 1481,
    "Rcxc7": 1482,
    "Rd4+": 1483,
    "Rfe5": 1484,
    "R8e7": 1485,
    "Rexd7": 1486,
    "Rff5": 1487,
    "N7f6": 1488,
    "Reb2": 1489,
    "Rbe2": 1490,
    "R8d6": 1491,
    "R6d2+": 1492,
    "Bxb1": 1493,
    "Qb4+": 1494,
    "Qg5#": 1495,
    "Bxf1+": 1496,
    "Rxh2+": 1497,
    "Qxa1+": 1498,
    "f6+": 1499,
    "R8b6": 1500,
    "d4+": 1501,
    "d3+": 1502,
    "Qf2#": 1503,
    "Nac4": 1504,
    "Nxg7+": 1505,
    "Bf1+": 1506,
    "e2+": 1507,
    "Bg7+": 1508,
    "b1=Q+": 1509,
    "Ngf4": 1510,
    "cxb7+": 1511,
    "Nxe5+": 1512,
    "Nxh1+": 1513,
    "Kxh1": 1514,
    "Qxf1+": 1515,
    "Qxc2+": 1516,
    "f2+": 1517,
    "Nd1+": 1518,
    "Nb4+": 1519,
    "Rff2": 1520,
    "exd3+": 1521,
    "Rcc4": 1522,
    "N7c5": 1523,
    "hxg5+": 1524,
    "Reg8": 1525,
    "R8g7": 1526,
    "Rf3+": 1527,
    "Nb8+": 1528,
    "R6a7": 1529,
    "N5e4": 1530,
    "Nef3": 1531,
    "Ned2": 1532,
    "h5+": 1533,
    "c1=Q+": 1534,
    "Rdh3": 1535,
    "Bf6+": 1536,
    "e5+": 1537,
    "Bxe8": 1538,
    "exd2": 1539,
    "Qxf8+": 1540,
    "N8e7": 1541,
    "Rhg7": 1542,
    "Rag1": 1543,
    "Na5+": 1544,
    "N4d5": 1545,
    "Nfe7": 1546,
    "Rcb8": 1547,
    "h1=Q+": 1548,
    "Ncd6": 1549,
    "Rxc3+": 1550,
    "N5f6": 1551,
    "Rxg8+": 1552,
    "Rfd7": 1553,
    "Rde2": 1554,
    "N5g4": 1555,
    "Rh1#": 1556,
    "Ref8": 1557,
    "g2+": 1558,
    "Qxd6+": 1559,
    "Rxc7+": 1560,
    "axb2": 1561,
    "gxh4+": 1562,
    "Nbxd5": 1563,
    "gxh6+": 1564,
    "Raxe7": 1565,
    "Rfc2": 1566,
    "R1c2": 1567,
    "N6h5": 1568,
    "c2+": 1569,
    "Nxb1": 1570,
    "Rdxd4": 1571,
    "Rcxc5": 1572,
    "Qd7#": 1573,
    "Red4": 1574,
    "R4d2": 1575,
    "hxg6+": 1576,
    "c5+": 1577,
    "Qxh2": 1578,
    "Qxg1+": 1579,
    "Rea1": 1580,
    "c3+": 1581,
    "Rfa1": 1582,
    "Nfxe5": 1583,
    "Bb8+": 1584,
    "Kxh3": 1585,
    "Bg3+": 1586,
    "Rcg1": 1587,
    "Rbb1": 1588,
    "Nxa2+": 1589,
    "Rcxd7": 1590,
    "Qb5#": 1591,
    "Nfd4": 1592,
    "R8c7": 1593,
    "Nfxd4": 1594,
    "Qbb7+": 1595,
    "Bxb4+": 1596,
    "Nh8": 1597,
    "gxf2+": 1598,
    "Nh2+": 1599,
    "Nde5": 1600,
    "Nxh7+": 1601,
    "Rxh4+": 1602,
    "Nxh2+": 1603,
    "Rah1": 1604,
    "Rdxd6": 1605,
    "R6h4": 1606,
    "R1b2": 1607,
    "Qh7#": 1608,
    "Nxd6+": 1609,
    "Nxh8": 1610,
    "Bxd5+": 1611,
    "gxh3+": 1612,
    "Rh4+": 1613,
    "Nb6+": 1614,
    "exd6+": 1615,
    "dxe8=Q+": 1616,
    "Rca1": 1617,
    "R1a7": 1618,
    "R8f2+": 1619,
    "Rdh8": 1620,
    "Qce3#": 1621,
    "Nxb6+": 1622,
    "Rcb2": 1623,
    "Rgf8": 1624,
    "Rbc1": 1625,
    "R5b2": 1626,
    "R6b2": 1627,
    "R4b3": 1628,
    "R5b3": 1629,
    "Qc1#": 1630,
    "R5e2": 1631,
    "Nh4+": 1632,
    "Nxh3+": 1633,
    "e1=R": 1634,
    "R5b7": 1635,
    "Nexd4": 1636,
    "Bf7+": 1637,
    "Ned3": 1638,
    "e8=Q": 1639,
    "h4+": 1640,
    "Qe8#": 1641,
    "Rexc4": 1642,
    "Rab4+": 1643,
    "Rcb7+": 1644,
    "Rab7+": 1645,
    "fxe3+": 1646,
    "Rad8+": 1647,
    "Bd1+": 1648,
    "Rhh1": 1649,
    "Rad1+": 1650,
    "Nxc4+": 1651,
    "Rfxf6+": 1652,
    "Rcd5": 1653,
    "Kc4+": 1654,
    "Nxf8+": 1655,
    "Bxa4+": 1656,
    "Qxa5+": 1657,
    "c8=Q+": 1658,
    "R1e7": 1659,
    "Ncb4": 1660,
    "Rxh7+": 1661,
    "R1d4": 1662,
    "Nhg4": 1663,
    "cxb3+": 1664,
    "Nd8+": 1665,
    "Nce3": 1666,
    "R1xe6": 1667,
    "Ned7": 1668,
    "Qxe1+": 1669,
    "R4e7": 1670,
    "Nxa6+": 1671,
    "Raf2": 1672,
    "Rbb8": 1673,
    "Qxg8+": 1674,
    "e7+": 1675,
    "dxc4+": 1676,
    "Rha8": 1677,
    "c8=Q#": 1678,
    "R2xh4": 1679,
    "Nh7+": 1680,
    "Nhxf6+": 1681,
    "R1xc2": 1682,
    "Nfe2": 1683,
    "Ncd4": 1684,
    "Ndf4": 1685,
    "Rde3": 1686,
    "Rad2": 1687,
    "R2d5": 1688,
    "bxc7": 1689,
    "cxd4+": 1690,
    "Bxe2+": 1691,
    "Qg3#": 1692,
    "Bd2#": 1693,
    "Rdb7": 1694,
    "Bd8+": 1695,
    "Rbe7": 1696,
    "Qxe2+": 1697,
    "Rhg8+": 1698,
    "Rdd6": 1699,
    "Ncb5": 1700,
    "Ndf7": 1701,
    "R5d2": 1702,
    "Rgc8": 1703,
    "R8d7": 1704,
    "Rda2": 1705,
    "exd5+": 1706,
    "Nxh5+": 1707,
    "Nxg3+": 1708,
    "Qxh3#": 1709,
    "Qc7#": 1710,
    "exf2+": 1711,
    "Qxc8+": 1712,
    "Raxd1": 1713,
    "d1=Q+": 1714,
    "Qb2#": 1715,
    "Rhh8": 1716,
    "Ndxe6": 1717,
    "Rcc1": 1718,
    "Rfg1": 1719,
    "Rac4": 1720,
    "Nexd5": 1721,
    "Neg4": 1722,
    "Ndc7": 1723,
    "Rbxb7": 1724,
    "Rba7": 1725,
    "Ree3": 1726,
    "Rda7": 1727,
    "R1f6": 1728,
    "Bg8+": 1729,
    "Nxc2+": 1730,
    "Rcd4": 1731,
    "Qg2#": 1732,
    "Qa3+": 1733,
    "Qxa2+": 1734,
    "Rhd3": 1735,
    "Ncd1": 1736,
    "Nec4+": 1737,
    "R3b7": 1738,
    "Raxf1": 1739,
    "Rgb8": 1740,
    "N5b6": 1741,
    "N4f3": 1742,
    "Rfe4": 1743,
    "Na1": 1744,
    "Rdf4": 1745,
    "Nc5#": 1746,
    "hxg2": 1747,
    "Nhf5": 1748,
    "Nbxd4": 1749,
    "dxe2+": 1750,
    "Re5#": 1751,
    "Rbc4": 1752,
    "R4c3": 1753,
    "Ba5+": 1754,
    "Nge3": 1755,
    "Qcb7#": 1756,
    "Qxc1+": 1757,
    "Rcc6": 1758,
    "Rgc6": 1759,
    "Rgd6": 1760,
    "f7#": 1761,
    "R1c6": 1762,
    "fxe6+": 1763,
    "Ba2+": 1764,
    "Bxf5+": 1765,
    "Ndb4": 1766,
    "Ngxh4": 1767,
    "N3d4": 1768,
    "N6d5": 1769,
    "Rbf2#": 1770,
    "Rcf8": 1771,
    "Rhg3": 1772,
    "Kxa7": 1773,
    "fxe1=Q+": 1774,
    "R8f7": 1775,
    "Nhxf5": 1776,
    "Bxa6+": 1777,
    "Qxb6+": 1778,
    "Nxc3+": 1779,
    "R5xc6": 1780,
    "Rae1+": 1781,
    "Rhh5": 1782,
    "Rcf5": 1783,
    "Qf6#": 1784,
    "Ree6": 1785,
    "Rhf7": 1786,
    "Reg6": 1787,
    "Rgg6": 1788,
    "bxc3+": 1789,
    "Ref6": 1790,
    "Qcc4": 1791,
    "Qdb5": 1792,
    "Qbb3+": 1793,
    "Qca4": 1794,
    "Qaa2": 1795,
    "Rae6": 1796,
    "Rac3": 1797,
    "Na2+": 1798,
    "Rdc5": 1799,
    "R2e7": 1800,
    "Rdd5": 1801,
    "Raa5": 1802,
    "Rxh1+": 1803,
    "Reb6": 1804,
    "Rxb1+": 1805,
    "Bd6+": 1806,
    "Qd2#": 1807,
    "Nf2#": 1808,
    "N2f3": 1809,
    "Nhf6": 1810,
    "Rfxf2": 1811,
    "exf2": 1812,
    "R4xc5": 1813,
    "R7c3": 1814,
    "N6e5": 1815,
    "N3b4": 1816,
    "Rfxa1": 1817,
    "R1a3": 1818,
    "R8b3+": 1819,
    "R8b2": 1820,
    "R1e3": 1821,
    "Ncxe7": 1822,
    "Rda1": 1823,
    "Rab6": 1824,
    "Kxb1": 1825,
    "Rdb2": 1826,
    "R6a2": 1827,
    "Nfh5": 1828,
    "Qxd3#": 1829,
    "Rae5": 1830,
    "R5e4": 1831,
    "R8xd3": 1832,
    "fxg3+": 1833,
    "Neg3": 1834,
    "Nexg4": 1835,
    "g1=Q+": 1836,
    "Rah8": 1837,
    "Bxh3+": 1838,
    "Qxb8+": 1839,
    "Nxd8+": 1840,
    "cxd2+": 1841,
    "Rbf2": 1842,
    "Rba8": 1843,
    "Nac3": 1844,
    "Rexd6": 1845,
    "Nf8+": 1846,
    "dxc2+": 1847,
    "a6+": 1848,
    "a7+": 1849,
    "Rxa4+": 1850,
    "Qa8#": 1851,
    "Nef4+": 1852,
    "bxa2": 1853,
    "Rbxb5+": 1854,
    "Qd4#": 1855,
    "Nfg3": 1856,
    "R4f6": 1857,
    "Qxa4+": 1858,
    "Bxc2+": 1859,
    "cxd2": 1860,
    "Be7+": 1861,
    "Rec3": 1862,
    "Rgh6": 1863,
    "Ngxe2": 1864,
    "Rxb4+": 1865,
    "a8=Q+": 1866,
    "Rbxc7": 1867,
    "Rgf6+": 1868,
    "N8d7": 1869,
    "Rac2": 1870,
    "R8xc5": 1871,
    "Red3": 1872,
    "Qf7#": 1873,
    "Rxg1": 1874,
    "dxc1=Q": 1875,
    "Rgxd7+": 1876,
    "Nfxg4": 1877,
    "Rcf7+": 1878,
    "bxc2+": 1879,
    "Rxa3+": 1880,
    "N8h7": 1881,
    "Rff6": 1882,
    "Rgc1": 1883,
    "Rfg6": 1884,
    "R8d4": 1885,
    "fxg7": 1886,
    "Ncb1": 1887,
    "Nxd2+": 1888,
    "R8e3": 1889,
    "Rhc4": 1890,
    "R4c6+": 1891,
    "Rge7": 1892,
    "R7e6": 1893,
    "R5e6": 1894,
    "Bxb2+": 1895,
    "Qxa3+": 1896,
    "fxe7+": 1897,
    "Nge7+": 1898,
    "Red6": 1899,
    "R1xg2": 1900,
    "axb6+": 1901,
    "Ba4+": 1902,
    "Qe6#": 1903,
    "Rcb7": 1904,
    "Rca2": 1905,
    "R3xd5": 1906,
    "Ncxe6": 1907,
    "Nab7": 1908,
    "Qh8#": 1909,
    "R3g2": 1910,
    "Ndxb4": 1911,
    "Rca8": 1912,
    "Rxa6+": 1913,
    "Qh2#": 1914,
    "R1f4+": 1915,
    "N6e7": 1916,
    "Kxa2": 1917,
    "Qxa7+": 1918,
    "Qxf6#": 1919,
    "Rgd8": 1920,
    "R7b6": 1921,
    "R6b3": 1922,
    "R1xb4": 1923,
    "Bf8+": 1924,
    "Nxg1": 1925,
    "Rac6": 1926,
    "Qf5#": 1927,
    "Nbc5": 1928,
    "Rdc2": 1929,
    "Rbxb8": 1930,
    "Nec7": 1931,
    "Qxh5+": 1932,
    "N1f3": 1933,
    "Nxd1+": 1934,
    "R8xf3": 1935,
    "Rg5#": 1936,
    "Rd1#": 1937,
    "Rfe3": 1938,
    "Bxg1": 1939,
    "gxh2": 1940,
    "Qaa4": 1941,
    "Qaa2+": 1942,
    "Bxh4+": 1943,
    "Ba6+": 1944,
    "e1=Q+": 1945,
    "Qd8#": 1946,
    "Ndxc4": 1947,
    "Rbc6": 1948,
    "Qxg8": 1949,
    "Rcxb4": 1950,
    "Raa2": 1951,
    "Qd6#": 1952,
    "Kxa1": 1953,
    "b2+": 1954,
    "Qc2#": 1955,
    "R8xf7": 1956,
    "Rbxd3": 1957,
    "Re7#": 1958,
    "Rfxe8": 1959,
    "Nhf4+": 1960,
    "Nde3": 1961,
    "Nef5": 1962,
    "Nhf7": 1963,
    "Bg2+": 1964,
    "Rbxe5": 1965,
    "N1g2": 1966,
    "a4+": 1967,
    "Rgd1": 1968,
    "Nxc1+": 1969,
    "N4a6": 1970,
    "Ree2": 1971,
    "Rac8+": 1972,
    "Rb8#": 1973,
    "Rbxb3": 1974,
    "gxf6+": 1975,
    "Rdb3": 1976,
    "Rgb6": 1977,
    "Rfxf4": 1978,
    "Rxb5+": 1979,
    "Ngh6": 1980,
    "Rfe8+": 1981,
    "Qe3#": 1982,
    "gxf8=Q+": 1983,
    "Rhe8+": 1984,
    "Rdg3": 1985,
    "Ra8#": 1986,
    "R4d3": 1987,
    "exf7": 1988,
    "R6d4": 1989,
    "axb3+": 1990,
    "Bxg7#": 1991,
    "Qaf1": 1992,
    "Rab2": 1993,
    "R3d4": 1994,
    "cxb5+": 1995,
    "a3+": 1996,
    "Rxe8#": 1997,
    "R5c2": 1998,
    "Rcd7": 1999,
    "Qxb7#": 2000,
    "Rfxe1": 2001,
    "Rgg7": 2002,
    "Rhg7+": 2003,
    "Rhg5+": 2004,
    "Rdg5+": 2005,
    "Rgd7": 2006,
    "bxa2+": 2007,
    "Rgxe8": 2008,
    "Rec7": 2009,
    "Rdb5": 2010,
    "Raxf2": 2011,
    "Rbb6": 2012,
    "Rge6": 2013,
    "Rgxg3+": 2014,
    "Qxg2#": 2015,
    "a8=B": 2016,
    "Qxf8#": 2017,
    "Rfxc8": 2018,
    "Rcd6": 2019,
    "Nac6": 2020,
    "N8xd7": 2021,
    "Qba2": 2022,
    "Qh3#": 2023,
    "Be8+": 2024,
    "Ng7+": 2025,
    "Nxc5+": 2026,
    "gxf3+": 2027,
    "Rcxa6": 2028,
    "fxg7+": 2029,
    "Nge8": 2030,
    "Nhg5": 2031,
    "Ngh5": 2032,
    "Nxa3+": 2033,
    "Rb1#": 2034,
    "Rgxg2": 2035,
    "Rfg2+": 2036,
    "Rg1#": 2037,
    "Nfd3": 2038,
    "Na8+": 2039,
    "exf5+": 2040,
    "Rbg8": 2041,
    "Rbh1": 2042,
    "c6+": 2043,
    "Rh8#": 2044,
    "Rff3": 2045,
    "R8xc7": 2046,
    "Nxg3#": 2047,
    "Ncxb4": 2048,
    "Rcxd3": 2049,
    "Red5": 2050,
    "Rgh8": 2051,
    "Ncd2": 2052,
    "Rhc3": 2053,
    "Be6#": 2054,
    "d8=Q+": 2055,
    "Nfxh4": 2056,
    "Rbxh6": 2057,
    "R1h5+": 2058,
    "Rad5": 2059,
    "Rhg6": 2060,
    "R8g4": 2061,
    "Bxc7+": 2062,
    "cxb8=Q": 2063,
    "Ned3+": 2064,
    "Nxc6+": 2065,
    "Qg4#": 2066,
    "Qg1#": 2067,
    "Ngf1": 2068,
    "Rxh1#": 2069,
    "Nxe1+": 2070,
    "R1e5+": 2071,
    "Rcd3": 2072,
    "Nbc8": 2073,
    "R8c5": 2074,
    "Rgf3": 2075,
    "Qhe4": 2076,
    "Qee7": 2077,
    "Qee6": 2078,
    "Qdd5+": 2079,
    "Qee4": 2080,
    "Qdc4": 2081,
    "fxg2": 2082,
    "Rdxd3": 2083,
    "Rce2": 2084,
    "Nfxe4": 2085,
    "Rdb8": 2086,
    "Bxb3+": 2087,
    "Nxd4+": 2088,
    "Ndb8": 2089,
    "Rba1": 2090,
    "Rhd1+": 2091,
    "Red2": 2092,
    "Qxg5#": 2093,
    "Ree7": 2094,
    "d7+": 2095,
    "Rbe4": 2096,
    "Rga4": 2097,
    "Rexg7": 2098,
    "R2g6+": 2099,
    "Rbh2": 2100,
    "R8b5": 2101,
    "Nxa5+": 2102,
    "Rdxc1": 2103,
    "Rcxb2": 2104,
    "R2f7": 2105,
    "Ref3": 2106,
    "Ncxe2": 2107,
    "Rcxc8": 2108,
    "Ngxe6": 2109,
    "Rfxh7": 2110,
    "R3h5": 2111,
    "Kxc1": 2112,
    "Ndb7": 2113,
    "Q4e6#": 2114,
    "Nef4": 2115,
    "R4f7": 2116,
    "Rh4#": 2117,
    "Kxf4+": 2118,
    "gxh7+": 2119,
    "Rhe2": 2120,
    "Rh6#": 2121,
    "Rexd8": 2122,
    "Kxg5+": 2123,
    "Be2+": 2124,
    "e8=B": 2125,
    "Nbc2": 2126,
    "R1b4": 2127,
    "R6b5": 2128,
    "R5b4": 2129,
    "R6xh5": 2130,
    "R3c4": 2131,
    "Rhe1+": 2132,
    "gxh7": 2133,
    "Qbe6+": 2134,
    "Qee2+": 2135,
    "Qff1#": 2136,
    "Kf7+": 2137,
    "Rgf6": 2138,
    "Rxe1#": 2139,
    "Ngf2": 2140,
    "Bf6#": 2141,
    "h8=Q#": 2142,
    "cxd1=Q": 2143,
    "Nhf3": 2144,
    "Rbh8": 2145,
    "R3h4": 2146,
    "Ned5+": 2147,
    "Bg7#": 2148,
    "Nca5": 2149,
    "Nbxc7": 2150,
    "Nfe4+": 2151,
    "Qfxc1+": 2152,
    "Qexc3+": 2153,
    "Q1a3+": 2154,
    "Qaa5#": 2155,
    "Raxd8": 2156,
    "Rcd2": 2157,
    "hxg7": 2158,
    "Qxh7#": 2159,
    "R8e3+": 2160,
    "Rcxc2": 2161,
    "R8b3": 2162,
    "Rbxa1": 2163,
    "Rcf3": 2164,
    "Rae7": 2165,
    "Ncd3": 2166,
    "Bxg6+": 2167,
    "Qb7#": 2168,
    "R1e7+": 2169,
    "R6e7+": 2170,
    "Rgh7": 2171,
    "Bf2+": 2172,
    "Nexc5": 2173,
    "gxf8=Q#": 2174,
    "dxc3+": 2175,
    "b7+": 2176,
    "Rbc3": 2177,
    "Rha1": 2178,
    "Bxb6+": 2179,
    "Rxf6#": 2180,
    "Raxb8": 2181,
    "Rde5": 2182,
    "Rae7+": 2183,
    "Rch1": 2184,
    "R3h2": 2185,
    "Rbf1": 2186,
    "R4f2": 2187,
    "R1f2": 2188,
    "R5f2": 2189,
    "Rcf2": 2190,
    "Rfh8": 2191,
    "b8=R": 2192,
    "Nfe8": 2193,
    "Nc6#": 2194,
    "Nhf4": 2195,
    "Qhd1+": 2196,
    "Qcb6": 2197,
    "Qa7#": 2198,
    "Rcxa7": 2199,
    "Rb5#": 2200,
    "Rca7": 2201,
    "R8f3": 2202,
    "Nec4": 2203,
    "Nfxg5": 2204,
    "Nab4": 2205,
    "Rhd2": 2206,
    "R1f7": 2207,
    "Rec2": 2208,
    "Rfxh6+": 2209,
    "Raxc3": 2210,
    "Nba5": 2211,
    "N5c6": 2212,
    "Nde4+": 2213,
    "R4e3": 2214,
    "Rhd4": 2215,
    "Ref1": 2216,
    "Qf8#": 2217,
    "N6f5": 2218,
    "R4h2": 2219,
    "axb2+": 2220,
    "Qxh1+": 2221,
    "N8g6": 2222,
    "Rdxc3": 2223,
    "Reh7": 2224,
    "bxa7": 2225,
    "Rbd3": 2226,
    "cxd6+": 2227,
    "fxg4#": 2228,
    "Rdxf8": 2229,
    "Rgxg8": 2230,
    "N8xb6": 2231,
    "Ncxb6": 2232,
    "Rac7": 2233,
    "Rfb8+": 2234,
    "Nba4": 2235,
    "Qxg4#": 2236,
    "Rfxe7": 2237,
    "Nf7#": 2238,
    "Rgf2": 2239,
    "Rhh2": 2240,
    "R7f2": 2241,
    "Rhxd2": 2242,
    "Nxe2#": 2243,
    "Ba6#": 2244,
    "Nge1": 2245,
    "c1=R": 2246,
    "Rxh3#": 2247,
    "e1=Q#": 2248,
    "Qh5#": 2249,
    "Nfe6": 2250,
    "Qde1": 2251,
    "Q1e2+": 2252,
    "Qff2#": 2253,
    "Rcf7": 2254,
    "Rfg2": 2255,
    "Ref5": 2256,
    "R2g4": 2257,
    "R7f2+": 2258,
    "Qxc4#": 2259,
    "Bxh6+": 2260,
    "N6xg4": 2261,
    "Qch8#": 2262,
    "Rfxd5": 2263,
    "Nfxh2": 2264,
    "R5f6": 2265,
    "Rhf4": 2266,
    "Ndf3+": 2267,
    "R1xd3": 2268,
    "Rfxf1+": 2269,
    "Rgxg3": 2270,
    "R5d6": 2271,
    "Rcd3+": 2272,
    "Nb2+": 2273,
    "R8a4": 2274,
    "N1h3": 2275,
    "Rdg2": 2276,
    "R2g6": 2277,
    "Rdg4": 2278,
    "N2e4": 2279,
    "Na7+": 2280,
    "dxc8=Q": 2281,
    "gxh8=Q": 2282,
    "Bxb5#": 2283,
    "Rbxf6+": 2284,
    "Rexe3": 2285,
    "Rfxf2+": 2286,
    "Red1+": 2287,
    "Neg7": 2288,
    "R1g3": 2289,
    "Rexe2": 2290,
    "Rhc2": 2291,
    "Rf4#": 2292,
    "Qbe8+": 2293,
    "Ndc6": 2294,
    "bxa4+": 2295,
    "Kf5+": 2296,
    "Kf6+": 2297,
    "Nhg3": 2298,
    "Nge6": 2299,
    "Nde6": 2300,
    "Qxe3#": 2301,
    "Qxe8#": 2302,
    "Rab8+": 2303,
    "R1xd4": 2304,
    "Nfxd7": 2305,
    "Ndf4+": 2306,
    "N3f4": 2307,
    "Bxa3+": 2308,
    "R4xd7": 2309,
    "Rba2": 2310,
    "Ngh2": 2311,
    "cxd3+": 2312,
    "R3f2": 2313,
    "R4f3": 2314,
    "Ndxc5": 2315,
    "a2+": 2316,
    "Kc2#": 2317,
    "bxa3+": 2318,
    "Rexc6": 2319,
    "Nhxf3+": 2320,
    "Rfd4": 2321,
    "R2e6": 2322,
    "bxc6+": 2323,
    "Rgxg7": 2324,
    "Reg7+": 2325,
    "Rgc7": 2326,
    "Raxb4": 2327,
    "R5f4": 2328,
    "R5e7": 2329,
    "N5a4": 2330,
    "Rgxg6": 2331,
    "Rgxf5": 2332,
    "Rg6#": 2333,
    "R2b7": 2334,
    "Qb6#": 2335,
    "d8=Q#": 2336,
    "R5d7": 2337,
    "c1=R#": 2338,
    "R2c7": 2339,
    "R1d5": 2340,
    "Rgf4": 2341,
    "Qec2+": 2342,
    "Q2b2": 2343,
    "a1=Q#": 2344,
    "R6e7": 2345,
    "R5d3": 2346,
    "Rbxa3": 2347,
    "Kc6+": 2348,
    "Reg5": 2349,
    "Bb7+": 2350,
    "R6c7": 2351,
    "Ndb3": 2352,
    "R7d6": 2353,
    "f1=Q+": 2354,
    "Rbxb2": 2355,
    "Rdh7": 2356,
    "R4h6": 2357,
    "Ne2#": 2358,
    "R2d4": 2359,
    "Kc7+": 2360,
    "Bf7#": 2361,
    "Ra5#": 2362,
    "Rhf6": 2363,
    "Nec5": 2364,
    "Nec1": 2365,
    "Nhf8": 2366,
    "Rdxb3": 2367,
    "Rhxg5": 2368,
    "Rcxd8": 2369,
    "Rdc3": 2370,
    "Rfh1": 2371,
    "Rdf6": 2372,
    "R8h3": 2373,
    "Ncxd5": 2374,
    "Rdc7": 2375,
    "N4b3": 2376,
    "Qxe1#": 2377,
    "Rcb4": 2378,
    "Rdf3": 2379,
    "Rfxf5": 2380,
    "cxd7": 2381,
    "Rec4": 2382,
    "Rag2+": 2383,
    "Ncd3+": 2384,
    "N7g6": 2385,
    "Rgf5": 2386,
    "Rbxe4": 2387,
    "gxf6#": 2388,
    "Nfg6": 2389,
    "Nf4#": 2390,
    "Rfxc3+": 2391,
    "R4c3+": 2392,
    "Rgh3": 2393,
    "R1c5+": 2394,
    "Rdf3+": 2395,
    "Rge3": 2396,
    "R6d2": 2397,
    "cxb4+": 2398,
    "Rexe5": 2399,
    "Nge5+": 2400,
    "Rda8": 2401,
    "Ndxc6": 2402,
    "R7c4": 2403,
    "Nec2": 2404,
    "Qab2+": 2405,
    "R2xc3": 2406,
    "Rd6#": 2407,
    "Ree4": 2408,
    "Rce4": 2409,
    "Rfd1+": 2410,
    "Rac1+": 2411,
    "R7f5": 2412,
    "R4e2": 2413,
    "N7e5": 2414,
    "Nexf7": 2415,
    "Ncd8": 2416,
    "Raxa7": 2417,
    "Reb7": 2418,
    "Qxf7#": 2419,
    "Qbd1": 2420,
    "Rbe1+": 2421,
    "Kd3+": 2422,
    "Kb3+": 2423,
    "N5d4+": 2424,
    "N8a7": 2425,
    "N6c5+": 2426,
    "Ka7+": 2427,
    "Nb6#": 2428,
    "R8e2+": 2429,
    "Rbc2": 2430,
    "N5d4": 2431,
    "Qeh1+": 2432,
    "Qhxh5#": 2433,
    "Rbf7+": 2434,
    "Ref7+": 2435,
    "Rde7+": 2436,
    "R2d6": 2437,
    "Nxg1+": 2438,
    "Rcd5+": 2439,
    "h1=B+": 2440,
    "R1f3": 2441,
    "Ncxd3": 2442,
    "Bb1+": 2443,
    "Bc3#": 2444,
    "Ndf6+": 2445,
    "Ndxf3": 2446,
    "g4#": 2447,
    "Ncxe5+": 2448,
    "Rfxd1": 2449,
    "Qxh8+": 2450,
    "R1d7+": 2451,
    "R8xd7": 2452,
    "R1xe4": 2453,
    "R8f6": 2454,
    "Rhe2+": 2455,
    "Rbd2+": 2456,
    "Rbd2": 2457,
    "Rbb3": 2458,
    "Rhxg1": 2459,
    "Rc1#": 2460,
    "Rbf4": 2461,
    "Nbc7": 2462,
    "Rexd5": 2463,
    "g1=Q#": 2464,
    "Qxg1": 2465,
    "Nh4#": 2466,
    "N4a5": 2467,
    "Ref2": 2468,
    "Rfh4": 2469,
    "N8e6": 2470,
    "Raf8+": 2471,
    "R8h3+": 2472,
    "Reb4": 2473,
    "Rgg4": 2474,
    "Ref4": 2475,
    "Rad6": 2476,
    "R6d7+": 2477,
    "Rxh2#": 2478,
    "Rbe5": 2479,
    "R3e2": 2480,
    "Nhxf4": 2481,
    "Rab5": 2482,
    "h8=N": 2483,
    "Qc8#": 2484,
    "d1=B": 2485,
    "d6#": 2486,
    "N4e5": 2487,
    "Qxh2#": 2488,
    "Qa2#": 2489,
    "Kb6+": 2490,
    "Ndxe7": 2491,
    "N8a6": 2492,
    "Nbxa3": 2493,
    "Rdh1": 2494,
    "Nfg4": 2495,
    "Rdxe6": 2496,
    "N5a3": 2497,
    "Rdxf2+": 2498,
    "R2f3": 2499,
    "Rae4": 2500,
    "Rfd3": 2501,
    "dxc6+": 2502,
    "R6d5": 2503,
    "R1xd7+": 2504,
    "R5xb3": 2505,
    "R5xf7": 2506,
    "Rdh2": 2507,
    "Ndb5+": 2508,
    "Bxd1+": 2509,
    "exd1=Q+": 2510,
    "Qfg5#": 2511,
    "Rcxc4": 2512,
    "R1d3": 2513,
    "R6e3": 2514,
    "Qee4+": 2515,
    "Qdd3+": 2516,
    "Qdd1#": 2517,
    "Rcg7+": 2518,
    "Ke4+": 2519,
    "Rexf5": 2520,
    "Ng3#": 2521,
    "Ndxb5": 2522,
    "R6d7": 2523,
    "Re1#": 2524,
    "Ncxb5": 2525,
    "R7d4": 2526,
    "Rcc5": 2527,
    "Rfd5": 2528,
    "Rge4": 2529,
    "R2e3": 2530,
    "Rexd1": 2531,
    "R1e4": 2532,
    "Rexd4": 2533,
    "R8d7+": 2534,
    "R7d3": 2535,
    "Rhb2": 2536,
    "R5c3": 2537,
    "R3c2": 2538,
    "Ke5+": 2539,
    "R1d7": 2540,
    "Rdxc4": 2541,
    "Rdb6": 2542,
    "Reg4": 2543,
    "Rf2#": 2544,
    "Rhf3": 2545,
    "R6e2": 2546,
    "R5f7": 2547,
    "Rcxb5": 2548,
    "Rgxe5": 2549,
    "Rce5": 2550,
    "Rhh3": 2551,
    "Rge5": 2552,
    "Qcf1#": 2553,
    "Ndxe3": 2554,
    "Rde4": 2555,
    "Rcg8": 2556,
    "Rfxc1": 2557,
    "R8d5": 2558,
    "Rdxd2": 2559,
    "Rge2+": 2560,
    "Rfe2+": 2561,
    "Nba3": 2562,
    "Rexc7": 2563,
    "R5c6": 2564,
    "Rcf4": 2565,
    "Rhxh7": 2566,
    "Rfd6": 2567,
    "Qgd2+": 2568,
    "R4c6": 2569,
    "Nhf3+": 2570,
    "Rcc3": 2571,
    "Rcb6": 2572,
    "Ra7#": 2573,
    "Rdxf3+": 2574,
    "Rdg3+": 2575,
    "Raxc1": 2576,
    "Rdh6": 2577,
    "R6h2+": 2578,
    "R1h2+": 2579,
    "R3h2+": 2580,
    "Rbxc3": 2581,
    "Nxa4+": 2582,
    "Kd4+": 2583,
    "Ned8": 2584,
    "Q8b4": 2585,
    "fxe8=Q": 2586,
    "Nxc8+": 2587,
    "Nce8": 2588,
    "N6xe5": 2589,
    "Rdxc5": 2590,
    "Qbb8+": 2591,
    "R1xc4": 2592,
    "Naxb2": 2593,
    "Rfg3": 2594,
    "Ncb6": 2595,
    "Rdd4": 2596,
    "N4b6": 2597,
    "Rgg8": 2598,
    "Rhg2": 2599,
    "Rc6#": 2600,
    "Rgc3": 2601,
    "d1=Q#": 2602,
    "Rexd3": 2603,
    "Qf3#": 2604,
    "Rdxd1": 2605,
    "Rdxe1": 2606,
    "Rac5": 2607,
    "Rbd6": 2608,
    "R8a7": 2609,
    "R1a6": 2610,
    "Qxg3#": 2611,
    "Rf6#": 2612,
    "R5b6": 2613,
    "e8=R": 2614,
    "R2f4": 2615,
    "Qb1#": 2616,
    "R5h7": 2617,
    "Rgxc6": 2618,
    "Rcxd6": 2619,
    "Rgb1": 2620,
    "Kc2+": 2621,
    "Rae8+": 2622,
    "Qxd1#": 2623,
    "Rcxc3": 2624,
    "Rcg3+": 2625,
    "Nc2#": 2626,
    "N3h4": 2627,
    "f1=N": 2628,
    "b7#": 2629,
    "R8e4": 2630,
    "R2e5": 2631,
    "N7xf6": 2632,
    "R7xe3": 2633,
    "R3xd2": 2634,
    "Nxb1+": 2635,
    "Rdc4": 2636,
    "R8c4": 2637,
    "R2c5": 2638,
    "R8c6+": 2639,
    "R7c6+": 2640,
    "R8c7+": 2641,
    "hxg2+": 2642,
    "R8c3": 2643,
    "R5a3": 2644,
    "Nfxe5+": 2645,
    "Qxe7#": 2646,
    "Rxf1#": 2647,
    "Rfxf6": 2648,
    "cxd1=Q+": 2649,
    "Qgg5+": 2650,
    "Rhc7": 2651,
    "Nab5": 2652,
    "Ngxe7": 2653,
    "Bxh5+": 2654,
    "Qdf6#": 2655,
    "R4xe5": 2656,
    "Nxf6#": 2657,
    "Qfb7": 2658,
    "Qca8#": 2659,
    "Rcxc3+": 2660,
    "Qa3#": 2661,
    "Rxh4#": 2662,
    "Nca3": 2663,
    "Qaa3": 2664,
    "R3a2": 2665,
    "N6xa5": 2666,
    "Rbg1": 2667,
    "R5g3": 2668,
    "R4e5": 2669,
    "Rfb2+": 2670,
    "Rcb2+": 2671,
    "Qbxe4+": 2672,
    "Re2#": 2673,
    "N5xd4": 2674,
    "Rfxf1": 2675,
    "Nac2": 2676,
    "Ndc6+": 2677,
    "Rcg3": 2678,
    "Ncxa6": 2679,
    "Nab8": 2680,
    "R6f4": 2681,
    "Kd6+": 2682,
    "Qfh3": 2683,
    "Q8xb2": 2684,
    "Rh3#": 2685,
    "Ndf5": 2686,
    "Qab8+": 2687,
    "Rxf7#": 2688,
    "R8a6": 2689,
    "R2xg3": 2690,
    "Nb1+": 2691,
    "Rfxf8+": 2692,
    "Reh1": 2693,
    "R5xh4": 2694,
    "Ngf8": 2695,
    "Ng6#": 2696,
    "Nexc6": 2697,
    "Rfc5": 2698,
    "R5c7": 2699,
    "Qhf6+": 2700,
    "Q4h6+": 2701,
    "Qhg7#": 2702,
    "Rgxf2+": 2703,
    "Rad7": 2704,
    "Rc7#": 2705,
    "Raxe1": 2706,
    "Kd5+": 2707,
    "Rbxb5": 2708,
    "Nfxh6": 2709,
    "Nhg4+": 2710,
    "R8xg5": 2711,
    "N5xf6": 2712,
    "Nexf3": 2713,
    "Nexd6": 2714,
    "Nba6": 2715,
    "Nxd7+": 2716,
    "Nexc4": 2717,
    "Kf3+": 2718,
    "N3h2": 2719,
    "Nf3#": 2720,
    "R5xb4": 2721,
    "Raxa4": 2722,
    "Qg8#": 2723,
    "R7d5": 2724,
    "R6xe4": 2725,
    "Rxh6#": 2726,
    "Qgb8+": 2727,
    "Qxc6#": 2728,
    "Rbxf4": 2729,
    "Rgg5": 2730,
    "Qxf2#": 2731,
    "Neg6": 2732,
    "Qxh5#": 2733,
    "N3c4": 2734,
    "R1b7": 2735,
    "R2d7": 2736,
    "hxg7+": 2737,
    "Nexf5": 2738,
    "Bxg5#": 2739,
    "Nbc7+": 2740,
    "Rhe1#": 2741,
    "Rfxe3+": 2742,
    "Rgxc2": 2743,
    "Rgb2": 2744,
    "R1c4": 2745,
    "gxf1=Q+": 2746,
    "R1e6#": 2747,
    "R1h3": 2748,
    "Bxb7+": 2749,
    "Rgxd3": 2750,
    "exf8=Q+": 2751,
    "Raxa1": 2752,
    "R1b3": 2753,
    "Rfxf7+": 2754,
    "N2c3": 2755,
    "d1=R#": 2756,
    "Qxe2#": 2757,
    "Rcxe4": 2758,
    "h8=R+": 2759,
    "cxd7+": 2760,
    "Bh6#": 2761,
    "Qa5#": 2762,
    "R2c3": 2763,
    "Rdxh4": 2764,
    "R8h6": 2765,
    "Nhf1": 2766,
    "Nfxe3": 2767,
    "Rbf7": 2768,
    "Rae3": 2769,
    "Ng4#": 2770,
    "Ndf8": 2771,
    "Rxg8#": 2772,
    "Rdc6": 2773,
    "Rbxb2+": 2774,
    "Rgf7+": 2775,
    "Rfe7+": 2776,
    "f3#": 2777,
    "N1c2": 2778,
    "Ngf5": 2779,
    "c4#": 2780,
    "Rbf2+": 2781,
    "Nb4#": 2782,
    "Reg2": 2783,
    "R8e6": 2784,
    "N5g6": 2785,
    "b4#": 2786,
    "fxe2": 2787,
    "Qhd5+": 2788,
    "Qfd3#": 2789,
    "Rhxc1": 2790,
    "Nxg8+": 2791,
    "Ne6#": 2792,
    "R8g6": 2793,
    "R7g6": 2794,
    "Rbxb7+": 2795,
    "Rgxc3": 2796,
    "R8c2+": 2797,
    "R1c2+": 2798,
    "R4c2#": 2799,
    "Rgh4": 2800,
    "Nbc5+": 2801,
    "Nxb7+": 2802,
    "Qxf1#": 2803,
    "Rgh1": 2804,
    "R4h3": 2805,
    "Nexg5": 2806,
    "Qbd3+": 2807,
    "Qdh3#": 2808,
    "N4a3": 2809,
    "Rhxe2": 2810,
    "Rba5": 2811,
    "Qff3+": 2812,
    "dxe1=Q+": 2813,
