{
    "<|startofgame|>": 1930,
    "d2d4": 1,
    "g8f6": 2,
    "c1f4": 3,
    "g7g6": 4,
    "e2e3": 5,
    "f8g7": 6,
    "g1f3": 7,
    "e8g8": 8,
    "h2h3": 9,
    "d7d6": 10,
    "f1e2": 11,
    "c7c6": 12,
    "e1g1": 13,
    "b8d7": 14,
    "f4h2": 15,
    "f8e8": 16,
    "c2c4": 17,
    "e7e5": 18,
    "b1c3": 19,
    "e5e4": 20,
    "f3d2": 21,
    "d7f8": 22,
    "d1c2": 23,
    "c8f5": 24,
    "c2b3": 25,
    "a8b8": 26,
    "c4c5": 27,
    "d6d5": 28,
    "h2b8": 29,
    "d8b8": 30,
    "b3d1": 31,
    "h7h5": 32,
    "f1e1": 33,
    "h5h4": 34,
    "f2f3": 35,
    "f8h7": 36,
    "f3e4": 37,
    "d5e4": 38,
    "d2c4": 39,
    "e8d8": 40,
    "c4d6": 41,
    "d8d6": 42,
    "c5d6": 43,
    "b8d6": 44,
    "e1f1": 45,
    "h7g5": 46,
    "d1e1": 47,
    "g5h3": 48,
    "g2h3": 49,
    "f5h3": 50,
    "e1h4": 51,
    "h3f1": 52,
    "a1f1": 53,
    "f6d5": 54,
    "c3e4": 55,
    "d6e6": 56,
    "h4d8": 57,
    "g8h7": 58,
    "e4g5": 59,
    "h7h6": 60,
    "g5e6": 61,
    "f7e6": 62,
    "d8h4": 63,
    "1-0": 64,
    "<|endofgame|>": 1930,
    "b7b6": 66,
    "e2e4": 67,
    "c8b7": 68,
    "b8c6": 69,
    "c1e3": 70,
    "d1d2": 71,
    "d8d7": 72,
    "d4d5": 73,
    "c6b4": 74,
    "a2a3": 75,
    "b4a6": 76,
    "b2b4": 77,
    "e8c8": 78,
    "a1b1": 79,
    "e7e6": 80,
    "c3a4": 81,
    "g8e7": 82,
    "b4b5": 83,
    "a6c5": 84,
    "a4c5": 85,
    "d6c5": 86,
    "d2c2": 87,
    "f7f5": 88,
    "e1f2": 89,
    "f5e4": 90,
    "e6d5": 91,
    "f3g5": 92,
    "h8f8": 93,
    "f2e2": 94,
    "d7g4": 95,
    "e2e1": 96,
    "e7f5": 97,
    "c2e2": 98,
    "g4h4": 99,
    "e2f2": 100,
    "h4f2": 101,
    "e3f2": 102,
    "e4e3": 103,
    "f2g3": 104,
    "g7c3": 105,
    "e1e2": 106,
    "d8d2": 107,
    "d2b2": 108,
    "e1d1": 109,
    "b2b1": 110,
    "b1f1": 111,
    "h1f1": 112,
    "c3d4": 113,
    "e6d4": 114,
    "c5d4": 115,
    "b7g2": 116,
    "g3f4": 117,
    "g2e4": 118,
    "d4d3": 119,
    "0-1": 120,
    "d7d5": 121,
    "e4e5": 122,
    "b1d2": 123,
    "d2b3": 124,
    "c6c5": 125,
    "d4c5": 126,
    "a7a5": 127,
    "a2a4": 128,
    "d8c7": 129,
    "f8c5": 130,
    "f3d4": 131,
    "b3d4": 132,
    "f2f4": 133,
    "d4b5": 134,
    "c7d7": 135,
    "b5d6": 136,
    "e8f8": 137,
    "f1d3": 138,
    "d3f5": 139,
    "d6f5": 140,
    "g6f5": 141,
    "f8e7": 142,
    "h8g8": 143,
    "e7e8": 144,
    "b2b3": 145,
    "d7e7": 146,
    "e8d7": 147,
    "g8g4": 148,
    "a8g8": 149,
    "g2g3": 150,
    "d5d4": 151,
    "e3d4": 152,
    "c6d4": 153,
    "f2d4": 154,
    "d7c8": 155,
    "d4a7": 156,
    "e7h4": 157,
    "a7a8": 158,
    "c8c7": 159,
    "a8a5": 160,
    "a1d1": 161,
    "a5c5": 162,
    "c5c8": 163,
    "e8e7": 164,
    "d1d7": 165,
    "c1b2": 166,
    "c7c5": 167,
    "c8b8": 168,
    "e3e4": 169,
    "g7g5": 170,
    "d6e5": 171,
    "d4e5": 172,
    "f6h5": 173,
    "d2e4": 174,
    "h5f4": 175,
    "e4d6": 176,
    "e7d6": 177,
    "e5d6": 178,
    "c7d6": 179,
    "d6c7": 180,
    "g5g4": 181,
    "h3g4": 182,
    "f4e2": 183,
    "d8g8": 184,
    "f3e5": 185,
    "g4g3": 186,
    "b3d3": 187,
    "d6e7": 188,
    "f7f6": 189,
    "e5c6": 190,
    "b7c6": 191,
    "b5c6": 192,
    "b8c7": 193,
    "d3d7": 194,
    "e7d7": 195,
    "c6d7": 196,
    "b2f6": 197,
    "f6e5": 198,
    "g4c4": 199,
    "e5f4": 200,
    "d7c6": 201,
    "e3e2": 202,
    "c6d5": 203,
    "e2d2": 204,
    "c4d4": 205,
    "g1f2": 206,
    "e6e5": 207,
    "f4f5": 208,
    "e4f5": 209,
    "e2d3": 210,
    "f5e5": 211,
    "e5d5": 212,
    "d3e2": 213,
    "d5c5": 214,
    "c5c4": 215,
    "c4b4": 216,
    "c2d2": 217,
    "b4a4": 218,
    "d2d3": 219,
    "a4b4": 220,
    "d3d4": 221,
    "a5a4": 222,
    "a4a3": 223,
    "e5f6": 224,
    "a3a2": 225,
    "f6g7": 226,
    "b6b5": 227,
    "g7h7": 228,
    "b4c3": 229,
    "b5b4": 230,
    "f6e4": 231,
    "f4g3": 232,
    "e2h5": 233,
    "h3h4": 234,
    "d6b7": 235,
    "d8g5": 236,
    "g3h4": 237,
    "g5h4": 238,
    "h5f7": 239,
    "f8f7": 240,
    "h4h3": 241,
    "b7d6": 242,
    "f7f8": 243,
    "e6f5": 244,
    "g8g5": 245,
    "d2b4": 246,
    "g5h5": 247,
    "c5c6": 248,
    "f8g8": 249,
    "b4c4": 250,
    "g8g7": 251,
    "d7f6": 252,
    "f1d1": 253,
    "h3h1": 254,
    "e5d4": 255,
    "f8b4": 256,
    "b4e7": 257,
    "d5c6": 258,
    "g5f3": 259,
    "c1d2": 260,
    "f6g4": 261,
    "g4f6": 262,
    "e8e6": 263,
    "e1e6": 264,
    "d7e6": 265,
    "d8e7": 266,
    "e7f6": 267,
    "h6g5": 268,
    "c2c1": 269,
    "d2g5": 270,
    "f6d4": 271,
    "g5e3": 272,
    "d4f6": 273,
    "e3g5": 274,
    "d3h7": 275,
    "d1d4": 276,
    "c1c2": 277,
    "c2d3": 278,
    "g5f6": 279,
    "a8f8": 280,
    "f4e5": 281,
    "d4h4": 282,
    "h7g8": 283,
    "h4h8": 284,
    "g8f7": 285,
    "h8g7": 286,
    "d7d1": 287,
    "g1h2": 288,
    "f6g5": 289,
    "g6f6": 290,
    "f6f4": 291,
    "e4d3": 292,
    "d7d4": 293,
    "f4d2": 294,
    "d3c4": 295,
    "d1e2": 296,
    "c3d5": 297,
    "d5c3": 298,
    "e5h5": 299,
    "c8g4": 300,
    "e2b5": 301,
    "b5b7": 302,
    "a8d8": 303,
    "b7d5": 304,
    "d5h5": 305,
    "g4h5": 306,
    "d2f3": 307,
    "d1d8": 308,
    "h8e8": 309,
    "d4c3": 310,
    "f2g1": 311,
    "e4c3": 312,
    "b2c3": 313,
    "h5f3": 314,
    "g2f3": 315,
    "e8e3": 316,
    "f1c4": 317,
    "e3c3": 318,
    "c4b3": 319,
    "c3f3": 320,
    "g1g2": 321,
    "f3f4": 322,
    "h1d1": 323,
    "d1d3": 324,
    "d3c3": 325,
    "c7b6": 326,
    "g3g2": 327,
    "c3c4": 328,
    "b6c5": 329,
    "b4g4": 330,
    "b3e6": 331,
    "e6b3": 332,
    "c5b5": 333,
    "b3a4": 334,
    "b5c5": 335,
    "a4e8": 336,
    "e5e2": 337,
    "e2c2": 338,
    "e8f7": 339,
    "c2h2": 340,
    "g4g5": 341,
    "c5b4": 342,
    "f3g4": 343,
    "h2g2": 344,
    "g2f2": 345,
    "b4a3": 346,
    "f7g6": 347,
    "f2h2": 348,
    "h4g5": 349,
    "h2b2": 350,
    "g6h7": 351,
    "b2b5": 352,
    "g5h6": 353,
    "b5b6": 354,
    "g4g6": 355,
    "b6b7": 356,
    "g6g5": 357,
    "g5a5": 358,
    "h6g7": 359,
    "b6h6": 360,
    "h7g6": 361,
    "h6h7": 362,
    "g7f8": 363,
    "h7f7": 364,
    "g6f7": 365,
    "a3b4": 366,
    "c2c3": 367,
    "d8b6": 368,
    "d1b3": 369,
    "b3b6": 370,
    "a7b6": 371,
    "f3h4": 372,
    "f5c2": 373,
    "e2d1": 374,
    "c2d1": 375,
    "f6d7": 376,
    "h4f3": 377,
    "d7b6": 378,
    "d1b1": 379,
    "a8a4": 380,
    "a1a4": 381,
    "b6a4": 382,
    "b1b7": 383,
    "a4c3": 384,
    "b7c7": 385,
    "c6e5": 386,
    "e7b4": 387,
    "c7b7": 388,
    "c3a2": 389,
    "d2f1": 390,
    "f8c8": 391,
    "d4f3": 392,
    "g7f6": 393,
    "b7a7": 394,
    "a2b4": 395,
    "c3e5": 396,
    "h4g6": 397,
    "g6e5": 398,
    "a8a1": 399,
    "c4c3": 400,
    "f1g3": 401,
    "g1f1": 402,
    "c3c2": 403,
    "g3e2": 404,
    "f5d3": 405,
    "g1e2": 406,
    "d5c4": 407,
    "e2d4": 408,
    "d4c6": 409,
    "b6c6": 410,
    "c4c6": 411,
    "e7d5": 412,
    "a1c1": 413,
    "e4c5": 414,
    "c1c5": 415,
    "f1c1": 416,
    "h8c8": 417,
    "a8a6": 418,
    "b8b5": 419,
    "c6b5": 420,
    "a6c6": 421,
    "c2c6": 422,
    "d5b6": 423,
    "d2e3": 424,
    "g3g4": 425,
    "h5g4": 426,
    "b6c4": 427,
    "f4g5": 428,
    "c4e5": 429,
    "d3e3": 430,
    "e5g4": 431,
    "e3f4": 432,
    "g4f2": 433,
    "c3f6": 434,
    "f2e4": 435,
    "f6d8": 436,
    "e4d2": 437,
    "d8f6": 438,
    "f4g4": 439,
    "g4f5": 440,
    "f5f4": 441,
    "f4f3": 442,
    "d5e6": 443,
    "f5e6": 444,
    "f5g6": 445,
    "f3e2": 446,
    "g6h5": 447,
    "e2f3": 448,
    "h5g6": 449,
    "1/2-1/2": 450,
    "c8d7": 451,
    "c1g5": 452,
    "d4d2": 453,
    "g5f4": 454,
    "e1c1": 455,
    "a8c8": 456,
    "c1b1": 457,
    "d8a5": 458,
    "d2a5": 459,
    "c6a5": 460,
    "f1b5": 461,
    "a5c6": 462,
    "a7a6": 463,
    "b5a4": 464,
    "b7b5": 465,
    "a4b3": 466,
    "d4b3": 467,
    "a2b3": 468,
    "c8c5": 469,
    "b3b4": 470,
    "e7d8": 471,
    "d5e3": 472,
    "h4f5": 473,
    "e3d5": 474,
    "d1d5": 475,
    "g8d8": 476,
    "b1c2": 477,
    "c6b6": 478,
    "d1a1": 479,
    "a1a2": 480,
    "b8h8": 481,
    "f5h6": 482,
    "h8a8": 483,
    "d5d1": 484,
    "b6e3": 485,
    "h6f5": 486,
    "h2h4": 487,
    "h4h5": 488,
    "e4d5": 489,
    "a2a1": 490,
    "c8c6": 491,
    "f1g2": 492,
    "c6e7": 493,
    "g4h3": 494,
    "f1f2": 495,
    "h3g2": 496,
    "f2g2": 497,
    "f5d4": 498,
    "h5f6": 499,
    "d4e2": 500,
    "g1h1": 501,
    "e2g3": 502,
    "e4g3": 503,
    "f3f2": 504,
    "h6h5": 505,
    "g3e4": 506,
    "f6f3": 507,
    "f8d6": 508,
    "f4d6": 509,
    "e7g6": 510,
    "d6f8": 511,
    "g6h4": 512,
    "c8e6": 513,
    "e2g4": 514,
    "e6g4": 515,
    "d1g4": 516,
    "f1f8": 517,
    "g6f8": 518,
    "g8f8": 519,
    "g4g7": 520,
    "g7d4": 521,
    "f1f6": 522,
    "c6c7": 523,
    "d4d6": 524,
    "c7c8": 525,
    "f6f8": 526,
    "e4f2": 527,
    "c4d5": 528,
    "g5e7": 529,
    "d5d6": 530,
    "e7g7": 531,
    "c3e2": 532,
    "h2g3": 533,
    "h1h4": 534,
    "h8h4": 535,
    "e4f6": 536,
    "f8g6": 537,
    "f1h3": 538,
    "d7e8": 539,
    "e8h5": 540,
    "d8c8": 541,
    "g7g2": 542,
    "e5f3": 543,
    "f8f3": 544,
    "c5b6": 545,
    "e7g5": 546,
    "a8a3": 547,
    "e3d2": 548,
    "f6c3": 549,
    "b1b8": 550,
    "g4e6": 551,
    "g8h8": 552,
    "a2f2": 553,
    "d4f2": 554,
    "b8c8": 555,
    "d3g6": 556,
    "c5h5": 557,
    "c5e7": 558,
    "d5f6": 559,
    "d6f6": 560,
    "d3e4": 561,
    "d8d4": 562,
    "a3a4": 563,
    "d4b4": 564,
    "b4b2": 565,
    "e5e7": 566,
    "c3b2": 567,
    "d7c5": 568,
    "g7h6": 569,
    "b2d4": 570,
    "c5a5": 571,
    "g2f1": 572,
    "c8a8": 573,
    "f5g4": 574,
    "g4d7": 575,
    "c5c3": 576,
    "c5f8": 577,
    "c8f8": 578,
    "c3c7": 579,
    "d7b5": 580,
    "d3b5": 581,
    "g2g4": 582,
    "e3g1": 583,
    "g4h6": 584,
    "g1b6": 585,
    "d6b5": 586,
    "f8a8": 587,
    "h6f7": 588,
    "f1f7": 589,
    "d1f1": 590,
    "f7g8": 591,
    "a4a5": 592,
    "d2f4": 593,
    "f3g1": 594,
    "e4f3": 595,
    "f8f4": 596,
    "b5c4": 597,
    "e2c4": 598,
    "a8e8": 599,
    "d1c1": 600,
    "c1c4": 601,
    "g4f4": 602,
    "b2a3": 603,
    "a3b2": 604,
    "d7f7": 605,
    "b7e7": 606,
    "d6b8": 607,
    "f4f1": 608,
    "f7f1": 609,
    "f2f7": 610,
    "b3d2": 611,
    "b6a6": 612,
    "a6f6": 613,
    "g2b7": 614,
    "c8e8": 615,
    "e5c4": 616,
    "f5c8": 617,
    "c8h3": 618,
    "c4e3": 619,
    "d2d1": 620,
    "f3d1": 621,
    "d4b2": 622,
    "e8b8": 623,
    "e3c4": 624,
    "c4d2": 625,
    "b8d8": 626,
    "b1b5": 627,
    "f8d8": 628,
    "b5d5": 629,
    "d4g7": 630,
    "e1e8": 631,
    "d8e8": 632,
    "d6e8": 633,
    "e8f6": 634,
    "a4b6": 635,
    "b6d5": 636,
    "g4f3": 637,
    "d5f4": 638,
    "g4d1": 639,
    "f4e6": 640,
    "e6f4": 641,
    "c6a4": 642,
    "a4c2": 643,
    "f6h4": 644,
    "h4g3": 645,
    "f4h3": 646,
    "h1g2": 647,
    "g3b8": 648,
    "c2e4": 649,
    "g2g1": 650,
    "c4b2": 651,
    "d3c2": 652,
    "b2c4": 653,
    "c4a3": 654,
    "c3b4": 655,
    "h3g5": 656,
    "f2e3": 657,
    "b2c1": 658,
    "f2f1q": 659,
    "e5e6": 660,
    "e4c6": 661,
    "e6d6": 662,
    "f1f4": 663,
    "f4f8": 664,
    "e3d3": 665,
    "c6b7": 666,
    "c4b5": 667,
    "b4b7": 668,
    "f4b8": 669,
    "b8b2": 670,
    "e4g2": 671,
    "e5f7": 672,
    "a4d7": 673,
    "f7h6": 674,
    "e3h6": 675,
    "f2f8": 676,
    "h6f8": 677,
    "f8f2": 678,
    "f2f5": 679,
    "d5f5": 680,
    "d4b6": 681,
    "b6c7": 682,
    "f3e3": 683,
    "d6f4": 684,
    "d3d2": 685,
    "e2c3": 686,
    "f4c1": 687,
    "e8e1": 688,
    "c1e1": 689,
    "c7f4": 690,
    "e1e4": 691,
    "e4e7": 692,
    "e7e3": 693,
    "e3e7": 694,
    "e7h7": 695,
    "h5h6": 696,
    "h7h8q": 697,
    "h8c3": 698,
    "b3c4": 699,
    "c3d3": 700,
    "c4d3": 701,
    "c4a4": 702,
    "e7c5": 703,
    "h4f6": 704,
    "d5b3": 705,
    "b3c2": 706,
    "b3c3": 707,
    "c8c3": 708,
    "c1c3": 709,
    "b4a2": 710,
    "c3c1": 711,
    "b1c1": 712,
    "a2c1": 713,
    "d4e6": 714,
    "e1d2": 715,
    "d2c1": 716,
    "a6a5": 717,
    "c5d5": 718,
    "f5f6": 719,
    "f6f7": 720,
    "e6f7": 721,
    "a2a1q": 722,
    "a1e1": 723,
    "h4g4": 724,
    "b7b8": 725,
    "b8a8": 726,
    "a8a7": 727,
    "h3h2": 728,
    "a7b8": 729,
    "h2h1q": 730,
    "h1h3": 731,
    "h3f3": 732,
    "g4e4": 733,
    "b8a7": 734,
    "f3d3": 735,
    "e4c4": 736,
    "b6a7": 737,
    "d3b3": 738,
    "c4b6": 739,
    "b6b3": 740,
    "f4e3": 741,
    "c6g2": 742,
    "b8b7": 743,
    "d1d6": 744,
    "d6a6": 745,
    "a1a6": 746,
    "e4d4": 747,
    "d4c4": 748,
    "c5e5": 749,
    "b7a6": 750,
    "a6a7": 751,
    "f6g6": 752,
    "b7b8q": 753,
    "f6f5": 754,
    "h5h8": 755,
    "f5g5": 756,
    "c3b5": 757,
    "f3e1": 758,
    "e4b1": 759,
    "d6c6": 760,
    "d2c3": 761,
    "e1g2": 762,
    "g2e1": 763,
    "e1c2": 764,
    "e3f3": 765,
    "f3g2": 766,
    "c2a3": 767,
    "a3c2": 768,
    "c2e1": 769,
    "c3d2": 770,
    "e1f3": 771,
    "d1f3": 772,
    "e5c3": 773,
    "b3d5": 774,
    "f3g3": 775,
    "d5g5": 776,
    "d8d5": 777,
    "g3f3": 778,
    "f3d5": 779,
    "c1c8": 780,
    "e4e8": 781,
    "f6e7": 782,
    "d5f7": 783,
    "g7f7": 784,
    "e8h8": 785,
    "h7g7": 786,
    "c8g8": 787,
    "f8f6": 788,
    "e6f6": 789,
    "h8b8": 790,
    "b5c7": 791,
    "c7a8": 792,
    "d8a8": 793,
    "h8h5": 794,
    "e2e6": 795,
    "f8e6": 796,
    "e1e5": 797,
    "e6g5": 798,
    "h5g5": 799,
    "a6d6": 800,
    "b7c8": 801,
    "e5e8": 802,
    "f8h8": 803,
    "h8h7": 804,
    "h7h8": 805,
    "d6b4": 806,
    "h7c2": 807,
    "e3e8": 808,
    "g5f7": 809,
    "f7d8": 810,
    "e8e4": 811,
    "f4c7": 812,
    "d8f8": 813,
    "c3b1": 814,
    "g5g6": 815,
    "h1e1": 816,
    "c4e6": 817,
    "e6c4": 818,
    "d8d1": 819,
    "c6g6": 820,
    "e7f7": 821,
    "f7f3": 822,
    "e3b6": 823,
    "h1h2": 824,
    "d1g1": 825,
    "f3f6": 826,
    "g4e3": 827,
    "g3h5": 828,
    "e3g2": 829,
    "g2g7": 830,
    "g7c7": 831,
    "f5f1": 832,
    "f1h1": 833,
    "a5a6": 834,
    "h4h1": 835,
    "b6b8": 836,
    "h1a1": 837,
    "a1a3": 838,
    "a3a7": 839,
    "e7c6": 840,
    "b7d7": 841,
    "e6e1": 842,
    "f7f4": 843,
    "b4c6": 844,
    "g2d5": 845,
    "d5g2": 846,
    "c3c6": 847,
    "g5d5": 848,
    "e1e7": 849,
    "f4h4": 850,
    "d2h2": 851,
    "h4h2": 852,
    "f8f5": 853,
    "f5b5": 854,
    "b5f5": 855,
    "f6e8": 856,
    "e8d6": 857,
    "f5g3": 858,
    "c2a4": 859,
    "f2e1": 860,
    "e1c3": 861,
    "f4d3": 862,
    "f6d6": 863,
    "g5f5": 864,
    "d6d3": 865,
    "d3d5": 866,
    "c2b2": 867,
    "h4c4": 868,
    "c5g5": 869,
    "e1b1": 870,
    "a5a3": 871,
    "b1b3": 872,
    "b3b2": 873,
    "a1g1": 874,
    "g1g3": 875,
    "g3h3": 876,
    "d4e4": 877,
    "h2e2": 878,
    "e4f4": 879,
    "e2e7": 880,
    "e3c5": 881,
    "b6b2": 882,
    "c5d3": 883,
    "d3c1": 884,
    "h1c1": 885,
    "c8c1": 886,
    "b4d2": 887,
    "c4g8": 888,
    "a6b5": 889,
    "a4b5": 890,
    "b2b6": 891,
    "f5h4": 892,
    "f3f5": 893,
    "h4e4": 894,
    "f3f7": 895,
    "g4c8": 896,
    "f7c4": 897,
    "c4c2": 898,
    "e3e1": 899,
    "d2d1q": 900,
    "h1g1": 901,
    "h8h1": 902,
    "g2h1": 903,
    "e6d7": 904,
    "b4b3": 905,
    "h3d7": 906,
    "b8b4": 907,
    "d7d8": 908,
    "b4b8": 909,
    "h4h7": 910,
    "c8d8": 911,
    "g4e2": 912,
    "d7e5": 913,
    "a5e5": 914,
    "c3d1": 915,
    "e4g6": 916,
    "d1c3": 917,
    "g6d3": 918,
    "e3g3": 919,
    "c8a6": 920,
    "a6b7": 921,
    "d3g3": 922,
    "c6e4": 923,
    "g3g5": 924,
    "e4e2": 925,
    "g5g3": 926,
    "f3a8": 927,
    "a8b7": 928,
    "d2d6": 929,
    "b7f3": 930,
    "d6d4": 931,
    "c6c8": 932,
    "c6a6": 933,
    "a6g6": 934,
    "g6g3": 935,
    "e2e1q": 936,
    "a7a8q": 937,
    "h3g3": 938,
    "g3f2": 939,
    "b4c5": 940,
    "b3b5": 941,
    "e5g6": 942,
    "a3a6": 943,
    "c1a3": 944,
    "c3a1": 945,
    "d5b5": 946,
    "h2g1": 947,
    "a2e2": 948,
    "b5b8": 949,
    "c7b8": 950,
    "a6c8": 951,
    "e6a6": 952,
    "c2b1": 953,
    "b1a1": 954,
    "e2b2": 955,
    "b6a5": 956,
    "a5e1": 957,
    "b8e5": 958,
    "e5d7": 959,
    "d7f5": 960,
    "d6h2": 961,
    "f6h6": 962,
    "f1f3": 963,
    "h6h2": 964,
    "g3e5": 965,
    "e5g7": 966,
    "e1e3": 967,
    "g5c1": 968,
    "a5b4": 969,
    "a8a2": 970,
    "a2d2": 971,
    "g8a8": 972,
    "a3a1": 973,
    "g3e3": 974,
    "c1d1": 975,
    "d3d1": 976,
    "d1h1": 977,
    "h1h5": 978,
    "h5e5": 979,
    "d5d7": 980,
    "f4e4": 981,
    "f6e6": 982,
    "c4c7": 983,
    "b2b1q": 984,
    "b1b4": 985,
    "c7c3": 986,
    "d3b4": 987,
    "b4c2": 988,
    "g3f1": 989,
    "f1d2": 990,
    "c2a1": 991,
    "a1c2": 992,
    "c2d4": 993,
    "d4c2": 994,
    "e2f4": 995,
    "f4d5": 996,
    "c1c6": 997,
    "b2e5": 998,
    "e5c7": 999,
    "d5c7": 1000,
    "c7b5": 1001,
    "b5a3": 1002,
    "a3c4": 1003,
    "c5a6": 1004,
    "a6c7": 1005,
    "c5b7": 1006,
    "c7a6": 1007,
    "a6b4": 1008,
    "b4d3": 1009,
    "f3h2": 1010,
    "g2h2": 1011,
    "c5e3": 1012,
    "b6d4": 1013,
    "d4e3": 1014,
    "e8e5": 1015,
    "b1a2": 1016,
    "f7b7": 1017,
    "e5c5": 1018,
    "f8b8": 1019,
    "d7h3": 1020,
    "d2b1": 1021,
    "e2c1": 1022,
    "c3e3": 1023,
    "e3a7": 1024,
    "a7c5": 1025,
    "e6g6": 1026,
    "g6e8": 1027,
    "g8e8": 1028,
    "g8g1": 1029,
    "c7g7": 1030,
    "g2d2": 1031,
    "d2g2": 1032,
    "g7g4": 1033,
    "h2h1": 1034,
    "b7e4": 1035,
    "a1a7": 1036,
    "b5b2": 1037,
    "b2b8": 1038,
    "c3a5": 1039,
    "e1a1": 1040,
    "a1a5": 1041,
    "a5a1": 1042,
    "a7a2": 1043,
    "c4a5": 1044,
    "c7a5": 1045,
    "a5a2": 1046,
    "c5e6": 1047,
    "a2a5": 1048,
    "h3f5": 1049,
    "a4a6": 1050,
    "d2h6": 1051,
    "h6h3": 1052,
    "b8e8": 1053,
    "h3e6": 1054,
    "e6e8": 1055,
    "b1b2": 1056,
    "g4b4": 1057,
    "b4d4": 1058,
    "c2c1q": 1059,
    "f2f1": 1060,
    "c5b3": 1061,
    "g7h8": 1062,
    "h5g3": 1063,
    "h4h6": 1064,
    "b6f6": 1065,
    "g7e5": 1066,
    "g4e5": 1067,
    "g5d2": 1068,
    "h6e3": 1069,
    "d5e5": 1070,
    "c6d8": 1071,
    "d8e6": 1072,
    "e6c5": 1073,
    "a2g2": 1074,
    "c5e4": 1075,
    "a3d6": 1076,
    "e6e7": 1077,
    "c7e6": 1078,
    "d6d7": 1079,
    "g8b8": 1080,
    "b8g8": 1081,
    "d7d8q": 1082,
    "e4h7": 1083,
    "h7e4": 1084,
    "d6a3": 1085,
    "e3c1": 1086,
    "e6g8": 1087,
    "b2e2": 1088,
    "e5a5": 1089,
    "d5b7": 1090,
    "d6f7": 1091,
    "f7e7": 1092,
    "e7e1": 1093,
    "d2e1": 1094,
    "c7e8": 1095,
    "d6c8": 1096,
    "d6d8": 1097,
    "e8c7": 1098,
    "e1d3": 1099,
    "d3b2": 1100,
    "a5b6": 1101,
    "b3a3": 1102,
    "g6g7": 1103,
    "g7g8q": 1104,
    "g8c8": 1105,
    "a3b3": 1106,
    "c8c4": 1107,
    "b3b7": 1108,
    "b3c5": 1109,
    "b7a8": 1110,
    "g8h6": 1111,
    "f1b1": 1112,
    "d7a4": 1113,
    "b8b6": 1114,
    "b6b1": 1115,
    "b8b1": 1116,
    "b2a2": 1117,
    "h3f2": 1118,
    "f2g4": 1119,
    "a4d1": 1120,
    "a2c2": 1121,
    "e7f8": 1122,
    "d4f5": 1123,
    "h4e7": 1124,
    "g5h7": 1125,
    "c2g6": 1126,
    "c5f2": 1127,
    "h5h7": 1128,
    "f4h6": 1129,
    "b5a6": 1130,
    "c6e8": 1131,
    "e4b7": 1132,
    "e8c6": 1133,
    "c6f3": 1134,
    "a2b2": 1135,
    "a6c4": 1136,
    "d7d3": 1137,
    "c3b3": 1138,
    "b3a2": 1139,
    "a2b1": 1140,
    "b3e3": 1141,
    "e3b3": 1142,
    "c7e5": 1143,
    "e5e3": 1144,
    "h5g7": 1145,
    "g7e6": 1146,
    "a4c4": 1147,
    "c4e4": 1148,
    "c2d1q": 1149,
    "a5c3": 1150,
    "f5e3": 1151,
    "f1a1": 1152,
    "e5d3": 1153,
    "d3f4": 1154,
    "d3a6": 1155,
    "d4d1": 1156,
    "e3e5": 1157,
    "h2g4": 1158,
    "e5b8": 1159,
    "g1h3": 1160,
    "d6g3": 1161,
    "b5d3": 1162,
    "f2d3": 1163,
    "a5c4": 1164,
    "g3d3": 1165,
    "d3f3": 1166,
    "g8g3": 1167,
    "g3c3": 1168,
    "c3g3": 1169,
    "h1h7": 1170,
    "h7a7": 1171,
    "a5a8": 1172,
    "a4a2": 1173,
    "a7d4": 1174,
    "h4g2": 1175,
    "f6h8": 1176,
    "b6b4": 1177,
    "d1a4": 1178,
    "b6d8": 1179,
    "a4c6": 1180,
    "b7b2": 1181,
    "a3e7": 1182,
    "h6g4": 1183,
    "g4h2": 1184,
    "b2c2": 1185,
    "c2c7": 1186,
    "c1c7": 1187,
    "b5d7": 1188,
    "f7d7": 1189,
    "a7d7": 1190,
    "e6g7": 1191,
    "g6e4": 1192,
    "e8e2": 1193,
    "e4g4": 1194,
    "h5h3": 1195,
    "e4e1": 1196,
    "h3c3": 1197,
    "b3f3": 1198,
    "c2e3": 1199,
    "g3h1": 1200,
    "h1g3": 1201,
    "g4d4": 1202,
    "d4a4": 1203,
    "a4a7": 1204,
    "a7a3": 1205,
    "a3e3": 1206,
    "a4g4": 1207,
    "b1h1": 1208,
    "f4f6": 1209,
    "b5c3": 1210,
    "g5e4": 1211,
    "e2a2": 1212,
    "d5e7": 1213,
    "f7e5": 1214,
    "c6d6": 1215,
    "h6d6": 1216,
    "b5a5": 1217,
    "d5f3": 1218,
    "e2f1": 1219,
    "a5d5": 1220,
    "d5d2": 1221,
    "d7c7": 1222,
    "h7d3": 1223,
    "d3f1": 1224,
    "c2f5": 1225,
    "g8g2": 1226,
    "f5h5": 1227,
    "c7g3": 1228,
    "c4f7": 1229,
    "g6c6": 1230,
    "c6f6": 1231,
    "a7e7": 1232,
    "h5h1": 1233,
    "a4e4": 1234,
    "h1b1": 1235,
    "e4e6": 1236,
    "a4d4": 1237,
    "f8d7": 1238,
    "e6c6": 1239,
    "d1f2": 1240,
    "a5b3": 1241,
    "a6d3": 1242,
    "f8a3": 1243,
    "b1e1": 1244,
    "c8h8": 1245,
    "h1h8": 1246,
    "c1h1": 1247,
    "d8h8": 1248,
    "c5d7": 1249,
    "g3f5": 1250,
    "f5e7": 1251,
    "b5d4": 1252,
    "e7a7": 1253,
    "a3c5": 1254,
    "f3h3": 1255,
    "f3h5": 1256,
    "e6e4": 1257,
    "f5f2": 1258,
    "e3a3": 1259,
    "f1g1": 1260,
    "h3f4": 1261,
    "f2c2": 1262,
    "e4h4": 1263,
    "c5a4": 1264,
    "e2e8": 1265,
    "d8c6": 1266,
    "d6d2": 1267,
    "f4g6": 1268,
    "d2e2": 1269,
    "e6c8": 1270,
    "g3h2": 1271,
    "d2d8": 1272,
    "g6e7": 1273,
    "e3d1": 1274,
    "c7c4": 1275,
    "f7e8": 1276,
    "d1e3": 1277,
    "c1h6": 1278,
    "g5g7": 1279,
    "b4d6": 1280,
    "g7g3": 1281,
    "c3h8": 1282,
    "f6b6": 1283,
    "b7c5": 1284,
    "c5a3": 1285,
    "g3c7": 1286,
    "d6c4": 1287,
    "c4f1": 1288,
    "f6a1": 1289,
    "g2c6": 1290,
    "f6c6": 1291,
    "e8g6": 1292,
    "h6g6": 1293,
    "b2d2": 1294,
    "g1g6": 1295,
    "g6g1": 1296,
    "f4b4": 1297,
    "b7b4": 1298,
    "g1c1": 1299,
    "a7c7": 1300,
    "e6a2": 1301,
    "a2e6": 1302,
    "e7a3": 1303,
    "b1b6": 1304,
    "e7c8": 1305,
    "c8a7": 1306,
    "a7b5": 1307,
    "c4a2": 1308,
    "a3b1": 1309,
    "g3e1": 1310,
    "g6g8": 1311,
    "d7b7": 1312,
    "f7g7": 1313,
    "a2c4": 1314,
    "b4a5": 1315,
    "d2f2": 1316,
    "c2b4": 1317,
    "c7c2": 1318,
    "c2a2": 1319,
    "a2a8": 1320,
    "c3a3": 1321,
    "a3a5": 1322,
    "a5d2": 1323,
    "f2d2": 1324,
    "f1a6": 1325,
    "e2a6": 1326,
    "b8a6": 1327,
    "f2d1": 1328,
    "h2a2": 1329,
    "a8c7": 1330,
    "h1e4": 1331,
    "d6e4": 1332,
    "e3h3": 1333,
    "f4c4": 1334,
    "b2f2": 1335,
    "b4b1": 1336,
    "c6b8": 1337,
    "c8c2": 1338,
    "g1g7": 1339,
    "g7e7": 1340,
    "d3c5": 1341,
    "c4c8": 1342,
    "e6c7": 1343,
    "c7d5": 1344,
    "d3f2": 1345,
    "f2h3": 1346,
    "d5b4": 1347,
    "b1a3": 1348,
    "f4g2": 1349,
    "g2f4": 1350,
    "e5g3": 1351,
    "h8d8": 1352,
    "e3c2": 1353,
    "g6h6": 1354,
    "d7g7": 1355,
    "h7d7": 1356,
    "f7a7": 1357,
    "g2b2": 1358,
    "e4c2": 1359,
    "c7a7": 1360,
    "a7f2": 1361,
    "b1e4": 1362,
    "e7b7": 1363,
    "f2h4": 1364,
    "h6g8": 1365,
    "b3c1": 1366,
    "c1d3": 1367,
    "c6e6": 1368,
    "c2c8": 1369,
    "b4d5": 1370,
    "a4h4": 1371,
    "g6g2": 1372,
    "d6b6": 1373,
    "b6d6": 1374,
    "c7e7": 1375,
    "g3d6": 1376,
    "h4f4": 1377,
    "f3c6": 1378,
    "a6e2": 1379,
    "f5d6": 1380,
    "h7h1": 1381,
    "g1g5": 1382,
    "b7b3": 1383,
    "b8b3": 1384,
    "c7c1": 1385,
    "a3d3": 1386,
    "d3d8": 1387,
    "g6c2": 1388,
    "e1h1": 1389,
    "g6e6": 1390,
    "g2g5": 1391,
    "g1g4": 1392,
    "g2g6": 1393,
    "c5g1": 1394,
    "e5e1": 1395,
    "c4a6": 1396,
    "h5h2": 1397,
    "h2c2": 1398,
    "c2g2": 1399,
    "c6c1": 1400,
    "c3g7": 1401,
    "a6b6": 1402,
    "b6f2": 1403,
    "g7g8": 1404,
    "f2h1": 1405,
    "a1h1": 1406,
    "h1h6": 1407,
    "h6e6": 1408,
    "e4a4": 1409,
    "c3c8": 1410,
    "d5d8": 1411,
    "a3c1": 1412,
    "c7c8q": 1413,
    "c4c1": 1414,
    "a2d5": 1415,
    "f6a6": 1416,
    "h2f2": 1417,
    "e7c7": 1418,
    "f6g8": 1419,
    "h3h8": 1420,
    "h8f6": 1421,
    "c7d8": 1422,
    "f6h7": 1423,
    "g3g6": 1424,
    "e5h2": 1425,
    "g4g2": 1426,
    "f8h6": 1427,
    "d3e5": 1428,
    "f4d4": 1429,
    "e2g2": 1430,
    "c4e2": 1431,
    "f7h5": 1432,
    "f1h2": 1433,
    "g5g1": 1434,
    "f1e3": 1435,
    "e7e2": 1436,
    "a6f1": 1437,
    "a1b2": 1438,
    "a4f4": 1439,
    "g8g6": 1440,
    "c4h4": 1441,
    "c6a7": 1442,
    "c5c1": 1443,
    "b5f1": 1444,
    "a4a1": 1445,
    "a3g3": 1446,
    "a2a7": 1447,
    "a7a4": 1448,
    "a6a3": 1449,
    "a3f8": 1450,
    "c3e1": 1451,
    "h6h4": 1452,
    "d1h5": 1453,
    "f7g5": 1454,
    "b2a4": 1455,
    "h7b7": 1456,
    "b2g2": 1457,
    "a5d8": 1458,
    "h8h6": 1459,
    "g6g4": 1460,
    "b4e1": 1461,
    "g6f4": 1462,
    "h5e2": 1463,
    "d2d5": 1464,
    "a6b8": 1465,
    "h4e1": 1466,
    "b4b6": 1467,
    "b1d1": 1468,
    "h6d2": 1469,
    "d4g1": 1470,
    "h3b3": 1471,
    "b3h3": 1472,
    "d8d3": 1473,
    "a5b5": 1474,
    "a3f3": 1475,
    "f3f8": 1476,
    "e8a8": 1477,
    "g7f8r": 1478,
    "d4f4": 1479,
    "f5g7": 1480,
    "f5b1": 1481,
    "h2e5": 1482,
    "g2g8": 1483,
    "g1g8": 1484,
    "c3h3": 1485,
    "h3h6": 1486,
    "h6f6": 1487,
    "b6c8": 1488,
    "c8e7": 1489,
    "e7g8": 1490,
    "a1c3": 1491,
    "g7f5": 1492,
    "e4b4": 1493,
    "b4e4": 1494,
    "a1a8": 1495,
    "g2a8": 1496,
    "b1d3": 1497,
    "e3g4": 1498,
    "h2f1": 1499,
    "f2b6": 1500,
    "g7b7": 1501,
    "g7h5": 1502,
    "b7f7": 1503,
    "a2f7": 1504,
    "h3c8": 1505,
    "e1g3": 1506,
    "h7h2": 1507,
    "h8h2": 1508,
    "c6c4": 1509,
    "a3b5": 1510,
    "f4h5": 1511,
    "e2e5": 1512,
    "f7f8q": 1513,
    "e7e8q": 1514,
    "d8f7": 1515,
    "h5f5": 1516,
    "f5f3": 1517,
    "h2f3": 1518,
    "e2h2": 1519,
    "h3g1": 1520,
    "g2e2": 1521,
    "c7h7": 1522,
    "h2h7": 1523,
    "d2d7": 1524,
    "d7a7": 1525,
    "a6a8": 1526,
    "a8h8": 1527,
    "e6f8": 1528,
    "c3c5": 1529,
    "c8d6": 1530,
    "b8f8": 1531,
    "g1e1": 1532,
    "f7h8": 1533,
    "h8f7": 1534,
    "d5a5": 1535,
    "c5c7": 1536,
    "d3b1": 1537,
    "f2f6": 1538,
    "a2c3": 1539,
    "b2a1": 1540,
    "d7d2": 1541,
    "h7f5": 1542,
    "d3e1": 1543,
    "g7b2": 1544,
    "d3d6": 1545,
    "c7f7": 1546,
    "a7f7": 1547,
    "f7d6": 1548,
    "f2b2": 1549,
    "e4a8": 1550,
    "b4f8": 1551,
    "g7a1": 1552,
    "b5g5": 1553,
    "g5e5": 1554,
    "f3c3": 1555,
    "g3b3": 1556,
    "e3f5": 1557,
    "e6e2": 1558,
    "a5g5": 1559,
    "d6g6": 1560,
    "g6d6": 1561,
    "h7f6": 1562,
    "c1f1": 1563,
    "b5h5": 1564,
    "f4a4": 1565,
    "e6h3": 1566,
    "a7g7": 1567,
    "b3b8": 1568,
    "h8b2": 1569,
    "c2f2": 1570,
    "g4g1": 1571,
    "h5d1": 1572,
    "a5c7": 1573,
    "d2a2": 1574,
    "d3a3": 1575,
    "f7d5": 1576,
    "d5g8": 1577,
    "e5g5": 1578,
    "f7b3": 1579,
    "a7h7": 1580,
    "h6h8": 1581,
    "g6a6": 1582,
    "a1g7": 1583,
    "f5d7": 1584,
    "e5a1": 1585,
    "b3f7": 1586,
    "f5h7": 1587,
    "g8e6": 1588,
    "f2c5": 1589,
    "g5d8": 1590,
    "b6d7": 1591,
    "f5f7": 1592,
    "g5b5": 1593,
    "a1f6": 1594,
    "b2g7": 1595,
    "e4h1": 1596,
    "d7b8": 1597,
    "g5g2": 1598,
    "e3f1": 1599,
    "e5f5": 1600,
    "d5d3": 1601,
    "f3b7": 1602,
    "c1g1": 1603,
    "g1d1": 1604,
    "c4f4": 1605,
    "a7c6": 1606,
    "c1a1": 1607,
    "b7g7": 1608,
    "d4d8": 1609,
    "c2c5": 1610,
    "c5c2": 1611,
    "a3a8": 1612,
    "h6f4": 1613,
    "f4f7": 1614,
    "a5a7": 1615,
    "e8b5": 1616,
    "d4d7": 1617,
    "g7d7": 1618,
    "f8f1": 1619,
    "e8g7": 1620,
    "h7f8": 1621,
    "h6c1": 1622,
    "b3a1": 1623,
    "e7e4": 1624,
    "d6h6": 1625,
    "f1f5": 1626,
    "b5a7": 1627,
    "h3h5": 1628,
    "b8f4": 1629,
    "h3a3": 1630,
    "b2h2": 1631,
    "h4b4": 1632,
    "f5c5": 1633,
    "b5e2": 1634,
    "b7b1": 1635,
    "h6a6": 1636,
    "h8h3": 1637,
    "h7h3": 1638,
    "g2c2": 1639,
    "f4f2": 1640,
    "a6a4": 1641,
    "a7b7": 1642,
    "b8h2": 1643,
    "a4a8": 1644,
    "g7g1": 1645,
    "d4a1": 1646,
    "a1d4": 1647,
    "b1f5": 1648,
    "g3a3": 1649,
    "e5b2": 1650,
    "a4b2": 1651,
    "b2d3": 1652,
    "a1e5": 1653,
    "b7d8": 1654,
    "b3g3": 1655,
    "h6c6": 1656,
    "a1b3": 1657,
    "c6h6": 1658,
    "h1f3": 1659,
    "a8b6": 1660,
    "b6a8": 1661,
    "g2g1q": 1662,
    "b7h1": 1663,
    "g7h8q": 1664,
    "h1a8": 1665,
    "f6f2": 1666,
    "b5e5": 1667,
    "b7a5": 1668,
    "a2h2": 1669,
    "f6b2": 1670,
    "e6e3": 1671,
    "e6h6": 1672,
    "g7e8": 1673,
    "a3c3": 1674,
    "e5h8": 1675,
    "f3f1": 1676,
    "h1d5": 1677,
    "c5a7": 1678,
    "e6b6": 1679,
    "d5a8": 1680,
    "f5f8": 1681,
    "c5f5": 1682,
    "g5g8": 1683,
    "a8d5": 1684,
    "e5b5": 1685,
    "d5a2": 1686,
    "b5b3": 1687,
    "d4g4": 1688,
    "g2e3": 1689,
    "g2h4": 1690,
    "f5a5": 1691,
    "f7h7": 1692,
    "h5e8": 1693,
    "c1a2": 1694,
    "c6a8": 1695,
    "f7f2": 1696,
    "d5h1": 1697,
    "g1a1": 1698,
    "g4a4": 1699,
    "a7e3": 1700,
    "b4h4": 1701,
    "e2g1": 1702,
    "e6d8": 1703,
    "b5e8": 1704,
    "c1e2": 1705,
    "f3h1": 1706,
    "h1c6": 1707,
    "f5d5": 1708,
    "a5f5": 1709,
    "b1g1": 1710,
    "g1b1": 1711,
    "d3h3": 1712,
    "h3d3": 1713,
    "h2f4": 1714,
    "g2a2": 1715,
    "c8b6": 1716,
    "f2a2": 1717,
    "b6e6": 1718,
    "h5c5": 1719,
    "a7a1": 1720,
    "h8g6": 1721,
    "a8e4": 1722,
    "b1g6": 1723,
    "g3g7": 1724,
    "f7c7": 1725,
    "a7c8": 1726,
    "c2h7": 1727,
    "h2d6": 1728,
    "g7a7": 1729,
    "g4g8": 1730,
    "b6g6": 1731,
    "f3a3": 1732,
    "h1b7": 1733,
    "g7g8n": 1734,
    "c6c2": 1735,
    "b4f4": 1736,
    "c6c3": 1737,
    "f7a2": 1738,
    "a6a1": 1739,
    "c1b3": 1740,
    "b3a5": 1741,
    "e8a4": 1742,
    "d4h8": 1743,
    "e3e6": 1744,
    "d8b7": 1745,
    "e7d8q": 1746,
    "h7e7": 1747,
    "a8g2": 1748,
    "a5b7": 1749,
    "h7c7": 1750,
    "h8d4": 1751,
    "a6h6": 1752,
    "b2h8": 1753,
    "h2h8": 1754,
    "d7c8q": 1755,
    "f2g1q": 1756,
    "b6g1": 1757,
    "d6d1": 1758,
    "b2b7": 1759,
    "h2c7": 1760,
    "h5d5": 1761,
    "g1c5": 1762,
    "a2a6": 1763,
    "f6f1": 1764,
    "a6e6": 1765,
    "g8b3": 1766,
    "g8c4": 1767,
    "a8c6": 1768,
    "a8f3": 1769,
    "a6a2": 1770,
    "g5c5": 1771,
    "h3h7": 1772,
    "g3g8": 1773,
    "h5b5": 1774,
    "c7c8n": 1775,
    "b7h7": 1776,
    "e1b4": 1777,
    "g1e3": 1778,
    "a3h3": 1779,
    "h3e3": 1780,
    "f3b3": 1781,
    "b3b1": 1782,
    "h4d4": 1783,
    "g3g1": 1784,
    "a8h1": 1785,
    "d7h7": 1786,
    "c7h2": 1787,
    "e7f8q": 1788,
    "a5h5": 1789,
    "h5a5": 1790,
    "b5b1": 1791,
    "b3g8": 1792,
    "d2c1q": 1793,
    "g6h8": 1794,
    "f2a7": 1795,
    "c4g4": 1796,
    "h2d2": 1797,
    "h6h1": 1798,
    "c6h1": 1799,
    "h2h6": 1800,
    "h1f2": 1801,
    "g6b6": 1802,
    "c7d8q": 1803,
    "h4a4": 1804,
    "a2b1q": 1805,
    "h2h5": 1806,
    "d1b2": 1807,
    "h8e5": 1808,
    "h7h4": 1809,
    "b8g3": 1810,
    "h2h1r": 1811,
    "a2g8": 1812,
    "e1a5": 1813,
    "c7d8r": 1814,
    "h8a1": 1815,
    "b7c8q": 1816,
    "a7a8r": 1817,
    "b2d1": 1818,
    "e2f1q": 1819,
    "g8d5": 1820,
    "g7f8q": 1821,
    "f2f1b": 1822,
    "b2b1b": 1823,
    "a2a1b": 1824,
    "f7e8q": 1825,
    "h6b6": 1826,
    "g1a7": 1827,
    "b1h7": 1828,
    "f2e1q": 1829,
    "d2e1q": 1830,
    "h7b1": 1831,
    "g6b1": 1832,
    "a7b8q": 1833,
    "b2a1q": 1834,
    "c2b1q": 1835,
    "e2d1q": 1836,
    "a7a8n": 1837,
    "h2g1q": 1838,
    "d7e8q": 1839,
    "a2a1r": 1840,
    "f2f1r": 1841,
    "g8a2": 1842,
    "h7g8q": 1843,
    "a7g1": 1844,
    "g2h1q": 1845,
    "a1h8": 1846,
    "b7a8q": 1847,
    "g1d4": 1848,
    "b2c1q": 1849,
    "g2f1q": 1850,
    "b7b8r": 1851,
    "f7g8q": 1852,
    "*": 1853,
    "c7c8b": 1854,
    "d7d8n": 1855,
    "c7b8q": 1856,
    "e2f1n": 1857,
    "e7e8n": 1858,
    "a2a1n": 1859,
    "h7h8n": 1860,
    "h7h8r": 1861,
    "c2c1n": 1862,
    "b7b8n": 1863,
    "g2g1n": 1864,
    "c2c1r": 1865,
    "d2d1r": 1866,
    "f7f8n": 1867,
    "b2a1n": 1868,
    "f7f8r": 1869,
    "d7e8r": 1870,
    "d2d1n": 1871,
    "c7c8r": 1872,
    "g2g1b": 1873,
    "e2e1n": 1874,
    "e2d1r": 1875,
    "h7g8n": 1876,
    "b2b1r": 1877,
    "g2g1r": 1878,
    "g7g8r": 1879,
    "d7e8n": 1880,
    "a7b8r": 1881,
    "h2h1b": 1882,
    "a7a8b": 1883,
    "e2e1r": 1884,
    "e7e8r": 1885,
    "b7c8b": 1886,
    "f2f1n": 1887,
    "g7f8n": 1888,
    "b2b1n": 1889,
    "h2h1n": 1890,
    "c2d1n": 1891,
    "d2e1r": 1892,
    "d2d1b": 1893,
    "h7h8b": 1894,
    "f7e8n": 1895,
    "d7d8r": 1896,
    "e7f8n": 1897,
    "e2d1n": 1898,
    "b2a1r": 1899,
    "f2e1r": 1900,
    "e2f1r": 1901,
    "g2f1n": 1902,
    "e2e1b": 1903,
    "f7f8b": 1904,
    "c2c1b": 1905,
    "c7b8b": 1906,
    "g7g8b": 1907,
    "f7e8r": 1908,
    "g2f1r": 1909,
    "a2b1b": 1910,
    "b7b8b": 1911,
    "e7e8b": 1912,
    "g7h8b": 1913,
    "e2f1b": 1914,
    "d2c1r": 1915,
    "d2c1n": 1916,
    "a2b1r": 1917,
    "e7d8r": 1918,
    "c2d1r": 1919,
    "c7d8n": 1920,
    "c2b1n": 1921,
    "f7g8r": 1922,
    "d7d8b": 1923,
    "e7f8r": 1924,
    "e7d8n": 1925,
    "f2g1n": 1926,
    "d7c8n": 1927,
    "[UNK]": 1928,
    "[PAD]": 1929
}