{
    "<|startofgame|>": 0,
    "d4": 1,
    "Nf6": 2,
    "c4": 3,
    "d6": 4,
    "Nc3": 5,
    "g6": 6,
    "e4": 7,
    "Bg7": 8,
    "f4": 9,
    "O-O": 10,
    "Nf3": 11,
    "c5": 12,
    "d5": 13,
    "e6": 14,
    "Be2": 15,
    "exd5": 16,
    "cxd5": 17,
    "Re8": 18,
    "e5": 19,
    "dxe5": 20,
    "fxe5": 21,
    "Ng4": 22,
    "fxe6": 23,
    "Nc6": 24,
    "Nd4": 25,
    "Ng5": 26,
    "Nge4": 27,
    "Nxe4": 28,
    "b6": 29,
    "Bg5": 30,
    "Qd7": 31,
    "a4": 32,
    "Qxd6": 33,
    "Nxd6": 34,
    "<|endofgame|>": 35,
    "exd4": 36,
    "Qxd4": 37,
    "Bb5": 38,
    "Bxc6+": 39,
    "bxc6": 40,
    "Be7": 41,
    "Qc4": 42,
    "Qxc6": 43,
    "a5": 44,
    "Ba6": 45,
    "Qb3": 46,
    "Ne4": 47,
    "Bc4": 48,
    "Qe3": 49,
    "dxe4": 50,
    "Qxe4": 51,
    "Bb4+": 52,
    "c3": 53,
    "Bd3": 54,
    "Bd2": 55,
    "Rd1": 56,
    "Bc1": 57,
    "Bd6": 58,
    "f6": 59,
    "f5": 60,
    "Rxd3": 61,
    "cxd3": 62,
    "Qxd3": 63,
    "Bc5": 64,
    "Rxe6": 65,
    "Qxf5": 66,
    "Bxd4+": 67,
    "cxd4": 68,
    "Qxd4+": 69,
    "Kh1": 70,
    "Qe4": 71,
    "Qb5": 72,
    "Rc8": 73,
    "Qe2": 74,
    "Bc3": 75,
    "Qxb5": 76,
    "Bf5": 77,
    "Nge2": 78,
    "h6": 79,
    "Bxf6": 80,
    "exf6": 81,
    "Ng3": 82,
    "Bg6": 83,
    "Ncxe4": 84,
    "h4": 85,
    "Nd2": 86,
    "h5": 87,
    "Bh7": 88,
    "Qf3": 89,
    "Rad1": 90,
    "Rfe1": 91,
    "Bxd2": 92,
    "Rxe8+": 93,
    "Rxe8": 94,
    "Rxd2": 95,
    "Qe6": 96,
    "Re2": 97,
    "Kg7": 98,
    "Qf4": 99,
    "Rxe2": 100,
    "Nxe2": 101,
    "g5": 102,
    "a6": 103,
    "b5": 104,
    "Bb3": 105,
    "Bc2": 106,
    "Ne7": 107,
    "a3": 108,
    "Qe1+": 109,
    "Kh2": 110,
    "Qd2": 111,
    "Bxf5": 112,
    "Nxf5": 113,
    "Nxf5+": 114,
    "Qxb2": 115,
    "Qe5+": 116,
    "Kf8": 117,
    "Qxc7": 118,
    "Qxa3": 119,
    "Qa4": 120,
    "d7": 121,
    "d8=Q+": 122,
    "Qd4+": 123,
    "Kf6": 124,
    "Qe5#": 125,
    "Nxd4": 126,
    "Be3": 127,
    "Bg4": 128,
    "f3": 129,
    "Bh5": 130,
    "O-O-O": 131,
    "Qc7": 132,
    "g4": 133,
    "Bh3": 134,
    "hxg5": 135,
    "Nd7": 136,
    "Bxe6": 137,
    "Rxh1": 138,
    "Nxe6": 139,
    "Qb8": 140,
    "Rh8": 141,
    "Bf7": 142,
    "Qd5": 143,
    "Nd8": 144,
    "Nxg7+": 145,
    "Ke7": 146,
    "Nf5+": 147,
    "Ke8": 148,
    "Qd4": 149,
    "Ne6": 150,
    "Ne5": 151,
    "Nxd6+": 152,
    "Nxf7": 153,
    "Kxf7": 154,
    "Qh2": 155,
    "Ng7": 156,
    "Nd5": 157,
    "Ng6": 158,
    "Qh3": 159,
    "Rxb8": 160,
    "c6": 161,
    "Qxd2+": 162,
    "h3": 163,
    "Nh6": 164,
    "Nf7": 165,
    "Be6": 166,
    "Rhe1": 167,
    "Na6": 168,
    "Nc5": 169,
    "Bf1": 170,
    "Rad8": 171,
    "Bh8": 172,
    "Rxd1+": 173,
    "Rxd1": 174,
    "fxe4": 175,
    "Re1": 176,
    "Nd6": 177,
    "Bg2": 178,
    "Nc4": 179,
    "Nxc4": 180,
    "bxc4": 181,
    "Bd4": 182,
    "Bxd4": 183,
    "Rd8": 184,
    "Bxe4": 185,
    "Rxd4": 186,
    "gxf5": 187,
    "Re7": 188,
    "Rxf4": 189,
    "Rg7+": 190,
    "Kh8": 191,
    "Ra7": 192,
    "Kg8": 193,
    "Rc7": 194,
    "Rxc6": 195,
    "Rg4": 196,
    "Rc8+": 197,
    "Kf7": 198,
    "Rc7+": 199,
    "Kg6": 200,
    "Kh5": 201,
    "Rxh7": 202,
    "Kxg5": 203,
    "Kxh6": 204,
    "Rxg4": 205,
    "fxg4": 206,
    "Kd2": 207,
    "Kg5": 208,
    "Ke3": 209,
    "Kf5": 210,
    "Kf2": 211,
    "Kf4": 212,
    "Kg3": 213,
    "b3": 214,
    "cxb3": 215,
    "b2": 216,
    "Ke1": 217,
    "b1=Q+": 218,
    "Ke2": 219,
    "Qxa4": 220,
    "Kc1": 221,
    "a2": 222,
    "Ke4": 223,
    "Qb2+": 224,
    "a1=Q#": 225,
    "g3": 226,
    "Bxc6": 227,
    "dxc6": 228,
    "Rf2": 229,
    "Nxf2": 230,
    "Nxd1": 231,
    "Nxc6": 232,
    "e3": 233,
    "Bb6": 234,
    "Nxc3": 235,
    "bxc3": 236,
    "Ba3": 237,
    "Kd7": 238,
    "Rhe8": 239,
    "Nb5": 240,
    "Kc6": 241,
    "dxc4": 242,
    "Re6": 243,
    "Rae8": 244,
    "Rb1": 245,
    "Bc7": 246,
    "Na7+": 247,
    "Bxb1": 248,
    "Nxe5": 249,
    "N5b6": 250,
    "Bf4": 251,
    "Bxe5": 252,
    "Qxd1+": 253,
    "Bc8": 254,
    "Rxd8": 255,
    "Bxd1": 256,
    "Bf3": 257,
    "Be4": 258,
    "Bh6": 259,
    "Nc7+": 260,
    "Nxb6+": 261,
    "Na4": 262,
    "Kf3": 263,
    "Ba1": 264,
    "Kd3": 265,
    "Kd6": 266,
    "Nb6": 267,
    "Kc7": 268,
    "Nc8+": 269,
    "Na7": 270,
    "Nb5+": 271,
    "Bf6": 272,
    "Be5": 273,
    "Kb7": 274,
    "Bxc3": 275,
    "Kxc3": 276,
    "b4": 277,
    "axb4+": 278,
    "axb4": 279,
    "cxb4+": 280,
    "Kxb4": 281,
    "c5+": 282,
    "Kd5": 283,
    "Kb5": 284,
    "Kb6": 285,
    "c7": 286,
    "e2": 287,
    "c8=Q": 288,
    "e1=Q": 289,
    "Qd8+": 290,
    "Ke5": 291,
    "Qe8+": 292,
    "dxc5": 293,
    "Bxc5": 294,
    "Bb2": 295,
    "Rc1": 296,
    "Nd1": 297,
    "Bb7": 298,
    "Nxd5": 299,
    "Rxc1": 300,
    "Bxb2": 301,
    "Nb4": 302,
    "Ne3": 303,
    "Rxe1+": 304,
    "Kg2": 305,
    "Nd3": 306,
    "Nb3": 307,
    "Na5": 308,
    "Nxb3+": 309,
    "axb3": 310,
    "Ne2": 311,
    "Nf5": 312,
    "Qxg7#": 313,
    "d3": 314,
    "Nbd2": 315,
    "Qe1": 316,
    "Qf2": 317,
    "exf5": 318,
    "Rac1": 319,
    "Nh4": 320,
    "Ncb4": 321,
    "Bxb4": 322,
    "Nxb4": 323,
    "Rc4": 324,
    "Rec1": 325,
    "Rxc4": 326,
    "Nxe7": 327,
    "Qxe7": 328,
    "Bxg2": 329,
    "Bxh3": 330,
    "Qb7": 331,
    "exd6": 332,
    "Bxd6": 333,
    "Nbd7": 334,
    "Qa5+": 335,
    "Qxe5": 336,
    "Nxf6+": 337,
    "gxf6": 338,
    "Qf4+": 339,
    "Kb1": 340,
    "Qxc4": 341,
    "Bxg6": 342,
    "Qxe2": 343,
    "Qc2": 344,
    "Bxc4": 345,
    "Bxe2": 346,
    "Bf2": 347,
    "Qa2": 348,
    "Nxd2": 349,
    "Rdxd2": 350,
    "Nxe2+": 351,
    "axb6": 352,
    "Qxb6": 353,
    "Rab1": 354,
    "Nxd3": 355,
    "Bc6": 356,
    "Rfc1": 357,
    "Qe5": 358,
    "Rc5": 359,
    "Rbc1": 360,
    "Rxc5": 361,
    "Rg8": 362,
    "Rc3": 363,
    "Nfd7": 364,
    "Kh7": 365,
    "Ne1": 366,
    "Ndc5": 367,
    "Nxc5": 368,
    "Nf2": 369,
    "Qh4": 370,
    "Qf6": 371,
    "Qg6": 372,
    "Ng5+": 373,
    "Bxg6+": 374,
    "Kxg6": 375,
    "Rh8+": 376,
    "Bd7": 377,
    "Qe4+": 378,
    "Kh6": 379,
    "Rh1#": 380,
    "Kxd1": 381,
    "Nxf2+": 382,
    "Kxf2": 383,
    "O-O+": 384,
    "Kg1": 385,
    "Nxe1": 386,
    "Bc5+": 387,
    "Bb4": 388,
    "Bxc7": 389,
    "Bb8": 390,
    "Bd5": 391,
    "Ba7": 392,
    "Ke6": 393,
    "Re4": 394,
    "Ra4": 395,
    "Rxb7": 396,
    "Ra1": 397,
    "Rxa5": 398,
    "Rb6": 399,
    "Ra2": 400,
    "Ra6": 401,
    "Ra7+": 402,
    "Nge7": 403,
    "Qc8": 404,
    "Nh2": 405,
    "Qd8": 406,
    "Bxe3": 407,
    "Qxe3": 408,
    "Nf4": 409,
    "Qg5": 410,
    "Qg3": 411,
    "Nh5": 412,
    "Qf7": 413,
    "Qe7": 414,
    "Bxg4": 415,
    "hxg4": 416,
    "Nxf4": 417,
    "Raf8": 418,
    "Rd2": 419,
    "Rff4": 420,
    "Rd3": 421,
    "Rh4": 422,
    "Rfg4": 423,
    "Qh6": 424,
    "Kf1": 425,
    "Qh5": 426,
    "Rxe4+": 427,
    "Rd4+": 428,
    "Kc2": 429,
    "Qg6+": 430,
    "Kb2": 431,
    "Rxd2+": 432,
    "Qxd2": 433,
    "Rg3": 434,
    "Qxg5": 435,
    "Rxg5": 436,
    "Rg6": 437,
    "Ka3": 438,
    "Rf6": 439,
    "Kb4": 440,
    "Kd4": 441,
    "d2": 442,
    "Rc4+": 443,
    "Rc3+": 444,
    "d1=Q": 445,
    "Qc1+": 446,
    "Qd2+": 447,
    "Qd3": 448,
    "Rxe3+": 449,
    "Ka4": 450,
    "Qxb3+": 451,
    "Ka5": 452,
    "Bxf8": 453,
    "Kxf8": 454,
    "Rb8": 455,
    "Qb2": 456,
    "Qb4+": 457,
    "Nxa5": 458,
    "bxa5": 459,
    "Bxd5+": 460,
    "Bxa4": 461,
    "Rd7": 462,
    "Rb5": 463,
    "Rf7+": 464,
    "Rxg7": 465,
    "Ra5": 466,
    "Bd7+": 467,
    "Kd8": 468,
    "Bxa2": 469,
    "Rxa2": 470,
    "Rg8+": 471,
    "Rf7": 472,
    "Rxf6+": 473,
    "Rf5": 474,
    "Rf8": 475,
    "Rb8+": 476,
    "Kc4": 477,
    "Rb4+": 478,
    "Kxc4": 479,
    "Kh3": 480,
    "a1=Q": 481,
    "Rhd1": 482,
    "axb5": 483,
    "cxb5": 484,
    "Bxb5": 485,
    "Rfb8": 486,
    "Nb4+": 487,
    "Kc3": 488,
    "Kxd3": 489,
    "Rd8+": 490,
    "Nh3": 491,
    "Bd2+": 492,
    "Rd2+": 493,
    "Rxh2": 494,
    "Ng1": 495,
    "Rh1": 496,
    "Rxb1": 497,
    "Kxb1": 498,
    "Ka2": 499,
    "Nb1": 500,
    "Ng2": 501,
    "gxh5": 502,
    "Nxh4": 503,
    "Bxh4": 504,
    "Bxf7": 505,
    "Nxc8": 506,
    "Ba4": 507,
    "Ba5+": 508,
    "Bxb4+": 509,
    "Qg2": 510,
    "fxe3": 511,
    "Qxe3+": 512,
    "Bg4+": 513,
    "Qxe2#": 514,
    "Bxe7": 515,
    "Ngxe5": 516,
    "Rae1": 517,
    "Rxe4": 518,
    "Qe6+": 519,
    "Qxe6": 520,
    "Kxe8": 521,
    "Nxc7+": 522,
    "h4+": 523,
    "Kxh4": 524,
    "Ng2+": 525,
    "g7": 526,
    "Nh5+": 527,
    "Nxg7": 528,
    "Kg4": 529,
    "f5+": 530,
    "Ne6+": 531,
    "f2": 532,
    "Nd3+": 533,
    "Kxd4": 534,
    "Kxb6": 535,
    "Ka6": 536,
    "Kc8": 537,
    "Kxa4": 538,
    "Bxf1": 539,
    "Qxf1": 540,
    "Kxf5": 541,
    "Rab8": 542,
    "Rxb2": 543,
    "Bh3+": 544,
    "Qg4": 545,
    "Bxg4+": 546,
    "Qd7+": 547,
    "Qd6+": 548,
    "Nb7": 549,
    "Qxa7": 550,
    "Ra8": 551,
    "Rfa8": 552,
    "R8a7": 553,
    "Rc6": 554,
    "Qa8": 555,
    "Bxb6": 556,
    "cxb6": 557,
    "Rxd6": 558,
    "Rxa4": 559,
    "Qxd8": 560,
    "Bf8": 561,
    "Qd6": 562,
    "gxf4": 563,
    "exf4": 564,
    "Qc3": 565,
    "Qxd5": 566,
    "Qa2+": 567,
    "dxc3": 568,
    "Bb5+": 569,
    "Nxb5": 570,
    "Qb6": 571,
    "Qxb3": 572,
    "Bxc8": 573,
    "Nxb2": 574,
    "Rxa6": 575,
    "Bd3+": 576,
    "Bxd7": 577,
    "Rxa8": 578,
    "Kxh1": 579,
    "Be8": 580,
    "Kc5": 581,
    "Nc2": 582,
    "exd4+": 583,
    "Bg8": 584,
    "Bxc2": 585,
    "Nf8": 586,
    "Ng8": 587,
    "Nxh6": 588,
    "Kb3": 589,
    "Nxf6": 590,
    "Qc5": 591,
    "Rac8": 592,
    "Rfc8": 593,
    "Rxc8+": 594,
    "Qxc8": 595,
    "Qc2+": 596,
    "Qf5": 597,
    "Qxb7": 598,
    "Qxg4": 599,
    "Qxf7+": 600,
    "Nce2": 601,
    "Nb8": 602,
    "Rh3": 603,
    "Neg1": 604,
    "Qxa8": 605,
    "Qa1+": 606,
    "Nhg5+": 607,
    "Bxg5": 608,
    "Nxg5+": 609,
    "Nxg5": 610,
    "Bxc3+": 611,
    "Bxd3": 612,
    "Qxf6": 613,
    "Rxf6": 614,
    "Rxb6": 615,
    "Ne2+": 616,
    "Nxc1": 617,
    "Rd6": 618,
    "Rxd5": 619,
    "Bh4": 620,
    "Re5": 621,
    "Rf4": 622,
    "Rg5+": 623,
    "Rxe3": 624,
    "Re2+": 625,
    "Nxd7": 626,
    "Qxd7": 627,
    "bxa4": 628,
    "Rfa1": 629,
    "Red8": 630,
    "Rdc8": 631,
    "Bxf3": 632,
    "exf3": 633,
    "Qxd1": 634,
    "Kxd7": 635,
    "Rc2": 636,
    "Rdc1": 637,
    "Rb4": 638,
    "R6c2": 639,
    "Re5+": 640,
    "Bxe5+": 641,
    "Bxa3": 642,
    "Nxa6": 643,
    "N3xe4": 644,
    "Kxg2": 645,
    "Qc6+": 646,
    "Qxf3+": 647,
    "Kxf3": 648,
    "Rba8": 649,
    "Nxf8": 650,
    "Ra3+": 651,
    "Rb2": 652,
    "Rb3": 653,
    "N7c5": 654,
    "Ra3": 655,
    "gxh4": 656,
    "Rg4+": 657,
    "Rd4": 658,
    "Rf3": 659,
    "Nxh4+": 660,
    "Nxf3": 661,
    "Nf4+": 662,
    "Nxh3+": 663,
    "Rxh3": 664,
    "Rxd3+": 665,
    "Kxf4": 666,
    "Ng7+": 667,
    "Nxe6+": 668,
    "Bh6+": 669,
    "Reg8": 670,
    "Bh5+": 671,
    "Rxg6": 672,
    "Rhxh6": 673,
    "Ngf6": 674,
    "Qb6+": 675,
    "Nc7": 676,
    "Nd6+": 677,
    "Kb8": 678,
    "Rhf8": 679,
    "Qxc3": 680,
    "Rxc3": 681,
    "cxd6": 682,
    "Rcd3": 683,
    "Bxa7+": 684,
    "Kxa7": 685,
    "bxc5": 686,
    "Rxb5": 687,
    "Rxc8": 688,
    "Kxa5": 689,
    "Bxh7": 690,
    "Bb1": 691,
    "exd7": 692,
    "d8=Q": 693,
    "Ka1": 694,
    "b1=Q": 695,
    "Qxb1+": 696,
    "Qxf4": 697,
    "Qxf7": 698,
    "Kd1": 699,
    "Bg3": 700,
    "Rf1": 701,
    "Rfd8": 702,
    "Qxb4": 703,
    "Red2": 704,
    "Qe8": 705,
    "Qf8": 706,
    "Rxc2": 707,
    "Qxf8+": 708,
    "Rd5": 709,
    "Rd1+": 710,
    "Nxf3+": 711,
    "Qa5": 712,
    "Qc5+": 713,
    "Qd1": 714,
    "Rfe8": 715,
    "Rbd8": 716,
    "e3+": 717,
    "Rb2+": 718,
    "e2+": 719,
    "Rb1+": 720,
    "e1=Q#": 721,
    "Qxa1": 722,
    "Bc6+": 723,
    "Qxc5": 724,
    "Rxg2+": 725,
    "Qxb2+": 726,
    "e4+": 727,
    "Bxf4": 728,
    "Nxf4+": 729,
    "Nxh3": 730,
    "f4+": 731,
    "Kxe4": 732,
    "Nxe3": 733,
    "Rxf2": 734,
    "Qxf2": 735,
    "Qg4+": 736,
    "Qg3+": 737,
    "Qxg3": 738,
    "hxg3+": 739,
    "Kxg3": 740,
    "Bxd5": 741,
    "Qc6": 742,
    "Nf1": 743,
    "Reb8": 744,
    "Reb1": 745,
    "Ne8": 746,
    "Nge6": 747,
    "Nxg6": 748,
    "hxg6": 749,
    "Qxg6+": 750,
    "Qh6+": 751,
    "Qh8+": 752,
    "Qg7+": 753,
    "Qe7#": 754,
    "Bxd7+": 755,
    "Nhf6": 756,
    "Rxf8": 757,
    "Rdb1": 758,
    "Rxg7+": 759,
    "Kxg7": 760,
    "Qg5+": 761,
    "Rb7": 762,
    "Qg7": 763,
    "Qxe5+": 764,
    "Rxe5": 765,
    "exf2+": 766,
    "Rb3+": 767,
    "Rxg3": 768,
    "Rh6": 769,
    "Rh5": 770,
    "Rb6+": 771,
    "a7": 772,
    "Rg3+": 773,
    "a8=Q": 774,
    "Qc8+": 775,
    "Qh8": 776,
    "Rg2+": 777,
    "Rg1+": 778,
    "Ndf3": 779,
    "Nxg3": 780,
    "hxg3": 781,
    "Qh1": 782,
    "Bxg3": 783,
    "Qxh4": 784,
    "Bxe3+": 785,
    "Rxf1": 786,
    "Be4+": 787,
    "Bxc4+": 788,
    "Rc6+": 789,
    "h2": 790,
    "h1=Q": 791,
    "Bxc1": 792,
    "Raxc1": 793,
    "fxg6": 794,
    "Ra2+": 795,
    "Nc5+": 796,
    "Qxb7+": 797,
    "Kxc5": 798,
    "Qxc6+": 799,
    "Rf3+": 800,
    "Bh2": 801,
    "Qxg4+": 802,
    "Bg1": 803,
    "Rxh8": 804,
    "Qxg7+": 805,
    "Bxg7": 806,
    "Bxh8": 807,
    "Na2": 808,
    "Nc1": 809,
    "Be1": 810,
    "Bxa8": 811,
    "Bd5+": 812,
    "Qxd5+": 813,
    "Qf3#": 814,
    "Nxg2+": 815,
    "Qxg2": 816,
    "Rhg1": 817,
    "Rde1": 818,
    "Rge1": 819,
    "Qxe6+": 820,
    "Rcd1": 821,
    "Qxa2": 822,
    "Rxa7": 823,
    "Re8+": 824,
    "Bxe8": 825,
    "Rb5+": 826,
    "Rf6+": 827,
    "Rxb6+": 828,
    "Qe7+": 829,
    "Ba5": 830,
    "Ned2": 831,
    "Qxc4+": 832,
    "Re1+": 833,
    "bxa3": 834,
    "dxe7": 835,
    "Ncb1": 836,
    "R8d4": 837,
    "gxf3": 838,
    "Rxa3": 839,
    "Rxf7": 840,
    "c2": 841,
    "e7+": 842,
    "e8=Q": 843,
    "Qe3+": 844,
    "Kf6+": 845,
    "Ncd5": 846,
    "Rbf8": 847,
    "Rge6": 848,
    "Rce1": 849,
    "Ref2": 850,
    "Ref7": 851,
    "Rfe2": 852,
    "Ref8": 853,
    "Nf6+": 854,
    "Qb4": 855,
    "Nb2": 856,
    "Rxc3+": 857,
    "Nxd4+": 858,
    "Bxa6": 859,
    "Rxf4+": 860,
    "Nc4#": 861,
    "Nxh5": 862,
    "Nxe7+": 863,
    "Bxh5": 864,
    "Qxh5": 865,
    "N4f5": 866,
    "Rdf7": 867,
    "fxg5": 868,
    "Rxg5+": 869,
    "Rdg1": 870,
    "R5g2": 871,
    "Ka7": 872,
    "Rff6": 873,
    "Rh7": 874,
    "Rxc2+": 875,
    "Qxe8": 876,
    "Kxh7": 877,
    "Qh4+": 878,
    "Qg1+": 879,
    "Nxg1": 880,
    "Bxh7+": 881,
    "Rcf8": 882,
    "Qxg7": 883,
    "Ne5+": 884,
    "Rhg8": 885,
    "Qxe7+": 886,
    "Rxe7+": 887,
    "Rgg8": 888,
    "Rg7": 889,
    "Rg5": 890,
    "Kxf6": 891,
    "g8=Q": 892,
    "Re4+": 893,
    "Rxh4": 894,
    "Rh7+": 895,
    "Qg8+": 896,
    "Qxe8+": 897,
    "Kxc6": 898,
    "Kxd5": 899,
    "Kxb5": 900,
    "a8=Q#": 901,
    "Qxd3+": 902,
    "Rxd4+": 903,
    "Re3": 904,
    "Rxg8": 905,
    "Kxg8": 906,
    "Ra8+": 907,
    "f1=Q+": 908,
    "Qh3+": 909,
    "Qd5+": 910,
    "Rxh6+": 911,
    "Rg6+": 912,
    "Kxh5": 913,
    "Rg1": 914,
    "Qb5+": 915,
    "N8d7": 916,
    "exd3": 917,
    "Rxf5": 918,
    "Raf1": 919,
    "Rxd7": 920,
    "Qxg3+": 921,
    "R6f3": 922,
    "Rxf7+": 923,
    "Ngf3": 924,
    "Nfe5": 925,
    "fxg3": 926,
    "g5+": 927,
    "Nc6+": 928,
    "fxg7": 929,
    "Qa6+": 930,
    "Ne3+": 931,
    "Kxe3": 932,
    "Nxg4": 933,
    "Qb7+": 934,
    "Nxb3": 935,
    "Nh7": 936,
    "Nxh5+": 937,
    "Qa3+": 938,
    "Re6+": 939,
    "Qxa6": 940,
    "gxh2": 941,
    "Rh3+": 942,
    "Rxg6+": 943,
    "c8=Q+": 944,
    "N6d7": 945,
    "Nxa4": 946,
    "Nxb6": 947,
    "Rea8": 948,
    "Rb7+": 949,
    "Rf7#": 950,
    "Nfxd5": 951,
    "Kxf1": 952,
    "Ne4+": 953,
    "Qc3+": 954,
    "a6+": 955,
    "Kxa6": 956,
    "Qb8+": 957,
    "Nbc3": 958,
    "Bc3+": 959,
    "fxg2": 960,
    "Rxg2": 961,
    "Bf4+": 962,
    "Nxc6+": 963,
    "Qxf3": 964,
    "Kxe2": 965,
    "Rhb1": 966,
    "Bxa7": 967,
    "Bxb8": 968,
    "Nb2+": 969,
    "Nd1+": 970,
    "Kxc7": 971,
    "c3+": 972,
    "c2+": 973,
    "c1=Q": 974,
    "Qb1": 975,
    "Qeb4#": 976,
    "Ned7": 977,
    "Rbc8": 978,
    "Bxb7": 979,
    "Nf3+": 980,
    "Nxe1+": 981,
    "Kxe1": 982,
    "Nxb7": 983,
    "Rxb4": 984,
    "Rxh5": 985,
    "Bc4+": 986,
    "Qd1#": 987,
    "Nxc2": 988,
    "Qxc2": 989,
    "Bd8": 990,
    "Re3+": 991,
    "hxg5+": 992,
    "Kxg4": 993,
    "b3+": 994,
    "Rdxe6": 995,
    "Qg7#": 996,
    "Qa4+": 997,
    "Rfd1": 998,
    "Rexd8": 999,
    "Rxd7+": 1000,
    "Rxe6#": 1001,
    "Ba8": 1002,
    "Nh3+": 1003,
    "Nf2+": 1004,
    "Ngh2": 1005,
    "dxe6": 1006,
    "Ree8": 1007,
    "gxh4+": 1008,
    "exd7+": 1009,
    "Nbxd7": 1010,
    "Qe2+": 1011,
    "N1d2": 1012,
    "Bxf2+": 1013,
    "Rf1+": 1014,
    "Bxg2+": 1015,
    "Bg3+": 1016,
    "Kxh3": 1017,
    "Rxa1": 1018,
    "Bxh2": 1019,
    "g6+": 1020,
    "Qxg2+": 1021,
    "Rbe8": 1022,
    "Bxe4+": 1023,
    "Rf4+": 1024,
    "c4+": 1025,
    "Kxb3": 1026,
    "e6+": 1027,
    "hxg4+": 1028,
    "h7": 1029,
    "Rd6+": 1030,
    "Rh2": 1031,
    "Rh2+": 1032,
    "Rh1+": 1033,
    "Qc1": 1034,
    "Qxc1+": 1035,
    "Kxc1": 1036,
    "Rcxc2+": 1037,
    "Rcf2": 1038,
    "Rxc1+": 1039,
    "Rxf3": 1040,
    "Rxb3": 1041,
    "Ndb5": 1042,
    "Ne7+": 1043,
    "Rxe7": 1044,
    "R8e2": 1045,
    "Rg2": 1046,
    "Reg1": 1047,
    "Bxc2+": 1048,
    "Kxc2": 1049,
    "Qf5+": 1050,
    "Re7+": 1051,
    "Rhg2": 1052,
    "Qh4#": 1053,
    "Qb1+": 1054,
    "Bd4+": 1055,
    "Kxe7": 1056,
    "Ba3+": 1057,
    "Qxa5": 1058,
    "R2d6": 1059,
    "Rc1+": 1060,
    "R8d7": 1061,
    "Rdd8": 1062,
    "Qxf6+": 1063,
    "Rxd5+": 1064,
    "Qxh8": 1065,
    "h8=Q": 1066,
    "Qa3": 1067,
    "Bxa1": 1068,
    "Rh6+": 1069,
    "Rh5+": 1070,
    "Kxa3": 1071,
    "e7": 1072,
    "Nbc6": 1073,
    "Nfxd4": 1074,
    "Raa8": 1075,
    "Qxd8+": 1076,
    "dxe7+": 1077,
    "Qxg6": 1078,
    "Bxh6": 1079,
    "Rdf8": 1080,
    "Kxb7": 1081,
    "a4+": 1082,
    "b4+": 1083,
    "bxc5+": 1084,
    "Rdf4": 1085,
    "Rbf3": 1086,
    "Nxg6+": 1087,
    "cxd2+": 1088,
    "b7": 1089,
    "b8=Q+": 1090,
    "Qa7": 1091,
    "fxe5+": 1092,
    "Kxe5": 1093,
    "a1=Q+": 1094,
    "Qxf5+": 1095,
    "Qxh6": 1096,
    "Rbd1": 1097,
    "Qxe1+": 1098,
    "Qxh8+": 1099,
    "Qxh7": 1100,
    "cxb2": 1101,
    "Qb3+": 1102,
    "Qxb4#": 1103,
    "f7": 1104,
    "f8=Q+": 1105,
    "Qed6": 1106,
    "Qfd6+": 1107,
    "Qdc7#": 1108,
    "N1f3": 1109,
    "Nexf7": 1110,
    "fxe6+": 1111,
    "Bxe6+": 1112,
    "Qf3+": 1113,
    "Nc2+": 1114,
    "Qa8+": 1115,
    "Rxf5+": 1116,
    "gxf5+": 1117,
    "d5+": 1118,
    "e5+": 1119,
    "f6+": 1120,
    "Kxe6": 1121,
    "O-O-O+": 1122,
    "Bxf5+": 1123,
    "Bxd2+": 1124,
    "Qxd2#": 1125,
    "Nbd5": 1126,
    "Rfxf5": 1127,
    "Kh4": 1128,
    "Qxf2#": 1129,
    "Qxc1": 1130,
    "Qxf2+": 1131,
    "Qf2+": 1132,
    "Qf1+": 1133,
    "Rxf1+": 1134,
    "Bh7+": 1135,
    "Ba2": 1136,
    "gxh7+": 1137,
    "Qxe4+": 1138,
    "Qc7+": 1139,
    "Qxh7+": 1140,
    "Rxe1": 1141,
    "cxb4": 1142,
    "Qxf1#": 1143,
    "Qxe2+": 1144,
    "Qe1#": 1145,
    "dxe3": 1146,
    "Rdf1": 1147,
    "Rce8": 1148,
    "Nxf1": 1149,
    "Bxe7+": 1150,
    "Rxd8+": 1151,
    "Nc3+": 1152,
    "Qh5+": 1153,
    "Qxh1": 1154,
    "Nxc7": 1155,
    "Nxa7": 1156,
    "Nc8": 1157,
    "d7+": 1158,
    "Nxd8": 1159,
    "Rf8+": 1160,
    "Nce5": 1161,
    "bxa6": 1162,
    "Rxc7": 1163,
    "Raxa6": 1164,
    "Raxd8": 1165,
    "Qh7+": 1166,
    "Rd3+": 1167,
    "Rxd6+": 1168,
    "cxd6+": 1169,
    "Rd7+": 1170,
    "Rd5+": 1171,
    "Bxg8": 1172,
    "Nxg4+": 1173,
    "Bxg7+": 1174,
    "gxf6+": 1175,
    "Nde4": 1176,
    "Rae7": 1177,
    "R7e6": 1178,
    "Ndf6": 1179,
    "Nf1+": 1180,
    "Ne1+": 1181,
    "Nh4+": 1182,
    "Ng1+": 1183,
    "Kxg1": 1184,
    "Na3": 1185,
    "Nge5": 1186,
    "gxf4+": 1187,
    "Ng6+": 1188,
    "Nxf8+": 1189,
    "Qxf8": 1190,
    "fxe4+": 1191,
    "gxh6": 1192,
    "Qxh6+": 1193,
    "Qf4#": 1194,
    "Nxd3+": 1195,
    "Qd3+": 1196,
    "gxh5+": 1197,
    "Rf2+": 1198,
    "Rxa4+": 1199,
    "Na4+": 1200,
    "dxc2": 1201,
    "gxh3": 1202,
    "Nxd5+": 1203,
    "R6f5": 1204,
    "hxg2": 1205,
    "Nxg2": 1206,
    "R5f3": 1207,
    "R3f2": 1208,
    "Rbc2": 1209,
    "Rxc6+": 1210,
    "Nxa5+": 1211,
    "Nfd2": 1212,
    "Qxc3+": 1213,
    "Rg5#": 1214,
    "Kxd2": 1215,
    "Red8+": 1216,
    "Rc2+": 1217,
    "Kxb2": 1218,
    "Rxh6": 1219,
    "Kxd8": 1220,
    "Rhf1": 1221,
    "Rhc8": 1222,
    "Ne8+": 1223,
    "R1d2": 1224,
    "Rbc5": 1225,
    "a5+": 1226,
    "Rxe2+": 1227,
    "Rfxd1": 1228,
    "Bxf3+": 1229,
    "h5+": 1230,
    "Rxg4+": 1231,
    "Qf7+": 1232,
    "R3d2": 1233,
    "Ree1": 1234,
    "Rdd7": 1235,
    "Red7": 1236,
    "exd5+": 1237,
    "Qe4#": 1238,
    "Bxb7+": 1239,
    "Ra6+": 1240,
    "Qxb4+": 1241,
    "Qxh5+": 1242,
    "Qh1+": 1243,
    "Bb3+": 1244,
    "fxg4+": 1245,
    "Ncd3": 1246,
    "Nec1": 1247,
    "Ba6+": 1248,
    "Bd6+": 1249,
    "Be5+": 1250,
    "Bxb3": 1251,
    "Bxh1": 1252,
    "d4+": 1253,
    "Rbe1": 1254,
    "Bxe1": 1255,
    "Qxe1": 1256,
    "Ree7": 1257,
    "h7+": 1258,
    "Qxf8#": 1259,
    "Qxb6+": 1260,
    "Ngxe2": 1261,
    "Rhxe2": 1262,
    "Qcc3": 1263,
    "Ka8": 1264,
    "Qdb4": 1265,
    "Qca3#": 1266,
    "Qf6+": 1267,
    "Nh1": 1268,
    "Rxb7+": 1269,
    "Nce4": 1270,
    "Nxg3+": 1271,
    "Ng4+": 1272,
    "exf2": 1273,
    "N2c3": 1274,
    "Nba4": 1275,
    "N5xe4+": 1276,
    "Nxe4+": 1277,
    "Bg6+": 1278,
    "Rxa2+": 1279,
    "Kxa2": 1280,
    "Rxa1+": 1281,
    "Rde8": 1282,
    "Ncxe5": 1283,
    "Ra4+": 1284,
    "Qxh3+": 1285,
    "Rdd2": 1286,
    "Nc4+": 1287,
    "Qg1#": 1288,
    "Rexf2": 1289,
    "Re1#": 1290,
    "Ndxe5": 1291,
    "Bxh6+": 1292,
    "Nxh8": 1293,
    "Nhxf3": 1294,
    "Ref1": 1295,
    "Bh1": 1296,
    "Nxc5+": 1297,
    "Nde7": 1298,
    "Qb7#": 1299,
    "Rxa8+": 1300,
    "Nxa8": 1301,
    "Bd1": 1302,
    "b5+": 1303,
    "Qc4+": 1304,
    "Bxd8": 1305,
    "Nce7": 1306,
    "Qxh2": 1307,
    "Qh2+": 1308,
    "Nb6+": 1309,
    "Qf2#": 1310,
    "Nfg5": 1311,
    "Rag1": 1312,
    "R1g3": 1313,
    "Bg7+": 1314,
    "Qg1": 1315,
    "R1d4": 1316,
    "R4d7": 1317,
    "R1d5": 1318,
    "Rbd5": 1319,
    "Rxb4+": 1320,
    "fxg6+": 1321,
    "Ncxd4": 1322,
    "b1=R#": 1323,
    "gxf7+": 1324,
    "N6d5": 1325,
    "Nd7+": 1326,
    "Na1": 1327,
    "Bxa5": 1328,
    "b8=Q": 1329,
    "Rd1#": 1330,
    "Rhd8": 1331,
    "Qh7": 1332,
    "Bf7+": 1333,
    "Bg5+": 1334,
    "Nd5+": 1335,
    "Ref6": 1336,
    "Rff2": 1337,
    "Rgf2": 1338,
    "Rhg2+": 1339,
    "Rgg2": 1340,
    "Rhb2": 1341,
    "Rb1#": 1342,
    "Nhxf4": 1343,
    "Rca3": 1344,
    "Nxe8": 1345,
    "Qb4#": 1346,
    "Ree3": 1347,
    "Ncd7": 1348,
    "g4+": 1349,
    "Rxh7#": 1350,
    "R4e2": 1351,
    "Rec8": 1352,
    "R8e4": 1353,
    "Rfd6": 1354,
    "R8d6": 1355,
    "Qa7+": 1356,
    "Rb8#": 1357,
    "Bxf7+": 1358,
    "Qa1": 1359,
    "g3+": 1360,
    "Nbxd4": 1361,
    "e1=Q+": 1362,
    "Q1xe2+": 1363,
    "hxg7": 1364,
    "Ng3+": 1365,
    "Nef6": 1366,
    "Rfd5": 1367,
    "R5d7": 1368,
    "f7+": 1369,
    "Qf1": 1370,
    "Rhe1+": 1371,
    "Rcb7": 1372,
    "Rhh3": 1373,
    "fxg5+": 1374,
    "h1=Q+": 1375,
    "Rhb8": 1376,
    "Rdxf5": 1377,
    "Rdc2": 1378,
    "Nd4+": 1379,
    "d3+": 1380,
    "exd2+": 1381,
    "Qxc2+": 1382,
    "Rxc4+": 1383,
    "Rxf3+": 1384,
    "Rf5+": 1385,
    "d1=Q+": 1386,
    "Rc5+": 1387,
    "Rc7#": 1388,
    "gxh6+": 1389,
    "N7b6": 1390,
    "Qf7#": 1391,
    "Rdd1": 1392,
    "Qh1#": 1393,
    "Qxg8": 1394,
    "Bxg5+": 1395,
    "Rbxf6": 1396,
    "Qd1+": 1397,
    "Nf8+": 1398,
    "e8=Q+": 1399,
    "Rfd2": 1400,
    "Be3+": 1401,
    "Nxa1": 1402,
    "Rba1": 1403,
    "Bxe2+": 1404,
    "dxe4+": 1405,
    "Qa6": 1406,
    "Nxa4+": 1407,
    "Rxf8+": 1408,
    "Rxf8#": 1409,
    "cxd2": 1410,
    "Rfe8+": 1411,
    "Nxe3+": 1412,
    "Ned3": 1413,
    "Bxf6+": 1414,
    "Ned4": 1415,
    "Qxb1": 1416,
    "Bb2+": 1417,
    "Ra1+": 1418,
    "a2+": 1419,
    "d6+": 1420,
    "Red3": 1421,
    "Ndxe7": 1422,
    "cxb5+": 1423,
    "Qa1#": 1424,
    "Na8": 1425,
    "Rbh8": 1426,
    "Rgf1": 1427,
    "hxg6+": 1428,
    "N1h2": 1429,
    "Nxa2": 1430,
    "Ndf4+": 1431,
    "Nec7": 1432,
    "Rcd8": 1433,
    "Kxd6": 1434,
    "Bxd3+": 1435,
    "Qf8+": 1436,
    "Rag8": 1437,
    "Red1": 1438,
    "Qxh2#": 1439,
    "R1e2": 1440,
    "f8=Q#": 1441,
    "Nxh1": 1442,
    "Qg8#": 1443,
    "Rbb7": 1444,
    "Rbb5": 1445,
    "Rh2#": 1446,
    "c6+": 1447,
    "Qxh3": 1448,
    "Qxb5+": 1449,
    "Rfd7": 1450,
    "Nde5": 1451,
    "R1xf5": 1452,
    "Rff7": 1453,
    "fxe2": 1454,
    "Bxg3+": 1455,
    "Qg8": 1456,
    "Nxh7": 1457,
    "fxe7+": 1458,
    "gxf2+": 1459,
    "Rbg8": 1460,
    "Nbxc3": 1461,
    "Be2+": 1462,
    "Bxh2+": 1463,
    "Nxc3+": 1464,
    "Rdd4": 1465,
    "Ra1#": 1466,
    "Bxc5+": 1467,
    "Rexe6": 1468,
    "Neg4": 1469,
    "Rxb2+": 1470,
    "exf7": 1471,
    "Rfxe4+": 1472,
    "fxe7": 1473,
    "Bf7#": 1474,
    "Qxg8+": 1475,
    "Nxg8": 1476,
    "Nfd4": 1477,
    "N5d4": 1478,
    "fxe3+": 1479,
    "Nb3+": 1480,
    "R3c4": 1481,
    "Nfxe4": 1482,
    "Rdxd3": 1483,
    "Nxd2+": 1484,
    "Qe8#": 1485,
    "Ne2#": 1486,
    "R8c7": 1487,
    "R1c5": 1488,
    "Reb4": 1489,
    "R4b5": 1490,
    "Qxf4+": 1491,
    "g2": 1492,
    "g1=Q": 1493,
    "Qhh5": 1494,
    "Qgg6": 1495,
    "Qhh7": 1496,
    "Qgg8#": 1497,
    "dxe5+": 1498,
    "Rfe1+": 1499,
    "Qc7#": 1500,
    "Nh6+": 1501,
    "cxb2+": 1502,
    "bxa1=Q": 1503,
    "Rxc7+": 1504,
    "Nfe3": 1505,
    "Rff1": 1506,
    "Nge3": 1507,
    "Rfg1": 1508,
    "Qxf1+": 1509,
    "Qxb8": 1510,
    "Rfb1": 1511,
    "Ncd2": 1512,
    "Ncxd6+": 1513,
    "Nd8+": 1514,
    "Nfd5": 1515,
    "Nac8": 1516,
    "Rxg1": 1517,
    "N3d2": 1518,
    "Qxa5+": 1519,
    "Ra5+": 1520,
    "Rxa6+": 1521,
    "Rxc5+": 1522,
    "Neg5": 1523,
    "Rbxc6": 1524,
    "N4f3": 1525,
    "Qxd1#": 1526,
    "gxf7": 1527,
    "Bf5+": 1528,
    "Ndxb5": 1529,
    "Rxh3+": 1530,
    "Qxe8#": 1531,
    "Rhc1": 1532,
    "Qxf7#": 1533,
    "Nf6#": 1534,
    "Raxd1": 1535,
    "Rdf3": 1536,
    "d2+": 1537,
    "g1=Q+": 1538,
    "Qxg2#": 1539,
    "Rfxf4": 1540,
    "Qxd7+": 1541,
    "Rcc7": 1542,
    "Rg7#": 1543,
    "gxh2+": 1544,
    "fxg3+": 1545,
    "Rfc7": 1546,
    "Rdf2": 1547,
    "R2f4": 1548,
    "Rde7": 1549,
    "Nec6": 1550,
    "R1h2": 1551,
    "Qxa4+": 1552,
    "Bxc7+": 1553,
    "R1f6": 1554,
    "Qg2+": 1555,
    "Qxg5+": 1556,
    "Nxa3": 1557,
    "Qxa3+": 1558,
    "Kxh8": 1559,
    "Rxa3+": 1560,
    "N8xd7": 1561,
    "Ncd4": 1562,
    "h3+": 1563,
    "bxc2": 1564,
    "R8e6": 1565,
    "Qa8#": 1566,
    "R1c2": 1567,
    "Rxe5+": 1568,
    "exf4+": 1569,
    "c7+": 1570,
    "cxd8=Q+": 1571,
    "Rdf1+": 1572,
    "Raxc7": 1573,
    "Rxh2+": 1574,
    "Rcc8": 1575,
    "Nh8": 1576,
    "Rfe7": 1577,
    "R5c3": 1578,
    "R6c3": 1579,
    "R3c2": 1580,
    "Bxf2": 1581,
    "e6#": 1582,
    "R1e6": 1583,
    "Rxe6+": 1584,
    "axb2": 1585,
    "Bb4#": 1586,
    "Rfxd8": 1587,
    "Rdb8": 1588,
    "Nfxd7": 1589,
    "Bxf4+": 1590,
    "Rgf8": 1591,
    "Qg5#": 1592,
    "Rfxf7": 1593,
    "Qc1#": 1594,
    "Qxa8+": 1595,
    "Rbxb2": 1596,
    "Rac2": 1597,
    "Raxc2": 1598,
    "Rge2": 1599,
    "N5g6": 1600,
    "exf7+": 1601,
    "Nbd4": 1602,
    "Qxh4+": 1603,
    "Qbd6": 1604,
    "Nef3": 1605,
    "Ngxe4": 1606,
    "Rhf2": 1607,
    "Qxh2+": 1608,
    "Kxh2": 1609,
    "Rf1#": 1610,
    "Rexd5": 1611,
    "Qg2#": 1612,
    "Ba2+": 1613,
    "Bxb1+": 1614,
    "Qb2#": 1615,
    "Nfe4": 1616,
    "Rxg1+": 1617,
    "Be7+": 1618,
    "Rxh4+": 1619,
    "Nxh6+": 1620,
    "Rxg3+": 1621,
    "Qce3": 1622,
    "Qfd4": 1623,
    "Qdd6": 1624,
    "Qcc7+": 1625,
    "Qdd8#": 1626,
    "Nhf3": 1627,
    "Nc1+": 1628,
    "Nf7+": 1629,
    "R1d3": 1630,
    "Bxa4+": 1631,
    "exf6+": 1632,
    "Rhd3": 1633,
    "Rxf2+": 1634,
    "Bxh3+": 1635,
    "b2+": 1636,
    "Rxb3+": 1637,
    "Reg2+": 1638,
    "Rae8+": 1639,
    "Qxf4#": 1640,
    "Rhxd7": 1641,
    "Rdh8": 1642,
    "Bxd6+": 1643,
    "Qxa7#": 1644,
    "Ndf8": 1645,
    "N4g6": 1646,
    "R8f5": 1647,
    "Qe6#": 1648,
    "Be6+": 1649,
    "Na5+": 1650,
    "Rbd4": 1651,
    "R4d2": 1652,
    "Rb6#": 1653,
    "Rac8+": 1654,
    "Qxa2+": 1655,
    "Bc2#": 1656,
    "Nd7#": 1657,
    "Bxa3+": 1658,
    "Rxb8+": 1659,
    "N1e2": 1660,
    "Rff3": 1661,
    "Qxh6#": 1662,
    "Rgd1": 1663,
    "Rag2#": 1664,
    "Nec4": 1665,
    "Nxc2+": 1666,
    "R5d2": 1667,
    "N5c3": 1668,
    "cxb7": 1669,
    "Nbxd2": 1670,
    "Rcg1": 1671,
    "N2f3": 1672,
    "Rxh5#": 1673,
    "N3a4": 1674,
    "R7e3": 1675,
    "Rhf3": 1676,
    "Ree2": 1677,
    "Nbxd5+": 1678,
    "exd6+": 1679,
    "Rxf1#": 1680,
    "Nhf2": 1681,
    "Qxa1+": 1682,
    "Kxa1": 1683,
    "R5d4": 1684,
    "Qxc5+": 1685,
    "R8f6": 1686,
    "Rhxh3": 1687,
    "Rhg3": 1688,
    "Rgf3": 1689,
    "Rfe3": 1690,
    "Rae3": 1691,
    "Rxa7+": 1692,
    "Raa2": 1693,
    "Rab2+": 1694,
    "Rac1+": 1695,
    "Kxc8": 1696,
    "Nxb1": 1697,
    "bxc1=Q+": 1698,
    "Nhxg5+": 1699,
    "Rexf4": 1700,
    "Rhh1": 1701,
    "Qh5#": 1702,
    "Rhxe1": 1703,
    "Ra4#": 1704,
    "bxc7": 1705,
    "Qe2#": 1706,
    "Rhh8": 1707,
    "Rge8": 1708,
    "Nce5+": 1709,
    "Qxg4#": 1710,
    "Nd3#": 1711,
    "Rda8": 1712,
    "Bf2+": 1713,
    "Rah8": 1714,
    "Re8#": 1715,
    "Nhf5": 1716,
    "Nde3": 1717,
    "Nef5+": 1718,
    "Nh1+": 1719,
    "Qxh5#": 1720,
    "Rbg2+": 1721,
    "Rbf1": 1722,
    "R1f2": 1723,
    "R1e3": 1724,
    "Qxd6+": 1725,
    "Bxf8+": 1726,
    "Qce6+": 1727,
    "Qeg8+": 1728,
    "Qh6#": 1729,
    "Rexc2": 1730,
    "Rcxc2": 1731,
    "Ncxd5": 1732,
    "Qxc8+": 1733,
    "Rbd6": 1734,
    "Rh4+": 1735,
    "Bf1+": 1736,
    "Qfg2": 1737,
    "Q2h2#": 1738,
    "Nd2+": 1739,
    "axb1=Q": 1740,
    "Nba3": 1741,
    "Nac2": 1742,
    "Ned5": 1743,
    "Nxb5+": 1744,
    "Nxb2+": 1745,
    "Qf1#": 1746,
    "Nexd5": 1747,
    "Na3+": 1748,
    "c1=Q#": 1749,
    "Rdh1": 1750,
    "Nf2#": 1751,
    "Ref4": 1752,
    "N7f6": 1753,
    "Raxc8": 1754,
    "Qxg1": 1755,
    "R8e7": 1756,
    "Rbxb3": 1757,
    "Rdc3": 1758,
    "bxa7+": 1759,
    "N1c3": 1760,
    "Bb6+": 1761,
    "Bh4+": 1762,
    "f1=Q": 1763,
    "a8=Q+": 1764,
    "Rdg8": 1765,
    "Rec7": 1766,
    "Nec5": 1767,
    "Nf7#": 1768,
    "Rxh7+": 1769,
    "Bxf2#": 1770,
    "Ndxf6": 1771,
    "Nxa7+": 1772,
    "N5xe4": 1773,
    "Qaa2": 1774,
    "R8e3": 1775,
    "g7+": 1776,
    "Qxd8#": 1777,
    "Nxf1+": 1778,
    "gxf2": 1779,
    "N6g4": 1780,
    "Nfxe7": 1781,
    "g5#": 1782,
    "Qh7#": 1783,
    "Rac7": 1784,
    "Bf3+": 1785,
    "d1=Q#": 1786,
    "Rge4": 1787,
    "Ncxe4+": 1788,
    "Bxc8+": 1789,
    "Qd7#": 1790,
    "Qg3#": 1791,
    "Nexd4": 1792,
    "Rbb8": 1793,
    "Rh5#": 1794,
    "Bf6+": 1795,
    "Bc7+": 1796,
    "f8=Q": 1797,
    "Nfd6": 1798,
    "R6g7": 1799,
    "Rxg8+": 1800,
    "Nxe5+": 1801,
    "Rexd1": 1802,
    "Rfh8": 1803,
    "g2+": 1804,
    "Rdxd7": 1805,
    "R1xf3": 1806,
    "Qb3#": 1807,
    "Ndxe4": 1808,
    "Nec3": 1809,
    "Rxh1+": 1810,
    "Ncb6": 1811,
    "bxa5+": 1812,
    "R8xe7": 1813,
    "Rexe3": 1814,
    "Rdd3": 1815,
    "Rcc1": 1816,
    "Rca1": 1817,
    "R7f6": 1818,
    "Ngxe7": 1819,
    "Rde2": 1820,
    "Rfxe7": 1821,
    "R3e4": 1822,
    "R8e2+": 1823,
    "Rbg1": 1824,
    "Rhe3+": 1825,
    "Nbxd5": 1826,
    "Nfxe5": 1827,
    "R2a4": 1828,
    "Nxd7+": 1829,
    "Rab7+": 1830,
    "Nxh8+": 1831,
    "fxg2+": 1832,
    "Nbxd3+": 1833,
    "Rxd1#": 1834,
    "Rexd2": 1835,
    "Rcd7": 1836,
    "bxc4+": 1837,
    "cxd7+": 1838,
    "Rga8": 1839,
    "Nfg4": 1840,
    "N4b3": 1841,
    "Rda1": 1842,
    "R7a6": 1843,
    "Rgb7": 1844,
    "Rh8#": 1845,
    "b6+": 1846,
    "Rad1+": 1847,
    "Nxc8+": 1848,
    "cxb3+": 1849,
    "axb3+": 1850,
    "Nfe2": 1851,
    "Nfg8": 1852,
    "Raa3": 1853,
    "Raxe3": 1854,
    "Rbb1": 1855,
    "f3+": 1856,
    "R1b2+": 1857,
    "cxd4+": 1858,
    "Rc2#": 1859,
    "Rxh5+": 1860,
    "Bxb5+": 1861,
    "Rf8#": 1862,
    "Ncd8": 1863,
    "Nbd8": 1864,
    "Nhf6+": 1865,
    "Ncxe6": 1866,
    "Bxc1+": 1867,
    "a4#": 1868,
    "Be1+": 1869,
    "Ra2#": 1870,
    "R8c6": 1871,
    "Ngf1": 1872,
    "Rcc6": 1873,
    "Kd5+": 1874,
    "c1=Q+": 1875,
    "Rff4+": 1876,
    "Rg8#": 1877,
    "Nhf7": 1878,
    "g8=Q+": 1879,
    "f2+": 1880,
    "Qd6#": 1881,
    "R7e3+": 1882,
    "R4xe3+": 1883,
    "Rce7": 1884,
    "Nxf7+": 1885,
    "Ngf8": 1886,
    "Nexg4": 1887,
    "Rexd4": 1888,
    "Rha1": 1889,
    "Qxa7+": 1890,
    "Nxd8+": 1891,
    "Nfg3": 1892,
    "dxe2": 1893,
    "R4f2": 1894,
    "Rad3": 1895,
    "Bb8+": 1896,
    "Bb6#": 1897,
    "Rdg1+": 1898,
    "Rxg4#": 1899,
    "Nxh2+": 1900,
    "Qxh7#": 1901,
    "Ndf5": 1902,
    "Nfh5": 1903,
    "Qb6#": 1904,
    "N3h2": 1905,
    "Nhf1": 1906,
    "gxf1=Q+": 1907,
    "Rdd6": 1908,
    "Bc2+": 1909,
    "Nexc4": 1910,
    "Nbc4": 1911,
    "gxh7": 1912,
    "Qd2#": 1913,
    "Ndxe6": 1914,
    "h6+": 1915,
    "bxa2": 1916,
    "Qh8#": 1917,
    "N8h7": 1918,
    "Rcc2": 1919,
    "Rfg7": 1920,
    "Rgf6": 1921,
    "R3f4": 1922,
    "R4f6": 1923,
    "Rfd3": 1924,
    "Rxa5+": 1925,
    "b7+": 1926,
    "Na6+": 1927,
    "Qxe6#": 1928,
    "Qxa6+": 1929,
    "bxa7": 1930,
    "Rgf5": 1931,
    "R5f2": 1932,
    "Neg3": 1933,
    "Ne7#": 1934,
    "R1e6+": 1935,
    "Qf6#": 1936,
    "Qexe2": 1937,
    "Qff5+": 1938,
    "Qgg6+": 1939,
    "Qff7+": 1940,
    "Raxf2": 1941,
    "Q1f3": 1942,
    "Qde4": 1943,
    "Qef4+": 1944,
    "Q3xg4": 1945,
    "Qfxf5": 1946,
    "Rha8": 1947,
    "dxc7": 1948,
    "N2b3": 1949,
    "Nde2": 1950,
    "Rxb2#": 1951,
    "Raxe8": 1952,
    "R1d6": 1953,
    "Qd8#": 1954,
    "Qxh1+": 1955,
    "R1xg4": 1956,
    "Rxb1+": 1957,
    "Nxh1+": 1958,
    "Bxg1": 1959,
    "Rh6#": 1960,
    "axb7+": 1961,
    "Bb7+": 1962,
    "R2xb7": 1963,
    "N4c6": 1964,
    "Naxb4": 1965,
    "gxh8=Q": 1966,
    "Rfxe5": 1967,
    "b1=R": 1968,
    "Rbc4": 1969,
    "Rf5#": 1970,
    "N4d5": 1971,
    "gxf8=Q": 1972,
    "bxc6+": 1973,
    "R8b3+": 1974,
    "R7b3": 1975,
    "Rbb2": 1976,
    "Rhe4": 1977,
    "Rab5": 1978,
    "Bxb6+": 1979,
    "Qxc7+": 1980,
    "Ndf4": 1981,
    "Nfh7": 1982,
    "R1f3": 1983,
    "N7c6": 1984,
    "dxe6+": 1985,
    "Kb6+": 1986,
    "Rad8+": 1987,
    "Bxb2+": 1988,
    "Raxa2": 1989,
    "Qc2#": 1990,
    "Red6": 1991,
    "R3xf4": 1992,
    "cxd5+": 1993,
    "Qh2#": 1994,
    "Rcxe6+": 1995,
    "R7e4": 1996,
    "Reg3": 1997,
    "R6g5": 1998,
    "R5g4": 1999,
    "Rcf1": 2000,
    "cxd3+": 2001,
    "Nb7+": 2002,
    "Rgxd6": 2003,
    "Nce6": 2004,
    "Nfe6": 2005,
    "Qxe1#": 2006,
    "Qbc7": 2007,
    "Q7c5": 2008,
    "Q5d4": 2009,
    "Qcc5": 2010,
    "Qdd5+": 2011,
    "Qdd6+": 2012,
    "Qcc6": 2013,
    "Qdd7": 2014,
    "Nde6": 2015,
    "Nh2+": 2016,
    "Rff8": 2017,
    "Ref5": 2018,
    "Rgh1": 2019,
    "Qdxf6+": 2020,
    "Q3f6#": 2021,
    "R5xd4": 2022,
    "R4d3": 2023,
    "R7d6": 2024,
    "R6d5": 2025,
    "R2d3": 2026,
    "Nxb8": 2027,
    "N5a4": 2028,
    "Rec3": 2029,
    "Red5": 2030,
    "Rgf4": 2031,
    "R3d4": 2032,
    "Rea1": 2033,
    "Qxb8+": 2034,
    "gxh3+": 2035,
    "Bh2+": 2036,
    "Ncd6": 2037,
    "fxg7+": 2038,
    "Ngxf5": 2039,
    "Rfxf2": 2040,
    "Rbxe3": 2041,
    "R7e6+": 2042,
    "R6e4": 2043,
    "axb2+": 2044,
    "Qxc3#": 2045,
    "Nxc1+": 2046,
    "Rgg7": 2047,
    "Rbd7": 2048,
    "Rfh2": 2049,
    "R2h6": 2050,
    "Rgxg7+": 2051,
    "exf5+": 2052,
    "Ndxc5": 2053,
    "Rcg7": 2054,
    "R5b7": 2055,
    "Rfb2": 2056,
    "Qb1#": 2057,
    "Re2#": 2058,
    "f1=N+": 2059,
    "Nxh2": 2060,
    "h1=Q#": 2061,
    "R1c7": 2062,
    "gxf3+": 2063,
    "Qgg4+": 2064,
    "Qc8#": 2065,
    "Nfe8": 2066,
    "Ncb5": 2067,
    "Nexf6": 2068,
    "Ng3#": 2069,
    "Rd8#": 2070,
    "Rbe7": 2071,
    "Rec5": 2072,
    "Ned6": 2073,
    "Ndb4": 2074,
    "R3c6": 2075,
    "Rec2": 2076,
    "Rab1+": 2077,
    "Nbc1": 2078,
    "Rxe8#": 2079,
    "R5e2": 2080,
    "R1e5": 2081,
    "Raxb1": 2082,
    "Nfg6": 2083,
    "Bc4#": 2084,
    "R4xb5": 2085,
    "Rxb5+": 2086,
    "Ncd1": 2087,
    "Rgg5": 2088,
    "Raf5+": 2089,
    "Raxb7+": 2090,
    "axb7": 2091,
    "Kxa8": 2092,
    "cxb6+": 2093,
    "Nxa8+": 2094,
    "dxc5+": 2095,
    "Qhg2+": 2096,
    "Qgf3": 2097,
    "Rea2": 2098,
    "Rad5": 2099,
    "Rdc4": 2100,
    "h8=Q+": 2101,
    "dxc3+": 2102,
    "Nxc4+": 2103,
    "Neg6": 2104,
    "Nbc5": 2105,
    "exf3+": 2106,
    "Rdb3": 2107,
    "axb6+": 2108,
    "Rbb6": 2109,
    "N6h5": 2110,
    "Raa7": 2111,
    "Rhh7": 2112,
    "exd3+": 2113,
    "Rcd4": 2114,
    "dxe3+": 2115,
    "N6e5": 2116,
    "Rcb4": 2117,
    "R1b2": 2118,
    "R2b4": 2119,
    "R6b5": 2120,
    "Bxa6+": 2121,
    "exd8=Q+": 2122,
    "Rbc3": 2123,
    "Qxh4#": 2124,
    "R8h5": 2125,
    "Qxe3#": 2126,
    "Qxc5#": 2127,
    "Nexd7": 2128,
    "Rbe6": 2129,
    "Ref6+": 2130,
    "R6d2": 2131,
    "Nd2#": 2132,
    "bxa4+": 2133,
    "Rf4#": 2134,
    "N7d5+": 2135,
    "Nfxg5": 2136,
    "Kxe5+": 2137,
    "Rhf7+": 2138,
    "Raf7": 2139,
    "R7f6+": 2140,
    "R4f7": 2141,
    "Rdxe6+": 2142,
    "Nce3": 2143,
    "Bg2+": 2144,
    "Bg4#": 2145,
    "Ra5#": 2146,
    "Nac3": 2147,
    "bxc3+": 2148,
    "dxc4+": 2149,
    "Qbc3": 2150,
    "Qdd2+": 2151,
    "Qcc1#": 2152,
    "Rah6": 2153,
    "Re6#": 2154,
    "Qbb2": 2155,
    "Nab5": 2156,
    "Rfxd7": 2157,
    "Raxd6": 2158,
    "Rcxb2#": 2159,
    "R5d6": 2160,
    "R1g2": 2161,
    "Rhh5": 2162,
    "N7d5": 2163,
    "Ndb8": 2164,
    "Nxa7#": 2165,
    "R2xd3": 2166,
    "hxg2+": 2167,
    "N5f6": 2168,
    "Nfd3": 2169,
    "g4#": 2170,
    "Qbd2": 2171,
    "e1=R#": 2172,
    "Qac3+": 2173,
    "Rfh1": 2174,
    "Kg3+": 2175,
    "N3e2": 2176,
    "R6e7": 2177,
    "d8=Q#": 2178,
    "Kg1+": 2179,
    "g8=Q#": 2180,
    "Nac6": 2181,
    "N2b4": 2182,
    "Ndc2": 2183,
    "Ngf2+": 2184,
    "Rcg8": 2185,
    "Rde4": 2186,
    "Rge5": 2187,
    "Rg2#": 2188,
    "R7xe6+": 2189,
    "Qb5#": 2190,
    "Rae2": 2191,
    "Rdxa7": 2192,
    "R2d4": 2193,
    "Rcc3": 2194,
    "Qcc4+": 2195,
    "Qdd3+": 2196,
    "Qcc2+": 2197,
    "Ndc4": 2198,
    "Rgh2": 2199,
    "Reg5": 2200,
    "Rgxh2": 2201,
    "Qxg6#": 2202,
    "Qaxa4#": 2203,
    "R8g6": 2204,
    "Rxf2#": 2205,
    "h1=R#": 2206,
    "Rde5": 2207,
    "R5e3": 2208,
    "Nac4": 2209,
    "bxc8=Q": 2210,
    "R8f7": 2211,
    "Rhf7": 2212,
    "Nec2": 2213,
    "Qbd3+": 2214,
    "Q8d7+": 2215,
    "Q3h3#": 2216,
    "Ref3": 2217,
    "Nxg3#": 2218,
    "Rag1+": 2219,
    "Rbe5": 2220,
    "Rge3": 2221,
    "fxe2+": 2222,
    "Rdxd7+": 2223,
    "Rgc7": 2224,
    "R4c6+": 2225,
    "Rexe3+": 2226,
    "Raa5": 2227,
    "Rgb5": 2228,
    "Rdxc3": 2229,
    "f1=Q#": 2230,
    "Nxa2+": 2231,
    "Rhg1+": 2232,
    "exf8=Q+": 2233,
    "Qad4": 2234,
    "Rdxc4": 2235,
    "R2c7": 2236,
    "Rag3+": 2237,
    "Qgg3+": 2238,
    "Rhc4": 2239,
    "Bc1+": 2240,
    "Bd8+": 2241,
    "R7xd4": 2242,
    "Qga7": 2243,
    "Qbxb7+": 2244,
    "Qab6+": 2245,
    "Q7c7+": 2246,
    "Qbb4": 2247,
    "Qbb3": 2248,
    "Qbb2+": 2249,
    "Kd2+": 2250,
    "Ba4+": 2251,
    "dxe8=Q+": 2252,
    "Qff7": 2253,
    "Qef8+": 2254,
    "Q7g7+": 2255,
    "Rhxg7+": 2256,
    "h6#": 2257,
    "N3e4": 2258,
    "h1=N": 2259,
    "Rxf7#": 2260,
    "Rfd8+": 2261,
    "Qxb2#": 2262,
    "N5e4": 2263,
    "Rgh5": 2264,
    "Rxh3#": 2265,
    "Rexh5": 2266,
    "Rfg6": 2267,
    "R2g3": 2268,
    "R7g4": 2269,
    "Kf5+": 2270,
    "R1f7+": 2271,
    "N1b3": 2272,
    "R1xc3": 2273,
    "a3+": 2274,
    "Rdxf2": 2275,
    "R7f3": 2276,
    "Bxe8+": 2277,
    "Rfc2": 2278,
    "Qff2+": 2279,
    "Qee1#": 2280,
    "Qxa2#": 2281,
    "Nxe8+": 2282,
    "Rcd2": 2283,
    "h3#": 2284,
    "Qed5#": 2285,
    "Rgxg6": 2286,
    "Rbxb7": 2287,
    "Rbc7+": 2288,
    "Rcf7": 2289,
    "Rdxd6": 2290,
    "hxg8=Q": 2291,
    "Nexc6": 2292,
    "Ng8+": 2293,
    "Rhxf8": 2294,
    "R8f6+": 2295,
    "R5f7#": 2296,
    "Qfd7+": 2297,
    "Qec8+": 2298,
    "Qdb7+": 2299,
    "Qca8#": 2300,
    "R5b6": 2301,
    "Rch8": 2302,
    "Rhh2": 2303,
    "Nh7+": 2304,
    "e2#": 2305,
    "Qe3#": 2306,
    "Rhf8+": 2307,
    "Rcg7+": 2308,
    "Bxh4+": 2309,
    "Ke6+": 2310,
    "hxg7+": 2311,
    "Nexf6+": 2312,
    "Nexc7": 2313,
    "Rf6#": 2314,
    "Rfc8+": 2315,
    "hxg5#": 2316,
    "R2e3": 2317,
    "R3e4+": 2318,
    "R8e5": 2319,
    "Nbc6+": 2320,
    "Rbc7": 2321,
    "Qdf6+": 2322,
    "Qgxg6#": 2323,
    "Nxb7+": 2324,
    "Rcxd5": 2325,
    "Rah1": 2326,
    "Nexf5": 2327,
    "Rcb8": 2328,
    "Qxe5#": 2329,
    "Nf3#": 2330,
    "Raxb8#": 2331,
    "Nfe7+": 2332,
    "Rdb7": 2333,
    "Nbd2+": 2334,
    "Rxa5#": 2335,
    "Rfxe6": 2336,
    "Qg6#": 2337,
    "Rcxd8": 2338,
    "cxd1=Q+": 2339,
    "hxg1=Q#": 2340,
    "Rbe2": 2341,
    "Qxg1+": 2342,
    "dxc6+": 2343,
    "N6c5": 2344,
    "Rfxb7": 2345,
    "Ndb7": 2346,
    "Bh6#": 2347,
    "Nfxe6": 2348,
    "Ndc7": 2349,
    "R4e7": 2350,
    "Rch1": 2351,
    "Rcxc8": 2352,
    "Nb6#": 2353,
    "Qgg8": 2354,
    "Qfb7+": 2355,
    "Qca8": 2356,
    "bxa8=Q": 2357,
    "Rexc3": 2358,
    "Qh3#": 2359,
    "Rgh4": 2360,
    "R8c4": 2361,
    "N5xd4": 2362,
    "Rdh2": 2363,
    "Nhf4": 2364,
    "Nhg5": 2365,
    "Nhf8": 2366,
    "R7xb5": 2367,
    "N2f4": 2368,
    "Rhxg6": 2369,
    "Qxa8#": 2370,
    "Rdd5": 2371,
    "Rdxc5": 2372,
    "Qa5#": 2373,
    "Rbc6": 2374,
    "Rbd2": 2375,
    "dxc8=Q": 2376,
    "Raf1+": 2377,
    "Bh2#": 2378,
    "Rhxd5": 2379,
    "Rcb1": 2380,
    "Nxh7+": 2381,
    "Rxd8#": 2382,
    "Nxa6+": 2383,
    "Ned6+": 2384,
    "Qda7#": 2385,
    "Qaxe3+": 2386,
    "Rexc8": 2387,
    "Nef4": 2388,
    "Ngf4": 2389,
    "Qa2#": 2390,
    "Rxh8+": 2391,
    "Rcxd4": 2392,
    "N2g3": 2393,
    "bxc8=Q+": 2394,
    "Nbd6": 2395,
    "Ra8#": 2396,
    "axb5+": 2397,
    "Ngxf2": 2398,
    "Nfe6+": 2399,
    "Nxb4+": 2400,
    "R2a5": 2401,
    "Ngxe6+": 2402,
    "N6e7": 2403,
    "Rcc4": 2404,
    "Rbb4": 2405,
    "N1a2": 2406,
    "Qgxg3+": 2407,
    "bxa2+": 2408,
    "h5#": 2409,
    "Rg1#": 2410,
    "Rdc7": 2411,
    "Qde2#": 2412,
    "Ndc6": 2413,
    "Rdxf4": 2414,
    "Rfe6": 2415,
    "Rgd7": 2416,
    "Ngxf4+": 2417,
    "Rdg4": 2418,
    "Ndxf2": 2419,
    "Qee7": 2420,
    "Qec7": 2421,
    "Qdb8+": 2422,
    "Qca7#": 2423,
    "Rhxf1": 2424,
    "Rfxd5": 2425,
    "R6d5+": 2426,
    "R5d3": 2427,
    "Rxa6#": 2428,
    "Rce6": 2429,
    "Reb2": 2430,
    "Bxa2+": 2431,
    "Ne6#": 2432,
    "Ndc3": 2433,
    "Qa7#": 2434,
    "Rea7": 2435,
    "Bxb3+": 2436,
    "Na4#": 2437,
    "Raxb7": 2438,
    "R2c6": 2439,
    "R6c7": 2440,
    "Bh3#": 2441,
    "R6g2": 2442,
    "Bxf3#": 2443,
    "Nef5": 2444,
    "R5f6": 2445,
    "R8b3": 2446,
    "Nce1": 2447,
    "dxc1=Q+": 2448,
    "R3e5": 2449,
    "Rdf6": 2450,
    "R5e7": 2451,
    "R6f4": 2452,
    "Rbh4": 2453,
    "Rgg1": 2454,
    "Bf1#": 2455,
    "Qaa7+": 2456,
    "Qac7+": 2457,
    "Qbd8+": 2458,
    "h2+": 2459,
    "N3h4": 2460,
    "Ncb3": 2461,
    "Rbxd1": 2462,
    "Kd7+": 2463,
    "Rxd7#": 2464,
    "Nfxg6": 2465,
    "Qcc6+": 2466,
    "N7xb6": 2467,
    "Rch5": 2468,
    "Nac7": 2469,
    "Nc2#": 2470,
    "Nexf4": 2471,
    "Reh8": 2472,
    "Qaa4": 2473,
    "Qbb3+": 2474,
    "Raa1": 2475,
    "N4f6": 2476,
    "Qhf6": 2477,
    "Qff2": 2478,
    "Bc8+": 2479,
    "Qff3+": 2480,
    "Qgg2+": 2481,
    "Rba7": 2482,
    "Bxg1+": 2483,
    "N7g6": 2484,
    "N8e7": 2485,
    "Rgc1": 2486,
    "Qdd5": 2487,
    "Qde5+": 2488,
    "Q6d5": 2489,
    "Qee4": 2490,
    "Qdd4+": 2491,
    "Rae6": 2492,
    "R2e3+": 2493,
    "Rfd4": 2494,
    "Rbd7+": 2495,
    "Qg4#": 2496,
    "Rdxf3": 2497,
    "R1f2+": 2498,
    "N3e5": 2499,
    "Qa4#": 2500,
    "Rce3": 2501,
    "R3e2": 2502,
    "Rcxd7": 2503,
    "Rexe5": 2504,
    "Rca8": 2505,
    "R8a2+": 2506,
    "Ne3#": 2507,
    "Ng6#": 2508,
    "Qxc7#": 2509,
    "Rxg8#": 2510,
    "Rgxg2": 2511,
    "Rcxf2": 2512,
    "Qf8#": 2513,
    "Rexe2": 2514,
    "Qhe4+": 2515,
    "Ree6": 2516,
    "Reg6": 2517,
    "Rdxb7": 2518,
    "exd1=Q+": 2519,
    "Qee1+": 2520,
    "Qde1+": 2521,
    "R2h7+": 2522,
    "Nef2": 2523,
    "R2c3": 2524,
    "Rgf7+": 2525,
    "Raf7+": 2526,
    "Ref7+": 2527,
    "Red3+": 2528,
    "Rbc3+": 2529,
    "Ncxd3": 2530,
    "Qa3#": 2531,
    "Rhg7+": 2532,
    "R8h2+": 2533,
    "Ngh5": 2534,
    "Ngf2": 2535,
    "Nxf6#": 2536,
    "R4f3": 2537,
    "Rdh4": 2538,
    "Qcf8": 2539,
    "Kg6+": 2540,
    "Ndf1": 2541,
    "Neg7": 2542,
    "R3c5": 2543,
    "R6e3": 2544,
    "R4c5": 2545,
    "R6xd4": 2546,
    "Rdg2": 2547,
    "Rfh5": 2548,
    "R2g3+": 2549,
    "R4g3+": 2550,
    "Kxb8": 2551,
    "R8e6+": 2552,
    "R6e5+": 2553,
    "Rbf7": 2554,
    "N7b5": 2555,
    "R3d7": 2556,
    "R4d6": 2557,
    "R4e6": 2558,
    "Bd3#": 2559,
    "Rgxh7": 2560,
    "R1xc5": 2561,
    "R8a5": 2562,
    "Raa4": 2563,
    "Rec4": 2564,
    "Rhe3": 2565,
    "R1a6": 2566,
    "b1=Q#": 2567,
    "R4d5": 2568,
    "R3xe2": 2569,
    "R8b4": 2570,
    "Nde6+": 2571,
    "Qcb3": 2572,
    "Qbb5": 2573,
    "Qaa6+": 2574,
    "Qbb7+": 2575,
    "Qaa8#": 2576,
    "Rbxb7+": 2577,
    "Rfb3": 2578,
    "b4#": 2579,
    "Qd3#": 2580,
    "Rcb2": 2581,
    "Ngf6+": 2582,
    "Ra7#": 2583,
    "Ree4": 2584,
    "Rhe2": 2585,
    "R8xc7+": 2586,
    "R7xc6": 2587,
    "R6c5": 2588,
    "Reb8#": 2589,
    "Rdf5": 2590,
    "f5#": 2591,
    "Rfxe8": 2592,
    "R8xf6": 2593,
    "R3f6": 2594,
    "Rfa6": 2595,
    "Rab2": 2596,
    "Bg3#": 2597,
    "Reh7": 2598,
    "R2b3": 2599,
    "b6#": 2600,
    "Rcg4": 2601,
    "R8g7": 2602,
    "R3g7": 2603,
    "Qxh3#": 2604,
    "Nd6#": 2605,
    "Nexg5": 2606,
    "cxd7": 2607,
    "R8d3": 2608,
    "Rcc5": 2609,
    "Rfc1+": 2610,
    "Rb5#": 2611,
    "Nbc7+": 2612,
    "Kd6+": 2613,
    "Rce2": 2614,
    "Bxg4#": 2615,
    "exd1=Q": 2616,
    "Rc1#": 2617,
    "Bxh5+": 2618,
    "Rec6": 2619,
    "Reg7": 2620,
    "Rgd2": 2621,
    "Rdxb5+": 2622,
    "Nb5#": 2623,
    "N7xf6": 2624,
    "N2e4": 2625,
    "Rexe4": 2626,
    "Red4+": 2627,
    "Rcd4+": 2628,
    "gxf8=Q+": 2629,
    "Rhxc5": 2630,
    "R2c4": 2631,
    "Qxb7#": 2632,
    "Rcxf3": 2633,
    "Bd1+": 2634,
    "Rgxf6": 2635,
    "R8f2+": 2636,
    "Qef2": 2637,
    "Qge3": 2638,
    "Qed3": 2639,
    "Qdb3": 2640,
    "Qca2#": 2641,
    "R8d2": 2642,
    "Red4": 2643,
    "Qxc2#": 2644,
    "Rhxh3+": 2645,
    "Rhg3+": 2646,
    "Qxe7#": 2647,
    "Rfxd2": 2648,
    "Rexd3": 2649,
    "Bg8+": 2650,
    "Bg6#": 2651,
    "Rde3": 2652,
    "R5c4": 2653,
    "R4c2": 2654,
    "Ndf2": 2655,
    "Rad4": 2656,
    "Reg4": 2657,
    "R5e6": 2658,
    "Rhg7": 2659,
    "Rdxd4": 2660,
    "Rgd8": 2661,
    "R7xe4": 2662,
    "Rexg6": 2663,
    "R3g4": 2664,
    "Ndxc4": 2665,
    "Rgc2": 2666,
    "R7c6": 2667,
    "Rhxd1": 2668,
    "Raxa7": 2669,
    "Rag7+": 2670,
    "Rba6": 2671,
    "Nac1": 2672,
    "R4xc7": 2673,
    "R1xb5": 2674,
    "Qxg8#": 2675,
    "Rxg5#": 2676,
    "R2f6": 2677,
    "Ndxf5": 2678,
    "Qee8#": 2679,
    "Qb8#": 2680,
    "Nce4+": 2681,
    "Nexd4+": 2682,
    "Bf3#": 2683,
    "R8b6": 2684,
    "R6b3": 2685,
    "Ndxc1": 2686,
    "Q1c4": 2687,
    "bxa3+": 2688,
    "Rge2#": 2689,
    "Rc8#": 2690,
    "Rda7": 2691,
    "Rh3#": 2692,
    "R5a4": 2693,
    "R4a3": 2694,
    "R2xc3": 2695,
    "Raxb8": 2696,
    "Ncxd6": 2697,
    "Nfxe4+": 2698,
    "R4xc5": 2699,
    "Ngf5": 2700,
    "Ngf4+": 2701,
    "f3#": 2702,
    "Ba6#": 2703,
    "Rgxe5": 2704,
    "Nexc2+": 2705,
    "Qhe8+": 2706,
    "Qed7": 2707,
    "Qcb5+": 2708,
    "Qgxg3": 2709,
    "Qgc3": 2710,
    "Qab2+": 2711,
    "R1b7": 2712,
    "Rba4": 2713,
    "Rfxf7#": 2714,
    "Rh4#": 2715,
    "R6d7": 2716,
    "exf8=Q#": 2717,
    "N4a6": 2718,
    "Rdxc8": 2719,
    "Raf2#": 2720,
    "Rfxf7+": 2721,
    "R5e4": 2722,
    "Qxa5#": 2723,
    "Nce3+": 2724,
    "Rhc7": 2725,
    "Kc2+": 2726,
    "Rad7": 2727,
    "Nde1": 2728,
    "Nexc5": 2729,
    "Qexe2+": 2730,
    "R8f2": 2731,
    "Qxf5#": 2732,
    "bxc2+": 2733,
    "Qgg4": 2734,
    "Qhh3": 2735,
    "Qhg4": 2736,
    "N3d4": 2737,
    "cxd8=Q#": 2738,
    "Bxf5#": 2739,
    "a7+": 2740,
    "Ngxf6": 2741,
    "Ba7+": 2742,
    "Rae7+": 2743,
    "Rbe7+": 2744,
    "Rbxb1": 2745,
    "Rcd6": 2746,
    "Qff1#": 2747,
    "Nbd6+": 2748,
    "Rab3": 2749,
    "Rg3#": 2750,
    "Rexd7": 2751,
    "Qf5#": 2752,
    "Qxf3#": 2753,
    "Rdxe8": 2754,
    "R4c6": 2755,
    "Rdb1+": 2756,
    "R6c4": 2757,
    "Be5#": 2758,
    "Bb1+": 2759,
    "Raxf7": 2760,
    "R6f7": 2761,
    "R2d7": 2762,
    "Rab6": 2763,
    "Qxc6#": 2764,
    "R1xc4": 2765,
    "Rdc5": 2766,
    "Rexc1": 2767,
    "Nac5": 2768,
    "Bxg2#": 2769,
    "R1xe4": 2770,
    "Rbxe7": 2771,
    "Qac5+": 2772,
    "Rhe8+": 2773,
    "g1=Q#": 2774,
    "Ncxb4": 2775,
    "Qcxa3+": 2776,
    "Q3b3": 2777,
    "Qbb5+": 2778,
    "Rag8+": 2779,
    "Rxd6#": 2780,
    "Rfg3": 2781,
    "Rfg8": 2782,
    "Rae1+": 2783,
    "a1=R": 2784,
    "Q8f7+": 2785,
    "Rxc8#": 2786,
    "Rexb2": 2787,
    "Rbxa2": 2788,
    "Rag7#": 2789,
    "Rxe1#": 2790,
    "Bg1+": 2791,
    "Rad2": 2792,
    "R7d5": 2793,
    "Rcd5": 2794,
    "R6xe5": 2795,
    "Nxa3+": 2796,
    "Nxd1+": 2797,
    "Rgc8": 2798,
    "bxc7+": 2799,
    "Qxc8#": 2800,
    "Qcf4+": 2801,
    "Qgxg4": 2802,
    "Qgg3": 2803,
    "Qgg1#": 2804,
    "Rhf5": 2805,
    "Ngh6": 2806,
    "Raxa5": 2807,
    "Rfg5": 2808,
    "Rgf1+": 2809,
    "Rcxe7": 2810,
    "R2h3": 2811,
