{
    "<|startofgame|>": 0,
    "Nf3": 1,
    "c5": 2,
    "e4": 3,
    "d6": 4,
    "Bb5+": 5,
    "Nd7": 6,
    "O-O": 7,
    "Nf6": 8,
    "Re1": 9,
    "a6": 10,
    "Bd3": 11,
    "b5": 12,
    "c3": 13,
    "Bb7": 14,
    "Bc2": 15,
    "e6": 16,
    "d4": 17,
    "Be7": 18,
    "Nbd2": 19,
    "Nf1": 20,
    "cxd4": 21,
    "Rc8": 22,
    "e5": 23,
    "d5": 24,
    "Nc5": 25,
    "Qc7": 26,
    "b4": 27,
    "Ncd7": 28,
    "Nb6": 29,
    "Ng3": 30,
    "g6": 31,
    "Bh6": 32,
    "Rfe8": 33,
    "Rc1": 34,
    "Qd7": 35,
    "Nd2": 36,
    "Ng4": 37,
    "Be3": 38,
    "Nxe3": 39,
    "fxe3": 40,
    "Rxc1": 41,
    "Qxc1": 42,
    "h5": 43,
    "Nb3": 44,
    "h4": 45,
    "h3": 46,
    "Na5": 47,
    "hxg2": 48,
    "Kxg2": 49,
    "Bc8": 50,
    "Kg1": 51,
    "Qg4+": 52,
    "Bh4": 53,
    "Kf2": 54,
    "Qh3": 55,
    "Rh1": 56,
    "f5": 57,
    "Qf1": 58,
    "Qg4": 59,
    "exf5": 60,
    "Be2": 61,
    "Qxf5+": 62,
    "Qxf1+": 63,
    "Nxf1": 64,
    "Nxd5": 65,
    "Bd1": 66,
    "Nxb4": 67,
    "Bb3+": 68,
    "Kg7": 69,
    "Bd8": 70,
    "a3": 71,
    "Nd3": 72,
    "Nc6": 73,
    "Bb6": 74,
    "Kg2": 75,
    "Bxe3": 76,
    "<|endofgame|>": 77,
    "c4": 78,
    "Nc3": 79,
    "Bg7": 80,
    "Ne7": 81,
    "Ne1": 82,
    "Ne8": 83,
    "f3": 84,
    "g4": 85,
    "fxg4": 86,
    "Rxf1+": 87,
    "Kxf1": 88,
    "c6": 89,
    "cxd5": 90,
    "Bd7": 91,
    "g5": 92,
    "Nh5": 93,
    "Bxh5": 94,
    "gxh5": 95,
    "Qxh5": 96,
    "Ng6": 97,
    "Qc8": 98,
    "Nf2": 99,
    "Nb1": 100,
    "Qa6": 101,
    "Rc7": 102,
    "Bb5": 103,
    "Bf1+": 104,
    "Rf8": 105,
    "Nf6+": 106,
    "Rxf6": 107,
    "gxf6": 108,
    "Rxg7+": 109,
    "g3": 110,
    "Bb4": 111,
    "Nge2": 112,
    "Bg2": 113,
    "h6": 114,
    "Kh2": 115,
    "Re8": 116,
    "f4": 117,
    "Nd4": 118,
    "d3": 119,
    "Bxc3": 120,
    "Nxc3": 121,
    "Ne2": 122,
    "Nh7": 123,
    "bxc3": 124,
    "Nb5": 125,
    "Qb3": 126,
    "Nd6": 127,
    "exd5": 128,
    "Rb8": 129,
    "Qa4": 130,
    "Qh4": 131,
    "Qxa7": 132,
    "Bf3": 133,
    "Bxd5": 134,
    "Qf2": 135,
    "Bxf3": 136,
    "Qxf3": 137,
    "Nxe4": 138,
    "Ndxe4": 139,
    "dxe4": 140,
    "Rxe4": 141,
    "Rbe8": 142,
    "Bf4": 143,
    "Nd5": 144,
    "Bg3": 145,
    "Qf6": 146,
    "Rfe1": 147,
    "Ra4": 148,
    "Be5": 149,
    "Rxa2+": 150,
    "Kg3": 151,
    "Qd6+": 152,
    "Qc5": 153,
    "Ra3": 154,
    "Re3": 155,
    "Ra1": 156,
    "Re8+": 157,
    "Kh7": 158,
    "Kh4": 159,
    "Qf6+": 160,
    "hxg5+": 161,
    "Bxg5": 162,
    "Ra4+": 163,
    "Qxg5+": 164,
    "Ra2+": 165,
    "Re2": 166,
    "Qh4+": 167,
    "Rf2": 168,
    "Qg5+": 169,
    "Qxg4+": 170,
    "hxg4": 171,
    "Kh6": 172,
    "Kf3": 173,
    "Kg5": 174,
    "Rh2": 175,
    "Ra3+": 176,
    "Kxg4": 177,
    "Rh4+": 178,
    "Kxf5": 179,
    "Bc4": 180,
    "Ngf6": 181,
    "a4": 182,
    "a5": 183,
    "Qe7": 184,
    "b6": 185,
    "Ndf6": 186,
    "Nc4": 187,
    "Qe2": 188,
    "Bc1": 189,
    "gxf3": 190,
    "Bxh3": 191,
    "Ne3": 192,
    "Ng5": 193,
    "Nxf3+": 194,
    "Kxh3": 195,
    "Qh2+": 196,
    "Bg5": 197,
    "Bxf6": 198,
    "Qxf6": 199,
    "e3": 200,
    "Rac1": 201,
    "dxc4": 202,
    "Bxc4": 203,
    "Bg4": 204,
    "Nxc4": 205,
    "Nxe2": 206,
    "Nbd7": 207,
    "b3": 208,
    "Bb2": 209,
    "Bf8": 210,
    "Ne4": 211,
    "Ba3": 212,
    "Bxc5": 213,
    "dxc5": 214,
    "Qc2": 215,
    "f6": 216,
    "Rad1": 217,
    "Be6": 218,
    "Rd2": 219,
    "Bh3": 220,
    "axb3": 221,
    "Rfd1": 222,
    "Qa5": 223,
    "Rd7": 224,
    "Qb4": 225,
    "R1d3": 226,
    "Qb2": 227,
    "bxc4": 228,
    "Qxa1": 229,
    "cxd3": 230,
    "Rxd3": 231,
    "Qxc4": 232,
    "Qc3": 233,
    "Qxc3": 234,
    "Rxc3": 235,
    "Rc2": 236,
    "Bxd2": 237,
    "Rxd2": 238,
    "Kf7": 239,
    "Ke3": 240,
    "Ke6": 241,
    "Kd2": 242,
    "Kc3": 243,
    "exf5+": 244,
    "gxf5": 245,
    "Ra2": 246,
    "gxf4": 247,
    "exf4": 248,
    "Ra6+": 249,
    "Kf5": 250,
    "Ra5+": 251,
    "Kg6": 252,
    "Kxc4": 253,
    "Rxe2": 254,
    "Kd4": 255,
    "h5+": 256,
    "Rf5": 257,
    "Rxf3": 258,
    "Ke4": 259,
    "Rh3": 260,
    "Kxf4": 261,
    "Rxh5": 262,
    "Rxh5+": 263,
    "Kxh5": 264,
    "Kh1": 265,
    "Kg4": 266,
    "h2+": 267,
    "Qb6": 268,
    "Qxb2": 269,
    "Rb1": 270,
    "Qa3": 271,
    "Nf4": 272,
    "Qh5": 273,
    "dxe6": 274,
    "fxe6": 275,
    "Rbe1": 276,
    "Nb4": 277,
    "Bb1": 278,
    "Nxe5": 279,
    "Bxf5": 280,
    "Qf7": 281,
    "Nxf8": 282,
    "Bxb1": 283,
    "Qxh7+": 284,
    "Bxh7": 285,
    "N8e6": 286,
    "Bf5": 287,
    "Bxe6": 288,
    "Nxe6": 289,
    "Bc3": 290,
    "Re4": 291,
    "Rg4+": 292,
    "Ng5+": 293,
    "Rh4": 294,
    "Kxg5": 295,
    "f4+": 296,
    "Kf6": 297,
    "Rh6+": 298,
    "Ke7": 299,
    "Rh5": 300,
    "Kd7": 301,
    "Rh7": 302,
    "Kc7": 303,
    "Rxf7+": 304,
    "Nxd4": 305,
    "cxb3": 306,
    "Nxb3": 307,
    "Bxe4": 308,
    "Qxe4": 309,
    "Bf6": 310,
    "Qxe7": 311,
    "Bxe7": 312,
    "Rab8": 313,
    "Rfd8": 314,
    "Rcd1": 315,
    "Kf8": 316,
    "Ke8": 317,
    "Rxd8+": 318,
    "Rxd8": 319,
    "Bc5": 320,
    "Kc8": 321,
    "Kb7": 322,
    "bxc5": 323,
    "Rd4": 324,
    "Rc4": 325,
    "Ke2": 326,
    "Rb1+": 327,
    "Kc6": 328,
    "Kxd5": 329,
    "Kd3": 330,
    "c4+": 331,
    "Re7": 332,
    "Rd8+": 333,
    "Bh5": 334,
    "Bg6": 335,
    "Ne5": 336,
    "Nxg6": 337,
    "hxg6": 338,
    "Bd6": 339,
    "Re1+": 340,
    "Qd3": 341,
    "Bc7": 342,
    "Ba3+": 343,
    "Kg8": 344,
    "Bb6+": 345,
    "Kf1": 346,
    "Ba5": 347,
    "Bxb7": 348,
    "Rxc4": 349,
    "d7": 350,
    "Qxb3": 351,
    "Rxb3": 352,
    "Rxd7": 353,
    "Rxe7": 354,
    "Rd3": 355,
    "Qe1": 356,
    "Bb3": 357,
    "axb5": 358,
    "Nxc2": 359,
    "Nxa1": 360,
    "Bxg7": 361,
    "Bxf8": 362,
    "Bxf7+": 363,
    "Kxf8": 364,
    "Ne6+": 365,
    "Qg5": 366,
    "Qb6+": 367,
    "Qe3": 368,
    "Qxg6": 369,
    "Qf4": 370,
    "Qg8#": 371,
    "Bd2": 372,
    "N2b3": 373,
    "Rfc1": 374,
    "Nf8": 375,
    "Ne6": 376,
    "Bxe5": 377,
    "Rxe6": 378,
    "fxg6": 379,
    "Rf6": 380,
    "Nxb7": 381,
    "Rxf2+": 382,
    "Rxh2": 383,
    "Rxc6": 384,
    "Rxe3": 385,
    "Rxg6": 386,
    "Rxg3+": 387,
    "Qf3": 388,
    "Qd1": 389,
    "N4c6": 390,
    "exd6": 391,
    "Nh4": 392,
    "Nxh4": 393,
    "Bxe2": 394,
    "Qxe2": 395,
    "Bxh4": 396,
    "Bxg3": 397,
    "hxg3": 398,
    "Qxe5": 399,
    "Qb5": 400,
    "Qxc7": 401,
    "Qd1+": 402,
    "Qh5+": 403,
    "Ba4": 404,
    "Qe8": 405,
    "Kh8": 406,
    "Ng8": 407,
    "exd4": 408,
    "Nge7": 409,
    "Qd8": 410,
    "Na7": 411,
    "Nxa7": 412,
    "Rxa7": 413,
    "Bh8": 414,
    "Bxb3": 415,
    "Qe6": 416,
    "Qd5": 417,
    "Qxd5": 418,
    "Raa8": 419,
    "Rac8": 420,
    "dxc6": 421,
    "bxc6": 422,
    "Rxe8": 423,
    "Nxc6": 424,
    "Re2+": 425,
    "Ne5+": 426,
    "Kh5": 427,
    "Nxg4": 428,
    "Ba6": 429,
    "Bb4+": 430,
    "Nfd7": 431,
    "dxe5": 432,
    "Rxd5": 433,
    "Rd6": 434,
    "Qg7": 435,
    "Bd4": 436,
    "Nf3+": 437,
    "Qxb5": 438,
    "Bxc6": 439,
    "Be4": 440,
    "exf6": 441,
    "Kxg7": 442,
    "Red4": 443,
    "Qe5": 444,
    "Qd6": 445,
    "Rf7": 446,
    "Rc6": 447,
    "Rc5": 448,
    "Qc6": 449,
    "Rxd4": 450,
    "Qxd4": 451,
    "Qxe6": 452,
    "Rxa6": 453,
    "Rb6": 454,
    "Rxb5": 455,
    "dxc3": 456,
    "Rg3+": 457,
    "Rxg4": 458,
    "Ke5": 459,
    "Rxa5+": 460,
    "h2": 461,
    "Kh3": 462,
    "h1=Q+": 463,
    "Kf4": 464,
    "Qxf6+": 465,
    "Kd5": 466,
    "Qd5+": 467,
    "Qfc6": 468,
    "Qdg5+": 469,
    "O-O-O": 470,
    "fxg3": 471,
    "Kb1": 472,
    "Qd4+": 473,
    "fxe5": 474,
    "Rf4": 475,
    "Rae8": 476,
    "Qg3": 477,
    "Qg6": 478,
    "Qb3+": 479,
    "hxg5": 480,
    "Rf1": 481,
    "Rg8": 482,
    "Qh6+": 483,
    "Qh7": 484,
    "Kxh7": 485,
    "f7": 486,
    "fxg8=Q+": 487,
    "Kxg8": 488,
    "Re3+": 489,
    "Rf3": 490,
    "Re6": 491,
    "h6+": 492,
    "Rg3": 493,
    "Rg1": 494,
    "c2": 495,
    "h7": 496,
    "Rc3+": 497,
    "Rxc2": 498,
    "Rd7+": 499,
    "Kc1": 500,
    "Kb2": 501,
    "Re5": 502,
    "Rb5+": 503,
    "Rc6+": 504,
    "Bxd4": 505,
    "Qxf4": 506,
    "fxe4": 507,
    "Rxf4": 508,
    "Raf8": 509,
    "Rhf1": 510,
    "Rxc4+": 511,
    "Rxh4": 512,
    "Be6+": 513,
    "Bf5+": 514,
    "Rxc7": 515,
    "Rxb2+": 516,
    "Rb5": 517,
    "Rc8+": 518,
    "Rxf8+": 519,
    "Rd8": 520,
    "Rc5+": 521,
    "Rxb7": 522,
    "Rxd5+": 523,
    "Kc4": 524,
    "Bh1": 525,
    "Kc2": 526,
    "Na4": 527,
    "Nac3": 528,
    "Rab1": 529,
    "Ba7": 530,
    "Rde8": 531,
    "Nxe6+": 532,
    "Nb6+": 533,
    "Kb8": 534,
    "Nd7+": 535,
    "Ka7": 536,
    "Nc7": 537,
    "Nc3+": 538,
    "Nxb1": 539,
    "Nxe8": 540,
    "Nxh5": 541,
    "Na3": 542,
    "Rh6": 543,
    "Rg6": 544,
    "Rd1": 545,
    "Rxg3": 546,
    "Rxe3+": 547,
    "Rxh7": 548,
    "Rh5+": 549,
    "Rxc5": 550,
    "Rxa5": 551,
    "Qxh3": 552,
    "Bc5+": 553,
    "Nxh2": 554,
    "Qg2": 555,
    "Qxg2+": 556,
    "Rdd8": 557,
    "Nf4+": 558,
    "Bxf4": 559,
    "Ncd2": 560,
    "Rdxd2+": 561,
    "Nxd2": 562,
    "Rxd2+": 563,
    "Rc7+": 564,
    "Kd6": 565,
    "Rxc3+": 566,
    "h1=Q": 567,
    "Qd3+": 568,
    "Ke1": 569,
    "Re7#": 570,
    "Qd2": 571,
    "Nh3": 572,
    "Ka1": 573,
    "Rxe5": 574,
    "Rec5": 575,
    "Rxc2+": 576,
    "Ka3": 577,
    "Bd5": 578,
    "Rbxb4": 579,
    "Rfxf7+": 580,
    "h7+": 581,
    "Nd8": 582,
    "Bxh6": 583,
    "Nxf6+": 584,
    "Qxh6+": 585,
    "Qxg7+": 586,
    "R8e7": 587,
    "Red1": 588,
    "Rd5+": 589,
    "Rd5": 590,
    "Rf8+": 591,
    "Ra8": 592,
    "Rd2+": 593,
    "Rb7": 594,
    "Rxb6+": 595,
    "Nh6": 596,
    "Qe4+": 597,
    "Nf5": 598,
    "Nxf7": 599,
    "Qxb4": 600,
    "Nbd6": 601,
    "Nc2": 602,
    "Nxf5": 603,
    "Qc4": 604,
    "Qxa6": 605,
    "bxa6": 606,
    "Rfc8": 607,
    "Rbc1": 608,
    "Rb2": 609,
    "Rxa2": 610,
    "cxd6": 611,
    "Rxd6": 612,
    "Bxg4": 613,
    "Kxf3": 614,
    "fxg5+": 615,
    "Rf7+": 616,
    "Rxa7+": 617,
    "Re4+": 618,
    "Ra5": 619,
    "Rb4": 620,
    "Rb7+": 621,
    "Rf5+": 622,
    "Rf4+": 623,
    "Ra6": 624,
    "Rc4+": 625,
    "Rad8": 626,
    "Ng7": 627,
    "Rxd1": 628,
    "Bxd8": 629,
    "Bh2": 630,
    "Qf5": 631,
    "Qc1+": 632,
    "Qc2+": 633,
    "Qxb3+": 634,
    "Qf3+": 635,
    "Qd7+": 636,
    "Qe8+": 637,
    "Qc8+": 638,
    "axb4": 639,
    "Na2": 640,
    "Rbc8": 641,
    "Qxg4": 642,
    "Qxf7+": 643,
    "Qg7#": 644,
    "Qxb7": 645,
    "bxa3": 646,
    "Rxa3": 647,
    "Qxc5": 648,
    "Rxa4": 649,
    "Qxc2": 650,
    "Ra7+": 651,
    "Rc2+": 652,
    "Rxg7": 653,
    "Nxf2": 654,
    "Nd3+": 655,
    "Kd1": 656,
    "Rxg2": 657,
    "Nxb5": 658,
    "Nc2+": 659,
    "Nd4+": 660,
    "Nf2+": 661,
    "Qxf5": 662,
    "Rb3": 663,
    "Rfb8": 664,
    "Rdc1": 665,
    "Be1": 666,
    "R8b3": 667,
    "Bxc1": 668,
    "exf7": 669,
    "f8=Q": 670,
    "Be3+": 671,
    "Rh1#": 672,
    "Bc6": 673,
    "Qa5+": 674,
    "Rec1": 675,
    "R1c4": 676,
    "Rf1+": 677,
    "Rf2+": 678,
    "Qe4": 679,
    "Qxd4+": 680,
    "Qxe6+": 681,
    "Qf5+": 682,
    "gxh4": 683,
    "Rae1": 684,
    "f7+": 685,
    "Rg7": 686,
    "Rxf7": 687,
    "Qxf7": 688,
    "Ncd4": 689,
    "Qxd6": 690,
    "Qxe3+": 691,
    "Bxg2+": 692,
    "Qxb8+": 693,
    "Rce1": 694,
    "Qc6+": 695,
    "Qe5+": 696,
    "Qxh6": 697,
    "Qf2+": 698,
    "Qxa2": 699,
    "Qd8+": 700,
    "gxh5+": 701,
    "Qh3+": 702,
    "Qxe5+": 703,
    "Kxe5": 704,
    "f5+": 705,
    "Qc5+": 706,
    "Nxd5+": 707,
    "Rhc8": 708,
    "Qb8": 709,
    "Bxd6": 710,
    "Rxe7+": 711,
    "Kxe7": 712,
    "Qxc7+": 713,
    "Qxb6": 714,
    "Nxb6": 715,
    "Bxc2": 716,
    "Bxb4": 717,
    "Rg2+": 718,
    "Bxa3": 719,
    "Nxh7+": 720,
    "Ne4+": 721,
    "Rh7+": 722,
    "Kb5": 723,
    "Kb4": 724,
    "Rh8": 725,
    "Bd6+": 726,
    "Kb3": 727,
    "Re6+": 728,
    "Bb8": 729,
    "Nxc8": 730,
    "Rbxc8": 731,
    "Rce8": 732,
    "Rxf8": 733,
    "d2": 734,
    "Rf3+": 735,
    "Nxd2+": 736,
    "g3+": 737,
    "a2": 738,
    "g4+": 739,
    "hxg4+": 740,
    "Nxa2": 741,
    "Nc6+": 742,
    "Ne7+": 743,
    "Nxg4+": 744,
    "g2": 745,
    "Nxe7+": 746,
    "Nxh3": 747,
    "Kxe4": 748,
    "Ng1+": 749,
    "Nh3+": 750,
    "Nhf6": 751,
    "Qh6": 752,
    "Nxb3+": 753,
    "Qxc2+": 754,
    "Qxd1+": 755,
    "Ka2": 756,
    "Qa1+": 757,
    "Qc3+": 758,
    "Qa5#": 759,
    "Nf7": 760,
    "cxb4": 761,
    "bxa5": 762,
    "Bxa5": 763,
    "Bxb2": 764,
    "Qf8": 765,
    "Rxb4": 766,
    "Bxd5+": 767,
    "Rd3+": 768,
    "Rxf4+": 769,
    "Rg7+": 770,
    "Rxh6+": 771,
    "Nce2": 772,
    "Rxf5": 773,
    "Qg3+": 774,
    "Qxe1+": 775,
    "Bxe1": 776,
    "Ra7": 777,
    "Bf2": 778,
    "Bh5+": 779,
    "Bxd7": 780,
    "Rdxd7": 781,
    "Bxa4": 782,
    "Ba1": 783,
    "Qd4": 784,
    "Rxb1": 785,
    "Bxf2+": 786,
    "Qa7": 787,
    "Nfe4": 788,
    "Nxg5": 789,
    "Rxc8": 790,
    "Qxc8": 791,
    "Rae2": 792,
    "Nec5": 793,
    "Ne2+": 794,
    "Rcxf2": 795,
    "Rxf2": 796,
    "Bxa1": 797,
    "Nxd6": 798,
    "Bxc5+": 799,
    "Rxa1": 800,
    "cxb5+": 801,
    "Bf7+": 802,
    "Bxg2": 803,
    "Ngf3": 804,
    "Qxh2": 805,
    "Qh1+": 806,
    "Qxe4+": 807,
    "Nxc5": 808,
    "Rg5": 809,
    "Rg4": 810,
    "Kc5": 811,
    "fxg5": 812,
    "Be8": 813,
    "Rxd1+": 814,
    "Qxd1": 815,
    "Kxd1": 816,
    "Bxf2": 817,
    "Bf2+": 818,
    "Qe3+": 819,
    "Bg2#": 820,
    "Bxc3+": 821,
    "Bxf1": 822,
    "Rxf1": 823,
    "Qxa3": 824,
    "Qa2": 825,
    "Rxc1+": 826,
    "Ra8+": 827,
    "Rc3": 828,
    "Nd6+": 829,
    "Nxe5+": 830,
    "Nh4+": 831,
    "Nf5+": 832,
    "Ng3+": 833,
    "Ne3+": 834,
    "e7": 835,
    "Kxh6": 836,
    "Nxf1+": 837,
    "Qxf1": 838,
    "f6+": 839,
    "fxg7": 840,
    "Qf4+": 841,
    "exf3": 842,
    "Qe1+": 843,
    "Rxf3+": 844,
    "Re7+": 845,
    "Rxh6": 846,
    "Rd6+": 847,
    "Ra1+": 848,
    "Bf1": 849,
    "Nxf4": 850,
    "Qxh4": 851,
    "Qxd8": 852,
    "g5+": 853,
    "Bxg6+": 854,
    "Kxg6": 855,
    "Qh6#": 856,
    "Bxd4+": 857,
    "Nc7+": 858,
    "Kd8": 859,
    "N7g6": 860,
    "Rdh1": 861,
    "Rhd8": 862,
    "R1h5": 863,
    "Na7+": 864,
    "Rxc8+": 865,
    "Kxc8": 866,
    "Rh8+": 867,
    "Rg1+": 868,
    "Kxc3": 869,
    "Nxe3+": 870,
    "Nhf2": 871,
    "Rxb8": 872,
    "Ba2": 873,
    "Rb2+": 874,
    "Ncb5": 875,
    "Nxg7": 876,
    "Bxb5": 877,
    "Bxd7+": 878,
    "Qxd7": 879,
    "Rhe8": 880,
    "Bh7+": 881,
    "Ng6+": 882,
    "Neg6": 883,
    "Raf1": 884,
    "Nh8": 885,
    "Nhg6": 886,
    "Nxe7": 887,
    "dxe7": 888,
    "Kxf7": 889,
    "Nxd7": 890,
    "Qe6+": 891,
    "Qd2+": 892,
    "Rcxf3": 893,
    "Rxg5": 894,
    "Rg8+": 895,
    "Kxe6": 896,
    "Kb6": 897,
    "Rg5+": 898,
    "a7": 899,
    "e2": 900,
    "Kxa7": 901,
    "e1=Q": 902,
    "Ng4+": 903,
    "Qxg5": 904,
    "Qxh4+": 905,
    "Rg6+": 906,
    "axb6": 907,
    "Nxh8": 908,
    "Rxh8": 909,
    "Rhe1": 910,
    "Nb7": 911,
    "Qxa4": 912,
    "Qa3+": 913,
    "Qxe1": 914,
    "Rxe1": 915,
    "Rxe1+": 916,
    "Bd5+": 917,
    "Qxd8+": 918,
    "Nb2": 919,
    "Na4+": 920,
    "Rd1+": 921,
    "Re5+": 922,
    "Nc4+": 923,
    "Nxa5": 924,
    "Kxf2": 925,
    "Rh2+": 926,
    "Ka5": 927,
    "Ka4": 928,
    "Kxa3": 929,
    "Kxf6": 930,
    "Ka6": 931,
    "Kxc5": 932,
    "Bxc6+": 933,
    "Nbc3": 934,
    "cxb2+": 935,
    "Kxb2": 936,
    "Rc1+": 937,
    "Ka8": 938,
    "e4+": 939,
    "Bxe5+": 940,
    "Rgxg7": 941,
    "Rcf7": 942,
    "Qxf3+": 943,
    "Qf1#": 944,
    "Qb7": 945,
    "Nh2": 946,
    "Nxd3": 947,
    "Rxb5+": 948,
    "b7": 949,
    "Rb4+": 950,
    "Rb3+": 951,
    "Kxb7": 952,
    "g1=Q": 953,
    "Rxg1+": 954,
    "Kxg1": 955,
    "Nce5": 956,
    "N6e5": 957,
    "Ndb4": 958,
    "Nd5+": 959,
    "Qc4+": 960,
    "exd5+": 961,
    "N1c3": 962,
    "Nbc7+": 963,
    "Nxa8": 964,
    "Qxa8": 965,
    "Kxc6": 966,
    "Rxd7+": 967,
    "Kxd7": 968,
    "Rxd6+": 969,
    "Qxf8": 970,
    "Qxh8": 971,
    "Nde5": 972,
    "Ncd5": 973,
    "Qxd2+": 974,
    "Kxd2": 975,
    "Nxb6+": 976,
    "Rhc1": 977,
    "fxg4+": 978,
    "Rxb4+": 979,
    "Rxh3": 980,
    "Rxe4+": 981,
    "Kxb4": 982,
    "h8=Q": 983,
    "b2": 984,
    "Qa4+": 985,
    "Qb5+": 986,
    "b1=Q+": 987,
    "Qxb1+": 988,
    "Qb3#": 989,
    "Qxc6": 990,
    "Bxb6": 991,
    "Nxd1": 992,
    "Nxg3": 993,
    "Be5+": 994,
    "Nxf6": 995,
    "Qxd2": 996,
    "Rg2": 997,
    "Rda5": 998,
    "Qxg6+": 999,
    "e5+": 1000,
    "Qh8+": 1001,
    "Qg7+": 1002,
    "Qf3#": 1003,
    "Na6": 1004,
    "Nfe8": 1005,
    "Rdg1": 1006,
    "gxh7+": 1007,
    "Rxg8": 1008,
    "hxg8=Q+": 1009,
    "Bxa2": 1010,
    "Bf7": 1011,
    "Bxd1": 1012,
    "Ndf3": 1013,
    "R8b2+": 1014,
    "Rhg1": 1015,
    "Nbxd7": 1016,
    "Rxb2": 1017,
    "Rdxf7": 1018,
    "Qb8+": 1019,
    "Qxa7+": 1020,
    "Qf8+": 1021,
    "h4+": 1022,
    "Kxh4": 1023,
    "Qe2+": 1024,
    "Qxd3+": 1025,
    "Bxb2+": 1026,
    "b1=Q": 1027,
    "a8=Q+": 1028,
    "Qa7+": 1029,
    "Qa6+": 1030,
    "Qg1+": 1031,
    "Qh7+": 1032,
    "Qg2+": 1033,
    "Nxf3": 1034,
    "Qxe3": 1035,
    "Qf5#": 1036,
    "Nbc6": 1037,
    "Qxa5": 1038,
    "Nb8": 1039,
    "cxb2": 1040,
    "Kxb1": 1041,
    "h1=N": 1042,
    "Bxh1": 1043,
    "a8=Q": 1044,
    "Bd5#": 1045,
    "Bxc2+": 1046,
    "Kxc2": 1047,
    "b3+": 1048,
    "Qxc3+": 1049,
    "Re4#": 1050,
    "Kxd8": 1051,
    "Bxa6": 1052,
    "Nxc3+": 1053,
    "Kxe3": 1054,
    "b5+": 1055,
    "Rxb6": 1056,
    "Rxe8+": 1057,
    "dxe5+": 1058,
    "Bxh8": 1059,
    "Bxg6": 1060,
    "Bxf6+": 1061,
    "Qc7+": 1062,
    "Qxc5+": 1063,
    "Nxd4+": 1064,
    "Ng2": 1065,
    "Kxb3": 1066,
    "a4+": 1067,
    "Kxa4": 1068,
    "cxb5": 1069,
    "Nge5": 1070,
    "Bc7+": 1071,
    "Nxa6+": 1072,
    "fxg2": 1073,
    "gxh3+": 1074,
    "Bf4+": 1075,
    "Bxf7": 1076,
    "Rdd1": 1077,
    "Nb5+": 1078,
    "Nxh6": 1079,
    "Nd1": 1080,
    "Nxb2": 1081,
    "Rbf1": 1082,
    "Bc4+": 1083,
    "Rde1": 1084,
    "Bxd3": 1085,
    "Qxd3": 1086,
    "Nbd4": 1087,
    "c7": 1088,
    "Nxc7": 1089,
    "Nxh7": 1090,
    "Ra8#": 1091,
    "Rxd4+": 1092,
    "Qxg7": 1093,
    "Qxh8+": 1094,
    "Qb1": 1095,
    "Qxe8": 1096,
    "Nfd5": 1097,
    "Nxa4": 1098,
    "bxa4": 1099,
    "Rxa8+": 1100,
    "Bxa8": 1101,
    "Bxd2+": 1102,
    "Rxh1": 1103,
    "Nxh1": 1104,
    "Nxd3+": 1105,
    "Ng1": 1106,
    "Be4+": 1107,
    "Rxg1": 1108,
    "Qh2": 1109,
    "Bxb5+": 1110,
    "Bxb8": 1111,
    "Kxh1": 1112,
    "exf7+": 1113,
    "N5f6": 1114,
    "Rcd7": 1115,
    "Nbd5": 1116,
    "Rdb8": 1117,
    "R7xa6": 1118,
    "Rxh1+": 1119,
    "Nfd4+": 1120,
    "Nb3+": 1121,
    "Nxa3": 1122,
    "Nac2": 1123,
    "Rgb1": 1124,
    "Raxc2": 1125,
    "Qa8": 1126,
    "Qxb8": 1127,
    "Qb7+": 1128,
    "Qe7+": 1129,
    "Nfg4": 1130,
    "c5+": 1131,
    "Rch1": 1132,
    "Bxe2+": 1133,
    "Kxe2": 1134,
    "R3e2": 1135,
    "Ng7+": 1136,
    "Ng2+": 1137,
    "Nc8": 1138,
    "Nc1": 1139,
    "Nb4+": 1140,
    "Nb7+": 1141,
    "Nd2+": 1142,
    "Nxc5+": 1143,
    "Kxd4": 1144,
    "gxh3": 1145,
    "Ba8": 1146,
    "hxg6+": 1147,
    "Rdxe6": 1148,
    "Na1": 1149,
    "Rxg2+": 1150,
    "Rdg8": 1151,
    "Kxc7": 1152,
    "N2f3": 1153,
    "Red8": 1154,
    "Kxg3": 1155,
    "Rxb1+": 1156,
    "Kxb5": 1157,
    "Rhf8": 1158,
    "Kxd3": 1159,
    "Rxa3+": 1160,
    "Rdc7": 1161,
    "Rb8+": 1162,
    "Rcc7": 1163,
    "Rce7": 1164,
    "exf6+": 1165,
    "Rxf6+": 1166,
    "Ree6": 1167,
    "Rf6+": 1168,
    "Rab6": 1169,
    "Rxh4+": 1170,
    "Rxg5+": 1171,
    "Rh2#": 1172,
    "Bxc7": 1173,
    "Bxh2": 1174,
    "Qg6+": 1175,
    "Bxh2+": 1176,
    "Kxh2": 1177,
    "Rxh7#": 1178,
    "Ned7": 1179,
    "Bd4+": 1180,
    "Nac5": 1181,
    "Ndc5": 1182,
    "Nxe2+": 1183,
    "Rd4+": 1184,
    "cxb6": 1185,
    "Qxh5+": 1186,
    "Nfd2": 1187,
    "Na5+": 1188,
    "Nc5+": 1189,
    "Kxd6": 1190,
    "c3+": 1191,
    "Qc1": 1192,
    "exd3": 1193,
    "Qa8+": 1194,
    "Rxa8": 1195,
    "Rff8": 1196,
    "Nxe1": 1197,
    "Kxa5": 1198,
    "b4+": 1199,
    "a3+": 1200,
    "b2+": 1201,
    "Bd3+": 1202,
    "Rxc5+": 1203,
    "Bd7+": 1204,
    "Rxa4+": 1205,
    "Bxe6+": 1206,
    "Nxc1": 1207,
    "Rcd8": 1208,
    "Bxe3+": 1209,
    "N7f6": 1210,
    "Ngxe7": 1211,
    "Bxh7+": 1212,
    "Nxf7+": 1213,
    "Qxh3+": 1214,
    "Qg8": 1215,
    "Qxc1+": 1216,
    "Rxc7+": 1217,
    "Kxb8": 1218,
    "Rxf5+": 1219,
    "g7": 1220,
    "g8=Q": 1221,
    "Qxe2+": 1222,
    "Ncb8": 1223,
    "Rhg8": 1224,
    "Reb1": 1225,
    "R3b2": 1226,
    "h8=Q+": 1227,
    "Rhd1": 1228,
    "Bh7": 1229,
    "Bh6+": 1230,
    "Nf7+": 1231,
    "Nxd8+": 1232,
    "d5+": 1233,
    "N5xf6": 1234,
    "Qb1#": 1235,
    "Nac4": 1236,
    "Nbc4": 1237,
    "Bxh6+": 1238,
    "Rhxh6": 1239,
    "Qxf4+": 1240,
    "R4d7": 1241,
    "Qxe7+": 1242,
    "Bg5+": 1243,
    "Rge8": 1244,
    "Rb6+": 1245,
    "N1h2": 1246,
    "Nh6+": 1247,
    "gxh6": 1248,
    "Qxg2": 1249,
    "Ref8": 1250,
    "Rgf8": 1251,
    "R8f6": 1252,
    "Rxd3+": 1253,
    "Rgb8": 1254,
    "Rea6": 1255,
    "Qa1": 1256,
    "Neg5": 1257,
    "fxe4+": 1258,
    "Rxe6+": 1259,
    "Nhf5": 1260,
    "Ne8+": 1261,
    "Qf7+": 1262,
    "e3+": 1263,
    "axb2": 1264,
    "Rxe5+": 1265,
    "Rh3+": 1266,
    "Rfb1": 1267,
    "Rae3": 1268,
    "Rcc2": 1269,
    "R1e2": 1270,
    "Rgxe2+": 1271,
    "Qg2#": 1272,
    "Qxh1": 1273,
    "d4+": 1274,
    "h3+": 1275,
    "g2+": 1276,
    "Ba6+": 1277,
    "Bg8": 1278,
    "Bxe8": 1279,
    "Kxe8": 1280,
    "g1=Q+": 1281,
    "b8=Q": 1282,
    "Qxc4+": 1283,
    "Nbxc3": 1284,
    "Rbc6": 1285,
    "Rcb6": 1286,
    "R6b5": 1287,
    "d3+": 1288,
    "Rxb3+": 1289,
    "Raxd1": 1290,
    "Qxb4+": 1291,
    "Qb2#": 1292,
    "Nde2": 1293,
    "Nde7": 1294,
    "Rxg4+": 1295,
    "Ne1+": 1296,
    "Nf8+": 1297,
    "d8=Q": 1298,
    "Rxg6+": 1299,
    "Rfc1+": 1300,
    "Qxf2": 1301,
    "Nbxd2": 1302,
    "Qxg7#": 1303,
    "Ba4+": 1304,
    "Bxg7+": 1305,
    "bxa5+": 1306,
    "Rxa6+": 1307,
    "Qxb6+": 1308,
    "Rcd3": 1309,
    "Kxa2": 1310,
    "Nxe4+": 1311,
    "f8=Q+": 1312,
    "Qa2#": 1313,
    "cxb7": 1314,
    "Ngxf7": 1315,
    "Rcb1": 1316,
    "Rda8": 1317,
    "Rxa1+": 1318,
    "Nd1+": 1319,
    "Nh1": 1320,
    "R8f7": 1321,
    "d2+": 1322,
    "Rcg3": 1323,
    "Qxg3": 1324,
    "Qxf2+": 1325,
    "R8d6": 1326,
    "gxf4+": 1327,
    "Rag1": 1328,
    "Rxg8+": 1329,
    "Nxg8": 1330,
    "Bxf5+": 1331,
    "R4e6": 1332,
    "Qxh2+": 1333,
    "Nxh6+": 1334,
    "Nxa6": 1335,
    "Bxa7": 1336,
    "Rfa8": 1337,
    "cxd6+": 1338,
    "Rcb2": 1339,
    "d7+": 1340,
    "a1=Q": 1341,
    "d8=Q+": 1342,
    "Bxe4+": 1343,
    "Rbb2": 1344,
    "Rfd1+": 1345,
    "Qxd5+": 1346,
    "Qxg3+": 1347,
    "hxg7": 1348,
    "gxf6+": 1349,
    "N4b3": 1350,
    "Bh2+": 1351,
    "e8=Q": 1352,
    "Qxd7+": 1353,
    "Kxh8": 1354,
    "Qcc5": 1355,
    "Raa6": 1356,
    "Bxd6+": 1357,
    "Qe5#": 1358,
    "Rdd2": 1359,
    "gxf1=Q+": 1360,
    "Qh1#": 1361,
    "Nxc7+": 1362,
    "Nfxe4": 1363,
    "Rfxd2": 1364,
    "Rcc3": 1365,
    "Rdf2": 1366,
    "Rdf1": 1367,
    "Ndxe5": 1368,
    "Qxe8+": 1369,
    "Rf1#": 1370,
    "gxf2+": 1371,
    "Reb8": 1372,
    "Rba5": 1373,
    "R5a6": 1374,
    "Ned4": 1375,
    "Ncxd4": 1376,
    "Rh1+": 1377,
    "g6+": 1378,
    "g7+": 1379,
    "g8=Q#": 1380,
    "Qxg8": 1381,
    "Qh8": 1382,
    "Rxb8+": 1383,
    "Bg1": 1384,
    "R5g3": 1385,
    "Rhg3": 1386,
    "c1=Q": 1387,
    "Qb2+": 1388,
    "Nfxd5": 1389,
    "Rbf7": 1390,
    "Rfxf5": 1391,
    "Qa2+": 1392,
    "Rdf6": 1393,
    "Qf8#": 1394,
    "Nxc4+": 1395,
    "Nexd4": 1396,
    "Nhf3": 1397,
    "hxg7+": 1398,
    "Qce8#": 1399,
    "Rcxb4": 1400,
    "gxh6+": 1401,
    "Qxb2+": 1402,
    "Rff6": 1403,
    "Rde3": 1404,
    "R4b6": 1405,
    "d6+": 1406,
    "Qhd8#": 1407,
    "N7c6": 1408,
    "Kxa6": 1409,
    "Nxd8": 1410,
    "Nxh3+": 1411,
    "Qxb7+": 1412,
    "Ng2#": 1413,
    "exf2+": 1414,
    "Rexe2": 1415,
    "Red5": 1416,
    "Rdd7": 1417,
    "bxc3+": 1418,
    "Rexc3": 1419,
    "Nxg7+": 1420,
    "Nc8+": 1421,
    "Nde4": 1422,
    "Rdb7": 1423,
    "Rab2": 1424,
    "Ndxc5": 1425,
    "Qb1+": 1426,
    "fxg7+": 1427,
    "R5f2": 1428,
    "Rff5": 1429,
    "Rhg5": 1430,
    "Rcc6": 1431,
    "Rbb1": 1432,
    "Rdc8": 1433,
    "e6+": 1434,
    "Rce6": 1435,
    "Rec8": 1436,
    "N1d2": 1437,
    "Ned2": 1438,
    "Rbd8": 1439,
    "Nge4": 1440,
    "Ree3": 1441,
    "Ndb6": 1442,
    "Na8": 1443,
    "Rba4": 1444,
    "Rbd1": 1445,
    "Rdh8": 1446,
    "Qd1#": 1447,
    "Red7": 1448,
    "exf8=Q+": 1449,
    "Bf6+": 1450,
    "Nxf5+": 1451,
    "Nce7": 1452,
    "R3f5": 1453,
    "Rdf5": 1454,
    "R5f7": 1455,
    "Qh5#": 1456,
    "Rac7": 1457,
    "Rff2": 1458,
    "Rfc6": 1459,
    "R1d3+": 1460,
    "b1=N": 1461,
    "Nhxf6": 1462,
    "Rdb1": 1463,
    "Nxg1": 1464,
    "Ncxd5": 1465,
    "Nbxd5": 1466,
    "Nxd6+": 1467,
    "e7+": 1468,
    "Nf1+": 1469,
    "Ndxb5": 1470,
    "Qxd8#": 1471,
    "Qxa3+": 1472,
    "Bxa2+": 1473,
    "R8c4": 1474,
    "Kd6+": 1475,
    "Qxb1": 1476,
    "Nfe5": 1477,
    "Bxh3+": 1478,
    "Nxf4+": 1479,
    "Bxc8": 1480,
    "Rxh7+": 1481,
    "Ncxe4": 1482,
    "Nbxd4": 1483,
    "Rcf1": 1484,
    "Raf7": 1485,
    "Ndxf6": 1486,
    "R1d2": 1487,
    "Nxc2+": 1488,
    "R1c2": 1489,
    "Rfxc6": 1490,
    "N8d7": 1491,
    "exf4+": 1492,
    "Kc7+": 1493,
    "Bc8+": 1494,
    "f2": 1495,
    "f1=Q": 1496,
    "Qff8#": 1497,
    "Rxb7+": 1498,
    "Ree1": 1499,
    "Ncxd6": 1500,
    "Rxh2+": 1501,
    "Rh8#": 1502,
    "Bxb4+": 1503,
    "Rcb7": 1504,
    "Nxb4+": 1505,
    "Qxh7": 1506,
    "Nfxe5": 1507,
    "Qb4+": 1508,
    "Rbg1": 1509,
    "R1g2": 1510,
    "Reg6": 1511,
    "Re3#": 1512,
    "Nxg2": 1513,
    "Nhf5+": 1514,
    "gxf7": 1515,
    "c2+": 1516,
    "c1=Q+": 1517,
    "Rc2#": 1518,
    "e8=Q+": 1519,
    "Kxb6": 1520,
    "Nxa4+": 1521,
    "Rcc1": 1522,
    "b8=Q+": 1523,
    "g5#": 1524,
    "Rec4": 1525,
    "Rbb7": 1526,
    "Nhf1": 1527,
    "Rcxe4+": 1528,
    "R1e6": 1529,
    "Rfe6": 1530,
    "R6e7": 1531,
    "R2e3": 1532,
    "R3e7": 1533,
    "Rgf1": 1534,
    "Rd8#": 1535,
    "Nxg3+": 1536,
    "hxg2+": 1537,
    "Rg8#": 1538,
    "Rgc8": 1539,
    "R2c6": 1540,
    "R8c7": 1541,
    "dxc7": 1542,
    "Nbd8": 1543,
    "R4c2": 1544,
    "dxe3": 1545,
    "f5#": 1546,
    "Qf1+": 1547,
    "Rfe7": 1548,
    "Bc2+": 1549,
    "Qa6#": 1550,
    "Ncxe5": 1551,
    "Nge5+": 1552,
    "Rfxf4": 1553,
    "Bxg8": 1554,
    "Nh5+": 1555,
    "Nce4": 1556,
    "Ngxe6": 1557,
    "Bf3+": 1558,
    "c8=Q": 1559,
    "Bh4+": 1560,
    "Bxg1": 1561,
    "Nxc6+": 1562,
    "Nef6": 1563,
    "gxf7+": 1564,
    "Raf6": 1565,
    "Nh7+": 1566,
    "Nxc8+": 1567,
    "Rhxc5": 1568,
    "R8c3": 1569,
    "Raa7": 1570,
    "Qxd7#": 1571,
    "Nhf4": 1572,
    "Qf7#": 1573,
    "Qxd6+": 1574,
    "Ndb5": 1575,
    "Ncb4": 1576,
    "R1b5": 1577,
    "Qxc6+": 1578,
    "R7d6+": 1579,
    "Bb7+": 1580,
    "g8=Q+": 1581,
    "Ngf4": 1582,
    "Rad1+": 1583,
    "Bc6+": 1584,
    "Rdf4": 1585,
    "R4f2": 1586,
    "Bxg5+": 1587,
    "Qxb2#": 1588,
    "Qxg8+": 1589,
    "Rfxc8": 1590,
    "Ncxd7": 1591,
    "a5+": 1592,
    "Nxh5+": 1593,
    "Nf3#": 1594,
    "Rcc8": 1595,
    "Qg1": 1596,
    "Qa8#": 1597,
    "Rde2": 1598,
    "Nxb8": 1599,
    "Qg8+": 1600,
    "Nxf8+": 1601,
    "Rexd8": 1602,
    "N6d5": 1603,
    "Rfxe6": 1604,
    "Qa1#": 1605,
    "Kxe1": 1606,
    "Nxd1+": 1607,
    "Reh1": 1608,
    "Na2+": 1609,
    "Rfxe5": 1610,
    "R5e6": 1611,
    "d8=N+": 1612,
    "Rhb8": 1613,
    "Raa1": 1614,
    "R8c6": 1615,
    "Nbd1": 1616,
    "Nc1+": 1617,
    "axb6+": 1618,
    "Qxc2#": 1619,
    "Bg3+": 1620,
    "Kxc1": 1621,
    "Rxh3+": 1622,
    "Rh5#": 1623,
    "N6d7": 1624,
    "hxg3+": 1625,
    "Rfxc1": 1626,
    "Reh8": 1627,
    "Rag8": 1628,
    "Nxg6+": 1629,
    "Rec7": 1630,
    "Bxb3+": 1631,
    "Rbb6": 1632,
    "Nxg2+": 1633,
    "O-O-O+": 1634,
    "Qxc8+": 1635,
    "Bxe7+": 1636,
    "bxc2": 1637,
    "f3+": 1638,
    "Kxa8": 1639,
    "Qg6#": 1640,
    "Rcf8": 1641,
    "R5c2": 1642,
    "axb5+": 1643,
    "Be1+": 1644,
    "Bxf3+": 1645,
    "Bg1+": 1646,
    "Be2+": 1647,
    "Reg8": 1648,
    "Rcxb2": 1649,
    "Nb2+": 1650,
    "Nde6": 1651,
    "Bh3+": 1652,
    "Nxb7+": 1653,
    "Bf6#": 1654,
    "N3h4": 1655,
    "gxf3+": 1656,
    "cxb8=Q+": 1657,
    "bxa4+": 1658,
    "Ngf8": 1659,
    "Kf4+": 1660,
    "c8=Q+": 1661,
    "Bxh5+": 1662,
    "exd3+": 1663,
    "dxc2": 1664,
    "Rgh6": 1665,
    "Qe8#": 1666,
    "cxd7": 1667,
    "Rge1": 1668,
    "c6+": 1669,
    "Red3": 1670,
    "Bg6+": 1671,
    "Bxc4+": 1672,
    "Rfa1": 1673,
    "Raa2": 1674,
    "Rhd2": 1675,
    "Raf2#": 1676,
    "Nec3": 1677,
    "Rae7": 1678,
    "Rexf2": 1679,
    "R8f4+": 1680,
    "R8xc4": 1681,
    "Qh7#": 1682,
    "Rec2": 1683,
    "cxd3+": 1684,
    "Rgd1": 1685,
    "exf3+": 1686,
    "dxe4+": 1687,
    "Rcd5": 1688,
    "Ba5+": 1689,
    "N6e7": 1690,
    "Nfe7": 1691,
    "Ngxf6": 1692,
    "Bg4+": 1693,
    "Bxe8+": 1694,
    "Rxa2#": 1695,
    "Nhxf5": 1696,
    "Bxg3+": 1697,
    "Rdf8": 1698,
    "Rgg5": 1699,
    "Red2": 1700,
    "Nec6": 1701,
    "fxg6+": 1702,
    "Qb5#": 1703,
    "Qxb5+": 1704,
    "Nd8+": 1705,
    "Raxc8": 1706,
    "Rhb1": 1707,
    "Ncb6": 1708,
    "N7b6": 1709,
    "Rhh8": 1710,
    "Rgh8": 1711,
    "N5c3": 1712,
    "Ree7": 1713,
    "Rbd7": 1714,
    "R7d6": 1715,
    "R6d5": 1716,
    "Rdxf5": 1717,
    "R4f6+": 1718,
    "Rg5#": 1719,
    "Rfxf2": 1720,
    "dxc5+": 1721,
    "N3g4": 1722,
    "Bg7+": 1723,
    "Bf8+": 1724,
    "Qbd6+": 1725,
    "Q8f6+": 1726,
    "Rxe2#": 1727,
    "R5b6": 1728,
    "Rag7+": 1729,
    "R8d4": 1730,
    "Rfb5": 1731,
    "R7b6": 1732,
    "Rbb3": 1733,
    "Rbe3+": 1734,
    "Rbd6": 1735,
    "Bxd8+": 1736,
    "Rgd3": 1737,
    "R1d7+": 1738,
    "Nef4": 1739,
    "Rdxd6+": 1740,
    "Nf7#": 1741,
    "Ngxe5": 1742,
    "Rhh1": 1743,
    "Rhf1+": 1744,
    "Qg1#": 1745,
    "Raxa6": 1746,
    "Rah8": 1747,
    "R1h2+": 1748,
    "Rca1": 1749,
    "R1a4": 1750,
    "Kf8+": 1751,
    "Bc3+": 1752,
    "R6c3": 1753,
    "exd2": 1754,
    "Qxb7#": 1755,
    "bxa6+": 1756,
    "Rfxb1": 1757,
    "Qxf8+": 1758,
    "f8=Q#": 1759,
    "N8c6": 1760,
    "Nfd4": 1761,
    "Nde3": 1762,
    "Qee4#": 1763,
    "Bxf4+": 1764,
    "Nce3": 1765,
    "Nde7+": 1766,
    "d1=Q": 1767,
    "Raxd8": 1768,
    "Ref1": 1769,
    "Nexd6": 1770,
    "Rexe8+": 1771,
    "Nef5": 1772,
    "N6b5": 1773,
    "dxc1=Q": 1774,
    "Nfg5+": 1775,
    "Nxg5+": 1776,
    "Qh3#": 1777,
    "R3d2": 1778,
    "gxh4+": 1779,
    "Nbxc5": 1780,
    "fxe5+": 1781,
    "Rxc6+": 1782,
    "Re8#": 1783,
    "Qxg2#": 1784,
    "Nfe2": 1785,
    "Nfh5": 1786,
    "Qxf8#": 1787,
    "Rb8#": 1788,
    "Rcd2": 1789,
    "fxe2": 1790,
    "Qe6#": 1791,
    "Rhg6": 1792,
    "R1f2": 1793,
    "Qa7#": 1794,
    "cxd4+": 1795,
    "Nxa8+": 1796,
    "Qg3#": 1797,
    "Nfg5": 1798,
    "Ngf5": 1799,
    "N7d5": 1800,
    "N3d5": 1801,
    "R8d3": 1802,
    "Nfe1": 1803,
    "Qb6#": 1804,
    "d1=Q+": 1805,
    "Rfxe8": 1806,
    "Rfg6": 1807,
    "Rhxg8": 1808,
    "Rge8+": 1809,
    "Rah2": 1810,
    "Nxg1+": 1811,
    "bxc7+": 1812,
    "fxg3+": 1813,
    "gxf2": 1814,
    "dxe3+": 1815,
    "Rbxd5": 1816,
    "Rad2": 1817,
    "R3xd7": 1818,
    "R8d5": 1819,
    "R3d4+": 1820,
    "Rbh8": 1821,
    "Rhe7": 1822,
    "fxe7": 1823,
    "Rfb2": 1824,
    "R1b3": 1825,
    "R4b2+": 1826,
    "Rbf8": 1827,
    "Qc2#": 1828,
    "N3d2": 1829,
    "Red6": 1830,
    "Rdxc1": 1831,
    "R2d3": 1832,
    "R1c7": 1833,
    "Rdb6": 1834,
    "R8a4": 1835,
    "Nfxh5": 1836,
    "Rfc2": 1837,
    "Rdc2": 1838,
    "Neg4": 1839,
    "Rah1": 1840,
    "dxe6+": 1841,
    "Rhxh5": 1842,
    "Rdxe7": 1843,
    "Ngxe4": 1844,
    "dxc6+": 1845,
    "Rhe5": 1846,
    "Rxe2+": 1847,
    "R8e3": 1848,
    "Rbxb2+": 1849,
    "Reb2+": 1850,
    "Rab2+": 1851,
    "N5xd4": 1852,
    "Rge2": 1853,
    "Qxf7#": 1854,
    "Qe4#": 1855,
    "a6+": 1856,
    "Bxb7+": 1857,
    "gxh7": 1858,
    "Ncd8": 1859,
    "Ngxf5": 1860,
    "Qxh1+": 1861,
    "Rxd2#": 1862,
    "Bxg2#": 1863,
    "Bxd3+": 1864,
    "Rha1": 1865,
    "Nb1+": 1866,
    "Rfh4": 1867,
    "R7h5": 1868,
    "Qd3#": 1869,
    "Rcxa6": 1870,
    "Qxa6+": 1871,
    "Rfxd1": 1872,
    "Raf2+": 1873,
    "R8e6": 1874,
    "Rae4": 1875,
    "Nxd7+": 1876,
    "Kc3+": 1877,
    "Ncb3": 1878,
    "Raf2": 1879,
    "Ndc6": 1880,
    "N5xc4": 1881,
    "Qxa4+": 1882,
    "Qxg1": 1883,
    "Qxg1+": 1884,
    "Rfg8": 1885,
    "bxc6+": 1886,
    "cxb4+": 1887,
    "gxh8=Q": 1888,
    "Qxa3#": 1889,
    "Rcb8": 1890,
    "Qxf2#": 1891,
    "Ree2": 1892,
    "Rea7": 1893,
    "Bd1+": 1894,
    "Nxb5+": 1895,
    "Rdxd5": 1896,
    "N5g6": 1897,
    "Ngh4": 1898,
    "R5f6": 1899,
    "Rde4": 1900,
    "Nbd3": 1901,
    "Qh2#": 1902,
    "Rde5": 1903,
    "Qxe5#": 1904,
    "Rce2": 1905,
    "Qxg3#": 1906,
    "Rde7+": 1907,
    "N2g3": 1908,
    "Rxh8+": 1909,
    "Qfxg3+": 1910,
    "Bc1+": 1911,
    "Bd2+": 1912,
    "Bxf8+": 1913,
    "Nh2+": 1914,
    "Qaa4": 1915,
    "Qbb3": 1916,
    "Qac4+": 1917,
    "Qbd3+": 1918,
    "Qce4+": 1919,
    "Qdf3+": 1920,
    "Qeg4+": 1921,
    "Qfh3#": 1922,
    "Ndxc4": 1923,
    "Qh1": 1924,
    "Nab4": 1925,
    "gxh2": 1926,
    "Rbg8": 1927,
    "Bxh4+": 1928,
    "Rbxb2": 1929,
    "Rbc7": 1930,
    "Rac2": 1931,
    "N3xf4": 1932,
    "Bg2+": 1933,
    "Re1#": 1934,
    "R1e5": 1935,
    "Nfh6+": 1936,
    "N7e5": 1937,
    "exd6+": 1938,
    "Rff7": 1939,
    "Rcc5": 1940,
    "Rgc1": 1941,
    "Na6+": 1942,
    "R8xa6": 1943,
    "dxe8=Q+": 1944,
    "R8a3": 1945,
    "R6a3": 1946,
    "Ree8": 1947,
    "Rgc2": 1948,
    "R2c4": 1949,
    "R4c5": 1950,
    "R7c6": 1951,
    "Nxc1+": 1952,
    "R6g7": 1953,
    "Ref2": 1954,
    "Qfa7#": 1955,
    "Rhxe8": 1956,
    "fxe3+": 1957,
    "Rg7#": 1958,
    "R8d7": 1959,
    "Rfxf7": 1960,
    "a1=Q#": 1961,
    "Rfxd8": 1962,
    "Rc1#": 1963,
    "Nfxd4": 1964,
    "Qh8#": 1965,
    "R4xb5": 1966,
    "R1h7+": 1967,
    "axb2+": 1968,
    "Qc3#": 1969,
    "R1xb2": 1970,
    "Rfc8+": 1971,
    "b4#": 1972,
    "Rhd6": 1973,
    "Rab6+": 1974,
    "Rbb8": 1975,
    "R7a6": 1976,
    "N4g5": 1977,
    "Nef3": 1978,
    "Rexd1": 1979,
    "Rea3": 1980,
    "Ndxb6": 1981,
    "R6g5": 1982,
    "Kg2+": 1983,
    "f2+": 1984,
    "Bxc1+": 1985,
    "Rea8": 1986,
    "e2+": 1987,
    "e1=Q+": 1988,
    "Rg1#": 1989,
    "R4xb6": 1990,
    "gxf5+": 1991,
    "Ned3": 1992,
    "Nxa3+": 1993,
    "Rgg8": 1994,
    "N1e2": 1995,
    "Qxa2+": 1996,
    "R6d3": 1997,
    "Rch8": 1998,
    "Rgb5": 1999,
    "Rhh7": 2000,
    "Rfg5": 2001,
    "Rcxd4": 2002,
    "N5b6": 2003,
    "Nfe6": 2004,
    "exd4+": 2005,
    "Rd5#": 2006,
    "Qe7#": 2007,
    "Nh6#": 2008,
    "fxe6+": 2009,
    "Kf6+": 2010,
    "Nac1": 2011,
    "Nec1": 2012,
    "Rb5#": 2013,
    "Rge6": 2014,
    "Rexg6": 2015,
    "Rbe3": 2016,
    "dxe2": 2017,
    "Bxa6+": 2018,
    "Na3+": 2019,
    "Rgg2": 2020,
    "Nbc5": 2021,
    "Rca3": 2022,
    "R7a3+": 2023,
    "Rh3#": 2024,
    "R1a2": 2025,
    "R2a7": 2026,
    "Raxc1": 2027,
    "N8f7": 2028,
    "Rxf8#": 2029,
    "axb4+": 2030,
    "Rbxd3": 2031,
    "Nhxf7": 2032,
    "exd7": 2033,
    "Rhxd7": 2034,
    "Rdf7": 2035,
    "R6f7": 2036,
    "R4d2": 2037,
    "Reg7": 2038,
    "N5c6": 2039,
    "Rbc2": 2040,
    "Qd2#": 2041,
    "Ra1#": 2042,
    "Ndf5+": 2043,
    "a7+": 2044,
    "Qff7+": 2045,
    "Qee8#": 2046,
    "Qxf1#": 2047,
    "Rae5": 2048,
    "Rexe4": 2049,
    "Nec4": 2050,
    "Ncd6": 2051,
    "Nf6#": 2052,
    "Ncxa5": 2053,
    "R4d5": 2054,
    "Be6#": 2055,
    "Nbc7": 2056,
    "Rhe8+": 2057,
    "Qc6#": 2058,
    "exf2": 2059,
    "Nac7": 2060,
    "R4h5": 2061,
    "Qe2#": 2062,
    "Rea1": 2063,
    "R4a2": 2064,
    "Rbe5": 2065,
    "Rde7": 2066,
    "R7e5": 2067,
    "Qxa5+": 2068,
    "Qhg7": 2069,
    "Qgg5": 2070,
    "Qgd4+": 2071,
    "Q6b4+": 2072,
    "Qdd2#": 2073,
    "Rab7": 2074,
    "Rgc7": 2075,
    "Kd4+": 2076,
    "Rhd5": 2077,
    "a1=Q+": 2078,
    "Rbxa1": 2079,
    "R1a7": 2080,
    "Nexg4": 2081,
    "Rdg3": 2082,
    "Nab1": 2083,
    "Reg2": 2084,
    "Rfg7": 2085,
    "Rgh2": 2086,
    "Rgf8+": 2087,
    "bxc5+": 2088,
    "Bb2+": 2089,
    "R6h4": 2090,
    "R1h3+": 2091,
    "Rhe3": 2092,
    "R2h3": 2093,
    "Rcxc3+": 2094,
    "Rdc3": 2095,
    "Qee3+": 2096,
    "Nxe1+": 2097,
    "e2#": 2098,
    "Ndf4": 2099,
    "Rdd3": 2100,
    "Rgd8": 2101,
    "Rfc7": 2102,
    "Rh6#": 2103,
    "Rdxh6": 2104,
    "N4d3": 2105,
    "Nxe8+": 2106,
    "Rh4#": 2107,
    "R8d2": 2108,
    "R1d4+": 2109,
    "Nfxg4": 2110,
    "R8f7+": 2111,
    "R1f3": 2112,
    "Rhh2": 2113,
    "Rhe2#": 2114,
    "Naxc4": 2115,
    "Rhxf1": 2116,
    "R1xb5": 2117,
    "Rexb2": 2118,
    "Nab3": 2119,
    "Rdxc4": 2120,
    "Rcxd5": 2121,
    "R5d4": 2122,
    "dxe1=Q": 2123,
    "Nxa7+": 2124,
    "Rhf2": 2125,
    "dxc3+": 2126,
    "Qxa8+": 2127,
    "Qge1+": 2128,
    "Qcxe5+": 2129,
    "Rfxd5": 2130,
    "Qef2+": 2131,
    "Rexd7": 2132,
    "Qb8#": 2133,
    "R8g2+": 2134,
    "Rfd7": 2135,
    "Be8+": 2136,
    "Bg8+": 2137,
    "Ra6#": 2138,
    "R5d7": 2139,
    "Rcc4": 2140,
    "Ra3#": 2141,
    "Rbxc7": 2142,
    "axb3+": 2143,
    "R4c7": 2144,
    "Ngf3+": 2145,
    "Rec3": 2146,
    "R3c2": 2147,
    "R5c6": 2148,
    "Bxa5+": 2149,
    "a8=N": 2150,
    "Neg4+": 2151,
    "Nhg8": 2152,
    "N3c4": 2153,
    "Rbf4": 2154,
    "Rxb7#": 2155,
    "Rha8": 2156,
    "Rhg1+": 2157,
    "Rcxb6": 2158,
    "Rbe2+": 2159,
    "Nxf2#": 2160,
    "Rc8#": 2161,
    "Rhc1+": 2162,
    "N5d3": 2163,
    "Rca8": 2164,
    "g6#": 2165,
    "Rbxd8": 2166,
    "Nbxc4": 2167,
    "N2c3": 2168,
    "Rbxc6": 2169,
    "R1e4": 2170,
    "R5d3": 2171,
    "Nge6": 2172,
    "Rbxb7": 2173,
    "Bxf1+": 2174,
    "R8b7": 2175,
    "Raxb7": 2176,
    "axb7": 2177,
    "Qd8#": 2178,
    "Nfd1": 2179,
    "Raxb8": 2180,
    "Nfxd7": 2181,
    "Rda1": 2182,
    "Nca7": 2183,
    "a2+": 2184,
    "Nb3#": 2185,
    "f1=Q+": 2186,
    "Naxc5": 2187,
    "R3d6": 2188,
    "Kg8+": 2189,
    "Qxa1+": 2190,
    "Qb7#": 2191,
    "Rac3": 2192,
    "Rdxb8": 2193,
    "R2b3": 2194,
    "Rfa3": 2195,
    "R3a5": 2196,
    "Rfe2": 2197,
    "Rbe7": 2198,
    "Rxf1#": 2199,
    "R7f2": 2200,
    "Bxg4+": 2201,
    "Rfd2": 2202,
    "Nexg5": 2203,
    "Nce6+": 2204,
    "b7+": 2205,
    "R1a6": 2206,
    "Qf2#": 2207,
    "Bb1+": 2208,
    "Kf5+": 2209,
    "Qe1#": 2210,
    "Qa4#": 2211,
    "Ndxf7": 2212,
    "Ba7+": 2213,
    "R7d5": 2214,
    "Rfe8+": 2215,
    "Kxf2+": 2216,
    "R8g5": 2217,
    "dxc8=Q+": 2218,
    "Qc1#": 2219,
    "cxd5+": 2220,
    "exd7+": 2221,
    "Nxh4+": 2222,
    "Rdc6": 2223,
    "R1e3": 2224,
    "bxc7": 2225,
    "R8xe3": 2226,
    "Rfxg7": 2227,
    "Be7+": 2228,
    "Ngxe2": 2229,
    "R8a7": 2230,
    "Rbxe6": 2231,
    "Ngh6": 2232,
    "R2c7": 2233,
    "R6d4": 2234,
    "R1xd2": 2235,
    "Nexc4": 2236,
    "Qg4#": 2237,
    "Nab8": 2238,
    "N4e5": 2239,
    "R8h6+": 2240,
    "R6h5": 2241,
    "R8xb3": 2242,
    "Rbxh3": 2243,
    "Rha6": 2244,
    "R6a2": 2245,
    "Nexd5": 2246,
    "R1c6": 2247,
    "Raa4": 2248,
    "Ke3+": 2249,
    "Ned3+": 2250,
    "Qhe4": 2251,
    "Qd4#": 2252,
    "Ndf8": 2253,
    "Nca6": 2254,
    "Rf7#": 2255,
    "Qge3": 2256,
    "Q3c1+": 2257,
    "Qca3#": 2258,
    "bxa2": 2259,
    "Rxc8#": 2260,
    "Rgg1": 2261,
    "Nge8": 2262,
    "Nec7": 2263,
    "Rhf2#": 2264,
    "Rcg7": 2265,
    "R2g6": 2266,
    "Ncxe4+": 2267,
    "Rcxd1": 2268,
    "Raxa4": 2269,
    "R4e2": 2270,
    "Naxc3": 2271,
    "Reb6": 2272,
    "Rcd4": 2273,
    "Qhd4+": 2274,
    "Rdd6": 2275,
    "Reg1": 2276,
    "Ncd3": 2277,
    "fxe8=N+": 2278,
    "Rhg8+": 2279,
    "Raf8+": 2280,
    "Rgxg5": 2281,
    "Rfb7": 2282,
    "Rba8": 2283,
    "Nba6": 2284,
    "N2f4": 2285,
    "Rff3": 2286,
    "N2d4": 2287,
    "R5e3": 2288,
    "Bf4#": 2289,
    "Nce8": 2290,
    "R7xe5": 2291,
    "Rda7": 2292,
    "b6+": 2293,
    "Nge3": 2294,
    "Nef8": 2295,
    "Ndf5": 2296,
    "Nfxe3": 2297,
    "Rcxf7": 2298,
    "Rc7#": 2299,
    "Nfd3+": 2300,
    "Rcxc3": 2301,
    "bxc4+": 2302,
    "N3e2": 2303,
    "Rfa7": 2304,
    "N7a6": 2305,
    "Rbd2": 2306,
    "Rfxh7+": 2307,
    "Rfxd7": 2308,
    "Nexf6": 2309,
    "Rhf6": 2310,
    "Rfh6": 2311,
    "Rba3": 2312,
    "Nxh1+": 2313,
    "Rfe7+": 2314,
    "R4f3": 2315,
    "Naxb3": 2316,
    "Rfe3": 2317,
    "Rhg2": 2318,
    "Rcd6": 2319,
    "Rbg1+": 2320,
    "Rgg4": 2321,
    "N3d4": 2322,
    "dxc4+": 2323,
    "R2d4": 2324,
    "Rgd6": 2325,
    "Rgxg2+": 2326,
    "Rgxg2": 2327,
    "Qh4#": 2328,
    "Rexc7": 2329,
    "Ng3#": 2330,
    "R4c6": 2331,
    "R6c7": 2332,
    "Rbc4": 2333,
    "Kd2+": 2334,
    "Qbe8+": 2335,
    "Qcxe4": 2336,
    "R8xa3": 2337,
    "R8xg7": 2338,
    "Qc7#": 2339,
    "N8a6": 2340,
    "Nc7#": 2341,
    "Rff1": 2342,
    "Rhb1+": 2343,
    "R6e3": 2344,
    "Raxe3+": 2345,
    "N6xb5": 2346,
    "Nfg4+": 2347,
    "Raxa2": 2348,
    "Qxc6#": 2349,
    "gxf8=Q+": 2350,
    "Nhf8": 2351,
    "Ncxe2": 2352,
    "R8h7": 2353,
    "hxg1=Q": 2354,
    "Ndc3": 2355,
    "Nb8+": 2356,
    "axb7+": 2357,
    "c7+": 2358,
    "Qcg4#": 2359,
    "Rbxd6": 2360,
    "R1d5": 2361,
    "Kb6#": 2362,
    "Qg5#": 2363,
    "Nfxg6": 2364,
    "Kd3+": 2365,
    "Kh5+": 2366,
    "Nxh2+": 2367,
    "Bxa3+": 2368,
    "Ref7": 2369,
    "R3f2": 2370,
    "Rad7": 2371,
    "Rdg3+": 2372,
    "Ndb4+": 2373,
    "Qhh3#": 2374,
    "Qge6+": 2375,
    "Qcc1+": 2376,
    "Qcd2+": 2377,
    "Qee1#": 2378,
    "Rdxd2": 2379,
    "Nbc1": 2380,
    "Nexf4": 2381,
    "Bxe1+": 2382,
    "Qxg4#": 2383,
    "Nc5#": 2384,
    "Rff4": 2385,
    "Rfxh6": 2386,
    "Nbxc6": 2387,
    "Rhxh7": 2388,
    "Qxh6#": 2389,
    "R5c3": 2390,
    "Qa3#": 2391,
    "Nhg5+": 2392,
    "Rdc4": 2393,
    "Bf3#": 2394,
    "Rexe5": 2395,
    "N4f3": 2396,
    "Rbe4": 2397,
    "Bxg5#": 2398,
    "Nfxd2": 2399,
    "cxd1=Q": 2400,
    "R6d2": 2401,
    "Rgf7": 2402,
    "gxh2+": 2403,
    "Rgf4": 2404,
    "Rfe4": 2405,
    "R6c4": 2406,
    "N6h5": 2407,
    "Rac6": 2408,
    "Rgd2": 2409,
    "R5c7": 2410,
    "Qec3+": 2411,
    "Qaa5#": 2412,
    "dxc8=Q": 2413,
    "bxa1=Q": 2414,
    "Qcd3": 2415,
    "Q1c3": 2416,
    "Q3c2": 2417,
    "Bd8+": 2418,
    "Ng8+": 2419,
    "R8xc7": 2420,
    "R8f4": 2421,
    "Rcg8": 2422,
    "Qxd3#": 2423,
    "Rhxh3#": 2424,
    "Kc1+": 2425,
    "Kxa1": 2426,
    "R2d7+": 2427,
    "Rgf2+": 2428,
    "Rae2+": 2429,
    "R2e7+": 2430,
    "N8e7": 2431,
    "Rfc3": 2432,
    "Rhc3": 2433,
    "Raxe1": 2434,
    "R6d7": 2435,
    "Nbd3+": 2436,
    "Nfd3": 2437,
    "Kh1+": 2438,
    "R4f5": 2439,
    "N5d4": 2440,
    "Rcxd3": 2441,
    "Rd1#": 2442,
    "R1h2": 2443,
    "Rhh6": 2444,
    "Ref6": 2445,
    "Rhd6+": 2446,
    "Nc4#": 2447,
    "Rba1": 2448,
    "N6d4": 2449,
    "R1c5": 2450,
    "Nxf2+": 2451,
    "Ncxe7": 2452,
    "Rxd8#": 2453,
    "Raxc6": 2454,
    "R8xe7": 2455,
    "Ne2#": 2456,
    "Qad4": 2457,
    "Qdf8#": 2458,
    "Rbb5": 2459,
    "b2#": 2460,
    "Rdf3": 2461,
    "Ba2+": 2462,
    "Kb2+": 2463,
    "Nexc3": 2464,
    "Rgg7": 2465,
    "Rcg7+": 2466,
    "cxd2": 2467,
    "R3c6+": 2468,
    "R8e5": 2469,
    "R5e2+": 2470,
    "Nec8": 2471,
    "Rhxf8": 2472,
    "R3h2": 2473,
    "h8=N": 2474,
    "fxg2+": 2475,
    "R1e5+": 2476,
    "Rxg1#": 2477,
    "R4d3": 2478,
    "N4a5": 2479,
    "Nac6": 2480,
    "Qfb1#": 2481,
    "Rbxc1": 2482,
    "Rag8+": 2483,
    "h4#": 2484,
    "Rcxc2": 2485,
    "Nexf4+": 2486,
    "Rgxg6+": 2487,
    "Rcg1+": 2488,
    "Ndf3+": 2489,
    "N2e4": 2490,
    "Rfe1+": 2491,
    "Rch4": 2492,
    "Qxd5#": 2493,
    "R5xa4": 2494,
    "R4e6+": 2495,
    "Rdd5": 2496,
    "Rge5": 2497,
    "Rde6": 2498,
    "R6e5": 2499,
    "Rce3": 2500,
    "Reb4": 2501,
    "Qgg7+": 2502,
    "Qge5": 2503,
    "Q5d6+": 2504,
    "Qec7": 2505,
    "Qca7#": 2506,
    "Rfxd4": 2507,
    "R5d2": 2508,
    "Bxg8+": 2509,
    "R3c7": 2510,
    "Rf8#": 2511,
    "Nexc6": 2512,
    "Bd2#": 2513,
    "fxe1=Q+": 2514,
    "Qdb6": 2515,
    "Q6f2": 2516,
    "Qfe2": 2517,
    "Qce2": 2518,
    "Qbb2": 2519,
    "Qcf3": 2520,
    "Qff2": 2521,
    "Qff3": 2522,
    "R5e2": 2523,
    "Kf3+": 2524,
    "Raxe5+": 2525,
    "Rgf6": 2526,
    "Rxg7#": 2527,
    "Rhf4": 2528,
    "R6f5": 2529,
    "Nab5": 2530,
    "Rba2": 2531,
    "Ne5#": 2532,
    "Rexe7": 2533,
    "Rxg8#": 2534,
    "Kh3+": 2535,
    "exf8=Q#": 2536,
    "Reb5": 2537,
    "R1b4": 2538,
    "R5h4": 2539,
    "R1h3": 2540,
    "Rge7": 2541,
    "exd8=Q": 2542,
    "Qff6+": 2543,
    "g2#": 2544,
    "Be5#": 2545,
    "N6h7": 2546,
    "R4e5": 2547,
    "Ned5": 2548,
    "R1a3": 2549,
    "Qb4#": 2550,
    "R5a2": 2551,
    "R5a4": 2552,
    "R5e7": 2553,
    "b1=Q#": 2554,
    "Rcxc7+": 2555,
    "Ngh3": 2556,
    "Qaa5": 2557,
    "Qbb6": 2558,
    "Qaa7": 2559,
    "Qxh2#": 2560,
    "R7e3": 2561,
    "R1e7": 2562,
    "Rhxe6": 2563,
    "Qxb6#": 2564,
    "Nbc6+": 2565,
    "Rxc1#": 2566,
    "Ndb2": 2567,
    "R2e7": 2568,
    "Rhxh5+": 2569,
    "R3a2": 2570,
    "R8g6": 2571,
    "Nd6#": 2572,
    "Ngh5": 2573,
    "Ndb1": 2574,
    "R8a2": 2575,
    "Rgf3": 2576,
    "Qf4#": 2577,
    "Rfa2": 2578,
    "R4d6": 2579,
    "Bxf7#": 2580,
    "Nxa2+": 2581,
    "Kxb6+": 2582,
    "R6xd4": 2583,
    "Kb6+": 2584,
    "Qc5#": 2585,
    "R7xd4": 2586,
    "Rfxf2+": 2587,
    "Rdxg6": 2588,
    "R4g6+": 2589,
    "g4#": 2590,
    "Nab6": 2591,
    "fxe1=Q": 2592,
    "Nfxd1": 2593,
    "Rcf2": 2594,
    "Rexf6": 2595,
    "Rxe8#": 2596,
    "Rgxg3": 2597,
    "Rdxc3": 2598,
    "N2d3": 2599,
    "Rae3+": 2600,
    "Ref5": 2601,
    "Rdh7": 2602,
    "Rgxg6": 2603,
    "Rf6#": 2604,
    "exf1=Q+": 2605,
    "Ke8+": 2606,
    "R8g7": 2607,
    "Rexc2": 2608,
    "h1=R": 2609,
    "Qeh5+": 2610,
    "Q1f3#": 2611,
    "cxd8=Q": 2612,
    "bxc1=Q#": 2613,
    "Nde1": 2614,
    "N5f3": 2615,
    "Qdd2+": 2616,
    "N3g5+": 2617,
    "Rfxg6+": 2618,
    "R1xh7+": 2619,
    "N6xd5": 2620,
    "R7c4": 2621,
    "R8d3+": 2622,
    "Raxe7": 2623,
    "R7e6+": 2624,
    "Nba3": 2625,
    "Be4#": 2626,
    "Ndxb1": 2627,
    "Ndc4": 2628,
    "Rexe6": 2629,
    "Nfd6+": 2630,
    "Nbd6+": 2631,
    "Rdxf1": 2632,
    "f3#": 2633,
    "R2c3": 2634,
    "R3h4": 2635,
    "Rhd4": 2636,
    "Rdd4": 2637,
    "Rbd4": 2638,
    "Bd3#": 2639,
    "N6g5": 2640,
    "Nhf2+": 2641,
    "N4a6": 2642,
    "Bd6#": 2643,
    "e3#": 2644,
    "Rgb3": 2645,
    "Rhg7+": 2646,
    "Qhh5+": 2647,
    "Rad4": 2648,
    "Ke4+": 2649,
    "R2e6": 2650,
    "Rfxg5": 2651,
    "Ref4": 2652,
    "Reg5": 2653,
    "Rfxe2": 2654,
    "Ndxb8": 2655,
    "Rf4#": 2656,
    "Nfe4+": 2657,
    "Qdf6+": 2658,
    "Q1f5#": 2659,
    "Rbd3": 2660,
    "R6b2": 2661,
    "R6xc2": 2662,
    "bxc1=Q": 2663,
    "Rdxe4": 2664,
    "Bxb8+": 2665,
    "R5xd6": 2666,
    "Rdf6+": 2667,
    "Ne6#": 2668,
    "Qxe8#": 2669,
    "Nce6": 2670,
    "Nexf7": 2671,
    "Nhg5": 2672,
    "Rgxf6+": 2673,
    "Qaa6+": 2674,
    "Qbb5+": 2675,
    "Qaa4+": 2676,
    "Qbb3+": 2677,
    "Qaa2+": 2678,
    "Qbb1#": 2679,
    "Rgf6+": 2680,
    "Rbe6": 2681,
    "Rgh1": 2682,
    "R5h3": 2683,
    "Rhxg4+": 2684,
    "exf8=Q": 2685,
    "Rfd5": 2686,
    "Rab5": 2687,
    "Ndf2": 2688,
    "Nh3#": 2689,
    "Qc8#": 2690,
    "Rfd3": 2691,
    "Nh8+": 2692,
    "Rdxf6": 2693,
    "Nef3+": 2694,
    "Ra2#": 2695,
    "O-O+": 2696,
    "R5h2": 2697,
    "Nca4": 2698,
    "Nbc8": 2699,
    "Bxc8+": 2700,
    "R1g3": 2701,
    "Rdf8+": 2702,
    "Ne3#": 2703,
    "Ncxe6": 2704,
    "Ndc2": 2705,
    "R8xb6": 2706,
    "Ndf1": 2707,
    "Ngh2": 2708,
    "Qxh5#": 2709,
    "Qxg5#": 2710,
    "Reg4": 2711,
    "Reb7": 2712,
    "R1f5+": 2713,
    "Rgxh4": 2714,
    "R8xb5": 2715,
    "Rfxf6": 2716,
    "Qxh3#": 2717,
    "R3xd2": 2718,
    "Rgd4": 2719,
    "N4d5": 2720,
    "R1c3": 2721,
    "Nfxe6+": 2722,
    "Rhxh2": 2723,
    "Rga8": 2724,
    "Rcxd8": 2725,
    "Ngf1": 2726,
    "Rfxc5": 2727,
    "Nba4": 2728,
    "R4a6": 2729,
    "R6a7": 2730,
    "Rbc5": 2731,
    "R3a7": 2732,
    "Rexe3": 2733,
    "Rbxe2+": 2734,
    "Rgf5": 2735,
    "R1d4": 2736,
    "N6e4": 2737,
    "Ncxe7+": 2738,
    "Rah6": 2739,
    "R6h7": 2740,
    "Nef7": 2741,
    "Rhxf5+": 2742,
    "Rad6+": 2743,
    "Rdg6": 2744,
    "Bxb6+": 2745,
    "h3#": 2746,
    "N1e2+": 2747,
    "R6a4": 2748,
    "Qff6": 2749,
    "Qgd3+": 2750,
    "Rdxg4+": 2751,
    "Neg3": 2752,
    "Rfg2": 2753,
    "Qxd2#": 2754,
    "Rdxh4": 2755,
    "R4f6": 2756,
    "bxc2+": 2757,
    "Qcb5": 2758,
    "Qed6": 2759,
    "Qdc7": 2760,
    "Qcf3+": 2761,
    "Qef5": 2762,
    "Q3f5": 2763,
    "Q5g6#": 2764,
    "Rac8+": 2765,
    "Qfg2": 2766,
    "Q1h2#": 2767,
    "Rcxc4": 2768,
    "Rfxe1": 2769,
    "Ned6": 2770,
    "Ndxe3+": 2771,
    "R8h4": 2772,
    "Nce1": 2773,
    "N4xa3": 2774,
    "a8=Q#": 2775,
    "Rexc1": 2776,
    "Rde5+": 2777,
    "Rhc2": 2778,
    "Rcxa4": 2779,
    "Kg3+": 2780,
    "N2a3": 2781,
    "Ncxd6+": 2782,
    "Rfh8": 2783,
    "R4h3+": 2784,
    "R6h3+": 2785,
    "Rexf8": 2786,
    "Rhh4": 2787,
    "Rdg4+": 2788,
    "Kd7+": 2789,
    "R4c3": 2790,
    "Bc4#": 2791,
    "Raxf8": 2792,
    "Qcc3": 2793,
    "Qcd4": 2794,
    "Qad5#": 2795,
    "cxb6+": 2796,
    "Nfxe2": 2797,
    "Rbe2": 2798,
    "Rbxc2": 2799,
    "R2c5": 2800,
    "Bh1+": 2801,
    "N7b5": 2802,
    "R4xc5": 2803,
    "Bxd1+": 2804,
    "Rab8+": 2805,
    "Nfd6": 2806,
    "Bxa4+": 2807,
    "R8xd7": 2808,
    "R7d3+": 2809,
    "R3c6": 2810,
    "Rfxf3+": 2811,
    "Rf3#": 2812,
    "N4c3": 2813,
    "R2g3": 2814,
