{
    "UNK": 0,
    "<|startofgame|>": 1,
    "<|endofgame|>": 2,
    "e2e4": 3,
    "c7c5": 4,
    "g1f3": 5,
    "d7d6": 6,
    "f1b5": 7,
    "c8d7": 8,
    "d1e2": 9,
    "g8f6": 10,
    "b2b3": 11,
    "e7e6": 12,
    "c1b2": 13,
    "f8e7": 14,
    "e4e5": 15,
    "d6e5": 16,
    "f3e5": 17,
    "e8g8": 18,
    "e1g1": 19,
    "a7a6": 20,
    "e5d7": 21,
    "b8d7": 22,
    "b5d3": 23,
    "b7b5": 24,
    "a2a4": 25,
    "c5c4": 26,
    "b3c4": 27,
    "b5b4": 28,
    "d3e4": 29,
    "a8b8": 30,
    "d2d3": 31,
    "a6a5": 32,
    "b1d2": 33,
    "d7c5": 34,
    "b2e5": 35,
    "b8b6": 36,
    "e4f3": 37,
    "d8d7": 38,
    "d2b3": 39,
    "b6a6": 40,
    "b3c5": 41,
    "e7c5": 42,
    "d3d4": 43,
    "c5e7": 44,
    "f1d1": 45,
    "f8c8": 46,
    "c4c5": 47,
    "a6a7": 48,
    "e2b5": 49,
    "f6d5": 50,
    "b5d7": 51,
    "a7d7": 52,
    "d1d3": 53,
    "f7f6": 54,
    "f3g4": 55,
    "g8f7": 56,
    "e5g3": 57,
    "f6f5": 58,
    "g4h5": 59,
    "g7g6": 60,
    "h5f3": 61,
    "e7f6": 62,
    "g3d6": 63,
    "c5d6": 64,
    "c8c2": 65,
    "f3d5": 66,
    "e6d5": 67,
    "a1e1": 68,
    "c2c6": 69,
    "d6d7": 70,
    "c6d6": 71,
    "e1e8": 72,
    "e8a8": 73,
    "f6d8": 74,
    "g2g3": 75,
    "f7e6": 76,
    "a8a6": 77,
    "e6f7": 78,
    "g1g2": 79,
    "g6g5": 80,
    "g2f3": 81,
    "d8c7": 82,
    "g5g4": 83,
    "f3g2": 84,
    "a7b7": 85,
    "e6d6": 86,
    "d7e7": 87,
    "g2f1": 88,
    "e7e4": 89,
    "b5b7": 90,
    "h7h5": 91,
    "f5f4": 92,
    "f2f3": 93,
    "g4f3": 94,
    "g3f4": 95,
    "e4f4": 96,
    "f1f2": 97,
    "c7d8": 98,
    "d8h4": 99,
    "f2f1": 100,
    "f3f2": 101,
    "b7b6": 102,
    "1-0": 103,
    "e7e5": 104,
    "b1c3": 105,
    "b8c6": 106,
    "f8c5": 107,
    "c6e5": 108,
    "d2d4": 109,
    "d4e5": 110,
    "c1e3": 111,
    "e5c3": 112,
    "b2c3": 113,
    "d8f6": 114,
    "d1d4": 115,
    "f6d4": 116,
    "e3d4": 117,
    "e1c1": 118,
    "g8e7": 119,
    "c3c4": 120,
    "e7c6": 121,
    "d4c3": 122,
    "f2f4": 123,
    "c8e6": 124,
    "f1d3": 125,
    "e8c8": 126,
    "f4f5": 127,
    "g2g4": 128,
    "c3e5": 129,
    "d3e2": 130,
    "d8d1": 131,
    "h1d1": 132,
    "h8d8": 133,
    "d1d8": 134,
    "c8d8": 135,
    "c2c3": 136,
    "c1c2": 137,
    "d7c6": 138,
    "c2b3": 139,
    "c6c5": 140,
    "a4a5": 141,
    "a5b6": 142,
    "c7b6": 143,
    "h2h4": 144,
    "b6b5": 145,
    "b3c2": 146,
    "f7c4": 147,
    "e2d3": 148,
    "g4g5": 149,
    "a5a4": 150,
    "d3c4": 151,
    "h4h5": 152,
    "f6g5": 153,
    "h5h6": 154,
    "g7h6": 155,
    "f5f6": 156,
    "c2c4": 157,
    "d7d5": 158,
    "f8b4": 159,
    "c1g5": 160,
    "c4d5": 161,
    "e2e3": 162,
    "d3f5": 163,
    "d8a5": 164,
    "d1c2": 165,
    "f8e8": 166,
    "f3d2": 167,
    "h7h6": 168,
    "g5h4": 169,
    "a5a6": 170,
    "a2a3": 171,
    "b4c3": 172,
    "d7f8": 173,
    "a3a4": 174,
    "c8f5": 175,
    "c2f5": 176,
    "f8d7": 177,
    "f1b1": 178,
    "a6c6": 179,
    "h4g3": 180,
    "e8e6": 181,
    "b1b4": 182,
    "c6b7": 183,
    "b7c6": 184,
    "f5c2": 185,
    "a8e8": 186,
    "c2a4": 187,
    "c6a4": 188,
    "a1a4": 189,
    "f6h5": 190,
    "b4b5": 191,
    "h5g3": 192,
    "h2g3": 193,
    "d7f6": 194,
    "g1f1": 195,
    "e8d8": 196,
    "b5b1": 197,
    "g7g5": 198,
    "f1e2": 199,
    "e2d1": 200,
    "h6h5": 201,
    "a4b4": 202,
    "h5h4": 203,
    "g3h4": 204,
    "g4g3": 205,
    "d8e8": 206,
    "e3e4": 207,
    "f6e4": 208,
    "d2e4": 209,
    "e6e4": 210,
    "e2f3": 211,
    "g3f2": 212,
    "e4e2": 213,
    "e2c2": 214,
    "b1e1": 215,
    "e8e1": 216,
    "f1e1": 217,
    "c3a3": 218,
    "b5d5": 219,
    "a3a6": 220,
    "d5d8": 221,
    "g8g7": 222,
    "d4d5": 223,
    "a6a3": 224,
    "e1d1": 225,
    "d5d6": 226,
    "a3d3": 227,
    "d1c1": 228,
    "a7a5": 229,
    "d8b8": 230,
    "d3d7": 231,
    "b8b4": 232,
    "d7d4": 233,
    "d4h4": 234,
    "b4a4": 235,
    "h4g4": 236,
    "a5c5": 237,
    "c5c6": 238,
    "c1d2": 239,
    "g5e5": 240,
    "c6c4": 241,
    "c4h4": 242,
    "h4h3": 243,
    "d2c1": 244,
    "h3h2": 245,
    "f4f3": 246,
    "h2h8": 247,
    "h8g8": 248,
    "g3f3": 249,
    "g8f8": 250,
    "f8g8": 251,
    "g8c8": 252,
    "e5f5": 253,
    "d2e3": 254,
    "f1g1": 255,
    "c8g8": 256,
    "g1h2": 257,
    "g8h8": 258,
    "h2g2": 259,
    "g2h3": 260,
    "h3g4": 261,
    "h5g6": 262,
    "h8h1": 263,
    "f2f1q": 264,
    "h1f1": 265,
    "f5f1": 266,
    "e3e2": 267,
    "f1f4": 268,
    "g6f5": 269,
    "d3c3": 270,
    "f4e4": 271,
    "c3d3": 272,
    "f5e5": 273,
    "d3c2": 274,
    "e4d4": 275,
    "c2b2": 276,
    "d4d3": 277,
    "b2c2": 278,
    "e5e4": 279,
    "c2c1": 280,
    "e4e3": 281,
    "e3d2": 282,
    "b2a1": 283,
    "a1a2": 284,
    "a2a1": 285,
    "d3a3": 286,
    "0-1": 287,
    "c7c6": 288,
    "e6e5": 289,
    "f4e5": 290,
    "d7e5": 291,
    "e7d6": 292,
    "d1h5": 293,
    "h5f7": 294,
    "e8f7": 295,
    "c3b5": 296,
    "b5c3": 297,
    "h8f8": 298,
    "f7g8": 299,
    "c3e2": 300,
    "h5f4": 301,
    "e2f4": 302,
    "e5f4": 303,
    "f2c5": 304,
    "e5d4": 305,
    "c5d4": 306,
    "g1h1": 307,
    "c8g4": 308,
    "e1e7": 309,
    "e7b7": 310,
    "g4e2": 311,
    "e8e2": 312,
    "h2h3": 313,
    "d4d2": 314,
    "e2g2": 315,
    "g2h2": 316,
    "b5c6": 317,
    "d2f1": 318,
    "f1g3": 319,
    "f6d7": 320,
    "c3d4": 321,
    "f7f5": 322,
    "e4f5": 323,
    "a8d8": 324,
    "e1e5": 325,
    "e5e2": 326,
    "h3h4": 327,
    "f5g4": 328,
    "e2d2": 329,
    "d1f1": 330,
    "d2d6": 331,
    "f8f2": 332,
    "f2g2": 333,
    "f1a1": 334,
    "e3a7": 335,
    "a7d4": 336,
    "d6c6": 337,
    "a1d1": 338,
    "c6c7": 339,
    "c7g7": 340,
    "d4c5": 341,
    "a1b1": 342,
    "a8c8": 343,
    "c8c7": 344,
    "b2b4": 345,
    "e5f3": 346,
    "d2f3": 347,
    "b6c5": 348,
    "d8a8": 349,
    "b5b6": 350,
    "c7b7": 351,
    "f5d3": 352,
    "e8b8": 353,
    "b1b8": 354,
    "c3f6": 355,
    "a6f6": 356,
    "d1d5": 357,
    "f6g6": 358,
    "b8h2": 359,
    "e7f8": 360,
    "e2c4": 361,
    "h2h1": 362,
    "h1c1": 363,
    "a4c6": 364,
    "g6c6": 365,
    "c4d3": 366,
    "c6c2": 367,
    "e2f1": 368,
    "f1g2": 369,
    "c4c7": 370,
    "d8d4": 371,
    "f8a3": 372,
    "d4g4": 373,
    "a3b4": 374,
    "c7c2": 375,
    "b4e1": 376,
    "g4d4": 377,
    "c2f2": 378,
    "f2h4": 379,
    "h4d4": 380,
    "e1f2": 381,
    "d4c4": 382,
    "f2e3": 383,
    "e3h6": 384,
    "a4a3": 385,
    "a3a2": 386,
    "c3b2": 387,
    "f3f4": 388,
    "h6f4": 389,
    "a2b3": 390,
    "g3g2": 391,
    "g2g1q": 392,
    "d5e6": 393,
    "g1b1": 394,
    "e6f6": 395,
    "f6e6": 396,
    "f8g7": 397,
    "b1f5": 398,
    "f7e8": 399,
    "h2h1q": 400,
    "e5h2": 401,
    "h2g1": 402,
    "g5f4": 403,
    "f4e3": 404,
    "e8e7": 405,
    "f5f2": 406,
    "d6c7": 407,
    "f2e1": 408,
    "c7d7": 409,
    "h1g2": 410,
    "d7c7": 411,
    "g2d2": 412,
    "e1e3": 413,
    "b7c8": 414,
    "c8b7": 415,
    "f4b4": 416,
    "e3c3": 417,
    "g5e3": 418,
    "e3f4": 419,
    "c7d6": 420,
    "c4b3": 421,
    "f6e5": 422,
    "b5a6": 423,
    "b7a6": 424,
    "e8h5": 425,
    "c3a4": 426,
    "g4h3": 427,
    "c8h3": 428,
    "h3g2": 429,
    "f4g5": 430,
    "a1h1": 431,
    "h5g4": 432,
    "h1h2": 433,
    "f8f7": 434,
    "a4b6": 435,
    "a8f8": 436,
    "f4g3": 437,
    "h3g3": 438,
    "f7f2": 439,
    "g2g1": 440,
    "g4h4": 441,
    "g3g5": 442,
    "h4g5": 443,
    "d3g3": 444,
    "g5g3": 445,
    "c3d5": 446,
    "e5f6": 447,
    "d5f6": 448,
    "d7b6": 449,
    "d1b3": 450,
    "c6d4": 451,
    "a1c1": 452,
    "c1c7": 453,
    "e5e8": 454,
    "b6d7": 455,
    "c5c7": 456,
    "e4d6": 457,
    "d6f7": 458,
    "b3e6": 459,
    "g4e6": 460,
    "c7f7": 461,
    "f1c1": 462,
    "f7d5": 463,
    "g2d5": 464,
    "g1f2": 465,
    "b4b3": 466,
    "d4d6": 467,
    "b8e8": 468,
    "g3g4": 469,
    "d6a6": 470,
    "d5f4": 471,
    "d8b6": 472,
    "f3d4": 473,
    "b6d4": 474,
    "e5d6": 475,
    "d5d4": 476,
    "c3e4": 477,
    "d6d5": 478,
    "d5e4": 479,
    "d4e3": 480,
    "a5b4": 481,
    "c6b4": 482,
    "e1e2": 483,
    "b4d3": 484,
    "d7b5": 485,
    "d3d1": 486,
    "a8a2": 487,
    "d1e1": 488,
    "c5b4": 489,
    "a2e2": 490,
    "e2f2": 491,
    "e1d2": 492,
    "e2e1q": 493,
    "h5g5": 494,
    "d2f4": 495,
    "g5f6": 496,
    "b5a4": 497,
    "a4b3": 498,
    "c5b6": 499,
    "b6e3": 500,
    "c6e7": 501,
    "d8f8": 502,
    "f3g5": 503,
    "e7g6": 504,
    "g3f5": 505,
    "g5f3": 506,
    "f3h4": 507,
    "g6h4": 508,
    "f5h4": 509,
    "h4f5": 510,
    "c8b8": 511,
    "f5h6": 512,
    "h6g4": 513,
    "f6g4": 514,
    "d1g4": 515,
    "d7g4": 516,
    "e6c8": 517,
    "b8c8": 518,
    "f1h1": 519,
    "d7e6": 520,
    "h1h6": 521,
    "f2e2": 522,
    "c3b4": 523,
    "h1a1": 524,
    "f8a8": 525,
    "b4a3": 526,
    "b2a3": 527,
    "g7a7": 528,
    "a7a3": 529,
    "a1a3": 530,
    "a8a3": 531,
    "h6h8": 532,
    "h8b8": 533,
    "c4c3": 534,
    "f3e2": 535,
    "d3d2": 536,
    "d2g2": 537,
    "e4d5": 538,
    "c8c3": 539,
    "g4f5": 540,
    "f3g3": 541,
    "f5e4": 542,
    "c3b3": 543,
    "b3b4": 544,
    "d5c5": 545,
    "b4e4": 546,
    "c5d5": 547,
    "f4g4": 548,
    "d5e5": 549,
    "f4d4": 550,
    "e5e6": 551,
    "g4f4": 552,
    "e4d3": 553,
    "f8d6": 554,
    "c1f4": 555,
    "d6f4": 556,
    "f1f5": 557,
    "c7h2": 558,
    "g1e2": 559,
    "d1d2": 560,
    "e3c5": 561,
    "c5d3": 562,
    "e2g3": 563,
    "e8e4": 564,
    "h1g1": 565,
    "c6d5": 566,
    "d5c3": 567,
    "d8e7": 568,
    "e2c3": 569,
    "c6b8": 570,
    "b8a6": 571,
    "f8b8": 572,
    "d5c6": 573,
    "c6b5": 574,
    "c4b5": 575,
    "a6c5": 576,
    "e3g5": 577,
    "e7e8": 578,
    "g7f6": 579,
    "d5c7": 580,
    "c7a8": 581,
    "b8a8": 582,
    "c5b7": 583,
    "c1c8": 584,
    "b7d6": 585,
    "c8a8": 586,
    "d6b5": 587,
    "a8a7": 588,
    "b1c1": 589,
    "f3e4": 590,
    "e6g4": 591,
    "b5c4": 592,
    "a7f7": 593,
    "c4e2": 594,
    "g6f7": 595,
    "e2h5": 596,
    "c1d1": 597,
    "g5g6": 598,
    "g6g7": 599,
    "g7g8q": 600,
    "g8d5": 601,
    "f5d5": 602,
    "d2e1": 603,
    "c5c1": 604,
    "e5c6": 605,
    "d1f3": 606,
    "d8d5": 607,
    "b1a3": 608,
    "a3c2": 609,
    "e8d7": 610,
    "c2e3": 611,
    "e3f5": 612,
    "f5d6": 613,
    "b3a4": 614,
    "b8b2": 615,
    "h8a8": 616,
    "d7b8": 617,
    "b2e2": 618,
    "b1b5": 619,
    "b8b5": 620,
    "e5g4": 621,
    "c2d3": 622,
    "g4e5": 623,
    "e5c4": 624,
    "f5g6": 625,
    "c4d2": 626,
    "g6h6": 627,
    "h6g5": 628,
    "d2c4": 629,
    "c3c2": 630,
    "c4b6": 631,
    "f1f3": 632,
    "g3g7": 633,
    "g7g3": 634,
    "g8g3": 635,
    "a1f1": 636,
    "e5e3": 637,
    "d3e1": 638,
    "c7e5": 639,
    "e5c5": 640,
    "e5g6": 641,
    "c5e5": 642,
    "f2g1": 643,
    "e5h5": 644,
    "g6e5": 645,
    "f3e3": 646,
    "f4e6": 647,
    "f1f8": 648,
    "e3g3": 649,
    "g1e3": 650,
    "g3e3": 651,
    "c8f8": 652,
    "e3a3": 653,
    "f7e7": 654,
    "d4c2": 655,
    "c2a3": 656,
    "e7d7": 657,
    "c5a5": 658,
    "a3b1": 659,
    "f6f7": 660,
    "d3b1": 661,
    "c3b1": 662,
    "a5b5": 663,
    "b7a7": 664,
    "d5b6": 665,
    "a7h7": 666,
    "d8d6": 667,
    "e4f6": 668,
    "b2f6": 669,
    "f6e7": 670,
    "g8g4": 671,
    "c6f3": 672,
    "b7f3": 673,
    "g4g2": 674,
    "a8g8": 675,
    "g1a1": 676,
    "f3c6": 677,
    "a6b5": 678,
    "f6e8": 679,
    "a6b4": 680,
    "b4c6": 681,
    "b2g7": 682,
    "e8g7": 683,
    "d4e6": 684,
    "g5e6": 685,
    "g7e6": 686,
    "d5e7": 687,
    "g2a8": 688,
    "e6g5": 689,
    "g5h3": 690,
    "d3d5": 691,
    "d5a8": 692,
    "h3f4": 693,
    "f6f4": 694,
    "a8b7": 695,
    "b7e7": 696,
    "e7e3": 697,
    "g5d2": 698,
    "d2h6": 699,
    "g4h6": 700,
    "h6f7": 701,
    "f2g3": 702,
    "d8g5": 703,
    "d2g5": 704,
    "d1a1": 705,
    "b8b7": 706,
    "b5a7": 707,
    "a7b5": 708,
    "e2g4": 709,
    "a1a8": 710,
    "b2a2": 711,
    "a2a8": 712,
    "c6a8": 713,
    "g6f8": 714,
    "a8c6": 715,
    "a3e3": 716,
    "g4d7": 717,
    "e3e1": 718,
    "c5b3": 719,
    "e1f1": 720,
    "f6g7": 721,
    "b3d4": 722,
    "d4c6": 723,
    "e7c7": 724,
    "c6c1": 725,
    "f7h6": 726,
    "e8d6": 727,
    "f6g8": 728,
    "f7g6": 729,
    "d3g6": 730,
    "e8f8": 731,
    "f8g6": 732,
    "c1b1": 733,
    "a8a4": 734,
    "e7b4": 735,
    "d2b2": 736,
    "g4f6": 737,
    "b3d2": 738,
    "b4b6": 739,
    "g1c1": 740,
    "c1c3": 741,
    "b1c2": 742,
    "e4f2": 743,
    "c2d2": 744,
    "f2e4": 745,
    "b2f2": 746,
    "a5a2": 747,
    "b3d3": 748,
    "d3b3": 749,
    "b3c3": 750,
    "e4g3": 751,
    "a2h2": 752,
    "f2f5": 753,
    "b4d2": 754,
    "f8d8": 755,
    "e7f5": 756,
    "e3f3": 757,
    "f5d4": 758,
    "d4d1": 759,
    "b7d5": 760,
    "c2d1": 761,
    "d5c4": 762,
    "d6e6": 763,
    "c2h7": 764,
    "h7g8": 765,
    "g8h7": 766,
    "h7f5": 767,
    "d6e7": 768,
    "c4e6": 769,
    "d3b5": 770,
    "b6b7": 771,
    "e4b7": 772,
    "d4e4": 773,
    "f3h5": 774,
    "h6g7": 775,
    "g7h7": 776,
    "h7g7": 777,
    "g7h8": 778,
    "h8g7": 779,
    "g7f8": 780,
    "e6d7": 781,
    "h6h7": 782,
    "b6a7": 783,
    "h7h8q": 784,
    "a7b6": 785,
    "b6c7": 786,
    "b6c6": 787,
    "c6d7": 788,
    "g6h5": 789,
    "f7f8q": 790,
    "c7a7": 791,
    "c5d7": 792,
    "g5e4": 793,
    "d7e8": 794,
    "c7c8": 795,
    "e4d2": 796,
    "e8b5": 797,
    "a4b5": 798,
    "g6e7": 799,
    "g4d1": 800,
    "e1h1": 801,
    "d2d1": 802,
    "e6f5": 803,
    "h1h5": 804,
    "b8d8": 805,
    "h4h1": 806,
    "d8c8": 807,
    "b2d4": 808,
    "e7d8": 809,
    "c8a6": 810,
    "d7b7": 811,
    "c4d6": 812,
    "b7d7": 813,
    "c2c5": 814,
    "d4g7": 815,
    "b4d6": 816,
    "d6g3": 817,
    "d3f3": 818,
    "f8f6": 819,
    "f4d3": 820,
    "f6h6": 821,
    "h4h2": 822,
    "f3h1": 823,
    "h6h1": 824,
    "d3f4": 825,
    "e1e6": 826,
    "d6c4": 827,
    "e6e2": 828,
    "e6f4": 829,
    "g6d6": 830,
    "e2e6": 831,
    "e6d8": 832,
    "d8c6": 833,
    "c4e3": 834,
    "g2f2": 835,
    "e3d1": 836,
    "d1b2": 837,
    "e7d5": 838,
    "b2d1": 839,
    "d1c3": 840,
    "e4c5": 841,
    "b6d5": 842,
    "d7c8": 843,
    "f3b7": 844,
    "b3e3": 845,
    "e1e4": 846,
    "e5d3": 847,
    "e4e8": 848,
    "d3f2": 849,
    "d8g8": 850,
    "c2c7": 851,
    "b5d6": 852,
    "f7g7": 853,
    "g8d8": 854,
    "e7a3": 855,
    "a3d6": 856,
    "d6f8": 857,
    "d4b5": 858,
    "a5d8": 859,
    "d2c3": 860,
    "c3g7": 861,
    "g7g8": 862,
    "c2e2": 863,
    "f6c3": 864,
    "d8d2": 865,
    "e3e8": 866,
    "e8e5": 867,
    "d3e3": 868,
    "c2a2": 869,
    "a1e5": 870,
    "e3e5": 871,
    "e5d5": 872,
    "a6a8": 873,
    "f1c4": 874,
    "d5b5": 875,
    "d4e2": 876,
    "d6c5": 877,
    "a6b7": 878,
    "d3d6": 879,
    "d6d4": 880,
    "c3g3": 881,
    "g5e7": 882,
    "e7h4": 883,
    "d6d2": 884,
    "f4h5": 885,
    "g7f7": 886,
    "h5f6": 887,
    "f6h7": 888,
    "h7g5": 889,
    "g7c3": 890,
    "h4h8": 891,
    "h8c3": 892,
    "g7b2": 893,
    "f5d7": 894,
    "b4c5": 895,
    "d5g2": 896,
    "c1a1": 897,
    "a1a6": 898,
    "c5a3": 899,
    "b3b8": 900,
    "e5b2": 901,
    "a2d5": 902,
    "a8d5": 903,
    "a5d5": 904,
    "a6d3": 905,
    "e2d4": 906,
    "d3e5": 907,
    "e5f7": 908,
    "f7d8": 909,
    "h3e6": 910,
    "e6c4": 911,
    "d6f5": 912,
    "b6d6": 913,
    "f4d6": 914,
    "a7a8": 915,
    "e3c4": 916,
    "c4e5": 917,
    "e5a5": 918,
    "d1d6": 919,
    "d6b6": 920,
    "f5c8": 921,
    "a5e5": 922,
    "d6d8": 923,
    "h7g6": 924,
    "f4f8": 925,
    "a6h6": 926,
    "h7h8": 927,
    "c5b5": 928,
    "e7f7": 929,
    "h8h6": 930,
    "h6d6": 931,
    "e8c6": 932,
    "f7f8": 933,
    "e6e7": 934,
    "d6h6": 935,
    "c1a3": 936,
    "a3c5": 937,
    "c5a7": 938,
    "b8a7": 939,
    "f3d1": 940,
    "b8b3": 941,
    "d4d7": 942,
    "b3b6": 943,
    "h8c8": 944,
    "d7a7": 945,
    "d2e2": 946,
    "b7b2": 947,
    "b5e2": 948,
    "h4e7": 949,
    "f5e6": 950,
    "b4d5": 951,
    "d5e3": 952,
    "g2e2": 953,
    "e3f1": 954,
    "b7e4": 955,
    "e7g5": 956,
    "h8h7": 957,
    "d6g6": 958,
    "f5e3": 959,
    "f8f1": 960,
    "g6e4": 961,
    "g6f6": 962,
    "e2a2": 963,
    "e4c3": 964,
    "g1g3": 965,
    "h3f5": 966,
    "a1g1": 967,
    "g1g4": 968,
    "c4f1": 969,
    "h3f1": 970,
    "g4g1": 971,
    "f1h3": 972,
    "g3g1": 973,
    "f1a6": 974,
    "g4g6": 975,
    "g1g6": 976,
    "a6f1": 977,
    "g6g1": 978,
    "c3e3": 979,
    "e3d3": 980,
    "d6a3": 981,
    "b3a3": 982,
    "a3a7": 983,
    "f8e6": 984,
    "a7b8": 985,
    "d8e6": 986,
    "e1b4": 987,
    "e3f2": 988,
    "c6e6": 989,
    "f4d2": 990,
    "c8c1": 991,
    "c1e1": 992,
    "e2e1": 993,
    "a6c7": 994,
    "c7e6": 995,
    "d7f5": 996,
    "f7d7": 997,
    "h1e1": 998,
    "f8f3": 999,
    "d5f3": 1000,
    "f2b2": 1001,
    "d7h3": 1002,
    "d2b4": 1003,
    "d8h8": 1004,
    "d6b8": 1005,
    "b3b7": 1006,
    "e2c1": 1007,
    "c1e2": 1008,
    "b5d4": 1009,
    "g3e2": 1010,
    "d4f2": 1011,
    "b8g8": 1012,
    "c1g1": 1013,
    "g1g8": 1014,
    "g8g2": 1015,
    "g2h1": 1016,
    "d3f1": 1017,
    "h1e4": 1018,
    "e4h1": 1019,
    "e4b1": 1020,
    "b5f1": 1021,
    "f2d4": 1022,
    "a3b2": 1023,
    "f8f5": 1024,
    "a3b5": 1025,
    "b5a3": 1026,
    "h4f2": 1027,
    "b6a5": 1028,
    "a3c4": 1029,
    "d6c8": 1030,
    "d7d2": 1031,
    "g7e5": 1032,
    "d3h7": 1033,
    "h5e5": 1034,
    "b5c7": 1035,
    "b1b7": 1036,
    "b7f7": 1037,
    "d2a5": 1038,
    "a5d2": 1039,
    "h4g2": 1040,
    "g5h6": 1041,
    "h6f8": 1042,
    "d1e3": 1043,
    "b6c4": 1044,
    "g2e3": 1045,
    "e3g2": 1046,
    "c4a5": 1047,
    "b7a8": 1048,
    "a8e4": 1049,
    "a5b7": 1050,
    "c7c8q": 1051,
    "f5e7": 1052,
    "a5f5": 1053,
    "f2d3": 1054,
    "b7g2": 1055,
    "c2c1q": 1056,
    "1/2-1/2": 1057,
    "a6e2": 1058,
    "a8a1": 1059,
    "d4f5": 1060,
    "g3h2": 1061,
    "b4h4": 1062,
    "d3h3": 1063,
    "g5f7": 1064,
    "e6e3": 1065,
    "b8f8": 1066,
    "c6f6": 1067,
    "c3a5": 1068,
    "c1c6": 1069,
    "f6f8": 1070,
    "g2e4": 1071,
    "f3d3": 1072,
    "c6c8": 1073,
    "c4b4": 1074,
    "g2c6": 1075,
    "f5g3": 1076,
    "b3b2": 1077,
    "b1b2": 1078,
    "b2b7": 1079,
    "e1g3": 1080,
    "b7b3": 1081,
    "a3c1": 1082,
    "a2a7": 1083,
    "a7a2": 1084,
    "h8h3": 1085,
    "h3e3": 1086,
    "c6d8": 1087,
    "e3b6": 1088,
    "a6c8": 1089,
    "h1b1": 1090,
    "a6c4": 1091,
    "c4a6": 1092,
    "a4c3": 1093,
    "d1a4": 1094,
    "d7a4": 1095,
    "h8e8": 1096,
    "c6a5": 1097,
    "e8e3": 1098,
    "d7f7": 1099,
    "f7d6": 1100,
    "a2d2": 1101,
    "b4a5": 1102,
    "g6b1": 1103,
    "b1d3": 1104,
    "e7a7": 1105,
    "a7a4": 1106,
    "c3d2": 1107,
    "e6e8": 1108,
    "e4e1": 1109,
    "e1a1": 1110,
    "c3a1": 1111,
    "a1c3": 1112,
    "c8c4": 1113,
    "g3c3": 1114,
    "b6b3": 1115,
    "d6b7": 1116,
    "c6b6": 1117,
    "g8g6": 1118,
    "g6g4": 1119,
    "g6h7": 1120,
    "a3f8": 1121,
    "h5h3": 1122,
    "e1b1": 1123,
    "c5c3": 1124,
    "c3e1": 1125,
    "a2b2": 1126,
    "a2a1q": 1127,
    "b6b2": 1128,
    "a5b3": 1129,
    "g5h7": 1130,
    "h7f8": 1131,
    "h5h8": 1132,
    "f4h6": 1133,
    "h8f6": 1134,
    "f6h8": 1135,
    "h6e6": 1136,
    "b2b1q": 1137,
    "a2b1": 1138,
    "f5b1": 1139,
    "g3e5": 1140,
    "e2b2": 1141,
    "e5g7": 1142,
    "f6b6": 1143,
    "b6f6": 1144,
    "a6a1": 1145,
    "d4a4": 1146,
    "e4a4": 1147,
    "a4e4": 1148,
    "e4g4": 1149,
    "h6f6": 1150,
    "f3a8": 1151,
    "f6c6": 1152,
    "d7d3": 1153,
    "a3b3": 1154,
    "b4b1": 1155,
    "h5e2": 1156,
    "h7h1": 1157,
    "h1h8": 1158,
    "h7h2": 1159,
    "f4g2": 1160,
    "e3c2": 1161,
    "c2d4": 1162,
    "c5e4": 1163,
    "e7c8": 1164,
    "b1b3": 1165,
    "f3h2": 1166,
    "c8d6": 1167,
    "b1f1": 1168,
    "d6e4": 1169,
    "h2f3": 1170,
    "f6h4": 1171,
    "h4d8": 1172,
    "f3f6": 1173,
    "c1c4": 1174,
    "a4d1": 1175,
    "g7d7": 1176,
    "f4d5": 1177,
    "e6g7": 1178,
    "g7f5": 1179,
    "e3g1": 1180,
    "g1a7": 1181,
    "f3g1": 1182,
    "g8e8": 1183,
    "g1c5": 1184,
    "f1f6": 1185,
    "h5d5": 1186,
    "g6f4": 1187,
    "g3f1": 1188,
    "e3c1": 1189,
    "f1e3": 1190,
    "a5c6": 1191,
    "g2f4": 1192,
    "c1h6": 1193,
    "h1h4": 1194,
    "d4f3": 1195,
    "d4b3": 1196,
    "b6d8": 1197,
    "a4c5": 1198,
    "c5e6": 1199,
    "e6c6": 1200,
    "h4f6": 1201,
    "b4d4": 1202,
    "c2g2": 1203,
    "e6h3": 1204,
    "b8b1": 1205,
    "g4e3": 1206,
    "d2f2": 1207,
    "f2f8": 1208,
    "f7f3": 1209,
    "f3f5": 1210,
    "d2d1b": 1211,
    "d8d3": 1212,
    "f6f3": 1213,
    "d5b7": 1214,
    "b3g8": 1215,
    "e7g7": 1216,
    "c3d1": 1217,
    "d5d2": 1218,
    "d6b4": 1219,
    "g6c2": 1220,
    "d5b4": 1221,
    "d3c1": 1222,
    "g7d4": 1223,
    "c1f1": 1224,
    "b1d1": 1225,
    "h4f3": 1226,
    "b5a5": 1227,
    "g3b3": 1228,
    "h2e2": 1229,
    "d2a2": 1230,
    "a2a5": 1231,
    "e4h4": 1232,
    "e1c3": 1233,
    "c5f8": 1234,
    "a4a6": 1235,
    "f2f6": 1236,
    "f2f7": 1237,
    "c7e7": 1238,
    "c8h8": 1239,
    "f4f6": 1240,
    "a4g4": 1241,
    "c5a4": 1242,
    "a4a2": 1243,
    "f3e1": 1244,
    "e1d3": 1245,
    "c3c6": 1246,
    "d3b2": 1247,
    "b2d3": 1248,
    "a2c2": 1249,
    "d2c2": 1250,
    "e8c7": 1251,
    "a8b6": 1252,
    "c1b3": 1253,
    "b7c7": 1254,
    "h3d7": 1255,
    "e2a6": 1256,
    "f2c2": 1257,
    "f3h3": 1258,
    "d5f7": 1259,
    "g8h6": 1260,
    "c2e1": 1261,
    "d5d3": 1262,
    "c3a2": 1263,
    "a2b4": 1264,
    "a5c3": 1265,
    "f3f7": 1266,
    "f7e5": 1267,
    "d1b1": 1268,
    "g8b8": 1269,
    "a6b6": 1270,
    "b1a1": 1271,
    "a1a7": 1272,
    "a5a7": 1273,
    "f6d6": 1274,
    "a7c7": 1275,
    "f5b5": 1276,
    "e6c5": 1277,
    "c8c5": 1278,
    "h5g7": 1279,
    "e5e7": 1280,
    "e6g6": 1281,
    "f4b8": 1282,
    "e4c4": 1283,
    "b4b8": 1284,
    "b8e5": 1285,
    "c2e4": 1286,
    "c4g4": 1287,
    "g4e4": 1288,
    "h3f3": 1289,
    "b4c4": 1290,
    "c4d4": 1291,
    "e1h4": 1292,
    "a3a5": 1293,
    "b3b5": 1294,
    "g5d8": 1295,
    "b7c5": 1296,
    "d4b6": 1297,
    "d5g5": 1298,
    "d6d1": 1299,
    "c5c2": 1300,
    "b6f2": 1301,
    "g3h5": 1302,
    "c7a5": 1303,
    "d6h2": 1304,
    "f8h8": 1305,
    "h8h2": 1306,
    "f2d2": 1307,
    "f2g4": 1308,
    "g6e8": 1309,
    "e4e7": 1310,
    "g8g5": 1311,
    "e8h8": 1312,
    "g3g6": 1313,
    "e3d5": 1314,
    "h6h2": 1315,
    "f6b2": 1316,
    "b2b1": 1317,
    "b3b1": 1318,
    "b7b1": 1319,
    "b5f5": 1320,
    "h4g6": 1321,
    "d6e8": 1322,
    "a8h8": 1323,
    "g7h5": 1324,
    "h8h5": 1325,
    "h5f5": 1326,
    "d2b1": 1327,
    "e3g4": 1328,
    "b2c1": 1329,
    "c2b1": 1330,
    "a5c7": 1331,
    "h2f4": 1332,
    "e6f8": 1333,
    "b3f7": 1334,
    "e4c2": 1335,
    "e1c2": 1336,
    "e4g5": 1337,
    "h3h8": 1338,
    "f5g7": 1339,
    "f4g6": 1340,
    "b6a4": 1341,
    "a4b2": 1342,
    "h6g6": 1343,
    "c6e8": 1344,
    "d7d1": 1345,
    "d6d3": 1346,
    "a4c2": 1347,
    "b7d8": 1348,
    "a7a8q": 1349,
    "f4c7": 1350,
    "d8b7": 1351,
    "d5b3": 1352,
    "b3d5": 1353,
    "e4h7": 1354,
    "b4e7": 1355,
    "h7d3": 1356,
    "e4e6": 1357,
    "e6b3": 1358,
    "g6h8": 1359,
    "g5d5": 1360,
    "b7b8": 1361,
    "f3f8": 1362,
    "d5f5": 1363,
    "h6e3": 1364,
    "c5g5": 1365,
    "f7g5": 1366,
    "d5d1": 1367,
    "a6d6": 1368,
    "b5c5": 1369,
    "c1c5": 1370,
    "g3h3": 1371,
    "g4b4": 1372,
    "b4b2": 1373,
    "f4h2": 1374,
    "d1d7": 1375,
    "b8d6": 1376,
    "h2d6": 1377,
    "b5b3": 1378,
    "c7c4": 1379,
    "c4c6": 1380,
    "a3a1": 1381,
    "c6g6": 1382,
    "d7g7": 1383,
    "h7a7": 1384,
    "f5c5": 1385,
    "f5f3": 1386,
    "g2a2": 1387,
    "d3a6": 1388,
    "d2d5": 1389,
    "e6d4": 1390,
    "c4f7": 1391,
    "h8h4": 1392,
    "e2e1r": 1393,
    "c3c7": 1394,
    "e8a4": 1395,
    "f4h3": 1396,
    "h3g5": 1397,
    "a5a3": 1398,
    "h4e4": 1399,
    "f5g5": 1400,
    "g5g1": 1401,
    "c3f3": 1402,
    "f3a3": 1403,
    "g1g5": 1404,
    "g5a5": 1405,
    "c6a7": 1406,
    "a7c6": 1407,
    "e4c6": 1408,
    "c6e4": 1409,
    "c8e8": 1410,
    "d7d8": 1411,
    "f5f7": 1412,
    "h8a1": 1413,
    "f6f2": 1414,
    "b2b6": 1415,
    "c2g6": 1416,
    "e4a8": 1417,
    "g6e6": 1418,
    "g5c1": 1419,
    "c5e3": 1420,
    "e2g1": 1421,
    "h6h4": 1422,
    "d8f7": 1423,
    "b3d1": 1424,
    "d5h5": 1425,
    "f5h5": 1426,
    "g3e4": 1427,
    "b3a2": 1428,
    "e5c7": 1429,
    "d2d7": 1430,
    "g7a1": 1431,
    "b4c2": 1432,
    "d4f6": 1433,
    "c5f2": 1434,
    "d1g1": 1435,
    "g1g7": 1436,
    "g7b7": 1437,
    "e4g6": 1438,
    "f3f1": 1439,
    "f7f4": 1440,
    "g6b6": 1441,
    "b6g6": 1442,
    "b6b8": 1443,
    "f8f4": 1444,
    "b7g7": 1445,
    "g7e7": 1446,
    "f4f7": 1447,
    "h7e4": 1448,
    "b1b6": 1449,
    "h8e5": 1450,
    "g8e6": 1451,
    "a5c4": 1452,
    "h4h6": 1453,
    "e2e5": 1454,
    "d7d8q": 1455,
    "f7h7": 1456,
    "h7e7": 1457,
    "g5f5": 1458,
    "g7g1": 1459,
    "a7e3": 1460,
    "h1h3": 1461,
    "f5h7": 1462,
    "d3c5": 1463,
    "c6a6": 1464,
    "d3b4": 1465,
    "c2b4": 1466,
    "b4a2": 1467,
    "a2c3": 1468,
    "c7f4": 1469,
    "d2d8": 1470,
    "c7b8q": 1471,
    "b8g3": 1472,
    "a8a5": 1473,
    "c5c8": 1474,
    "b7b8q": 1475,
    "b8c7": 1476,
    "h3h6": 1477,
    "h6h3": 1478,
    "c5f5": 1479,
    "g6g8": 1480,
    "a1b2": 1481,
    "f4f2": 1482,
    "c5g1": 1483,
    "g5g8": 1484,
    "a4c4": 1485,
    "d4a7": 1486,
    "d4h8": 1487,
    "c3c8": 1488,
    "h3c8": 1489,
    "f6a1": 1490,
    "g5h5": 1491,
    "g6g2": 1492,
    "f4e2": 1493,
    "d1h1": 1494,
    "h1h7": 1495,
    "g3b8": 1496,
    "h4h7": 1497,
    "a4a7": 1498,
    "d7h7": 1499,
    "h2e5": 1500,
    "h6f5": 1501,
    "h2g4": 1502,
    "a1d4": 1503,
    "e5b5": 1504,
    "c4e4": 1505,
    "b1e4": 1506,
    "b7b4": 1507,
    "e1f3": 1508,
    "b1g1": 1509,
    "b3c1": 1510,
    "c1d3": 1511,
    "f5f8": 1512,
    "b2c4": 1513,
    "d6f6": 1514,
    "c7c1": 1515,
    "e6e1": 1516,
    "a7f2": 1517,
    "g2f1q": 1518,
    "d4d8": 1519,
    "a4d4": 1520,
    "b6g1": 1521,
    "h2h5": 1522,
    "g2b7": 1523,
    "e3e6": 1524,
    "h3d3": 1525,
    "d2d1q": 1526,
    "b2b8": 1527,
    "a2f2": 1528,
    "g4h2": 1529,
    "h2f1": 1530,
    "e7e1": 1531,
    "g1h3": 1532,
    "f6f1": 1533,
    "a2g2": 1534,
    "g2g5": 1535,
    "a3e7": 1536,
    "d3d8": 1537,
    "f1f7": 1538,
    "h3f2": 1539,
    "h2h6": 1540,
    "h6d2": 1541,
    "d4b2": 1542,
    "h6c1": 1543,
    "c4g8": 1544,
    "a7c5": 1545,
    "e6b6": 1546,
    "f2b6": 1547,
    "b6a8": 1548,
    "e6c7": 1549,
    "f4c1": 1550,
    "g4f2": 1551,
    "f2h1": 1552,
    "h1g3": 1553,
    "b2g2": 1554,
    "g3c7": 1555,
    "e3h3": 1556,
    "h5h7": 1557,
    "d5a2": 1558,
    "f7f1": 1559,
    "e7e2": 1560,
    "a6a4": 1561,
    "d5d7": 1562,
    "c3c1": 1563,
    "c4c2": 1564,
    "b4f8": 1565,
    "f6a6": 1566,
    "g6g3": 1567,
    "e2e7": 1568,
    "a4d7": 1569,
    "b5b8": 1570,
    "d5h1": 1571,
    "e5e1": 1572,
    "c7e8": 1573,
    "c7c3": 1574,
    "e6g8": 1575,
    "b6e6": 1576,
    "e7h7": 1577,
    "a7c8": 1578,
    "e2e8": 1579,
    "c7b5": 1580,
    "e5b8": 1581,
    "h1f3": 1582,
    "g3h1": 1583,
    "e7g8": 1584,
    "h1b7": 1585,
    "b6b4": 1586,
    "c4c8": 1587,
    "a8c7": 1588,
    "c7d5": 1589,
    "c8c6": 1590,
    "d4f4": 1591,
    "h4f4": 1592,
    "a7g7": 1593,
    "d5a5": 1594,
    "g4c8": 1595,
    "b5e8": 1596,
    "c7b8": 1597,
    "b8f4": 1598,
    "c4c1": 1599,
    "f7a7": 1600,
    "e8g6": 1601,
    "b6b1": 1602,
    "c8e7": 1603,
    "c5a6": 1604,
    "c3c5": 1605,
    "b2d2": 1606,
    "c4b2": 1607,
    "b5b2": 1608,
    "c1h1": 1609,
    "g7g2": 1610,
    "c4a2": 1611,
    "f4h4": 1612,
    "d4b4": 1613,
    "f3c3": 1614,
    "a5a8": 1615,
    "g1e1": 1616,
    "c4f4": 1617,
    "f4c4": 1618,
    "e4g2": 1619,
    "f2h2": 1620,
    "h2a2": 1621,
    "e4b4": 1622,
    "f8h7": 1623,
    "g6d3": 1624,
    "a3c3": 1625,
    "c5h5": 1626,
    "h5a5": 1627,
    "h3a3": 1628,
    "d4g1": 1629,
    "h5e8": 1630,
    "f7c7": 1631,
    "e7e8q": 1632,
    "e3b3": 1633,
    "c8b6": 1634,
    "b3a5": 1635,
    "g3e1": 1636,
    "h6g8": 1637,
    "e8f6": 1638,
    "a6b8": 1639,
    "d4a1": 1640,
    "d5g8": 1641,
    "e3e7": 1642,
    "c4a3": 1643,
    "h1c6": 1644,
    "f8h6": 1645,
    "c6g2": 1646,
    "h5h2": 1647,
    "c8a7": 1648,
    "e6a6": 1649,
    "a2a6": 1650,
    "h6a6": 1651,
    "h7h3": 1652,
    "h3h1": 1653,
    "g3d3": 1654,
    "g4a4": 1655,
    "g2h4": 1656,
    "c6c3": 1657,
    "h2c7": 1658,
    "h6c6": 1659,
    "b7h7": 1660,
    "e5g5": 1661,
    "g4g7": 1662,
    "h7f7": 1663,
    "c7h7": 1664,
    "h3h5": 1665,
    "b1a2": 1666,
    "a7a1": 1667,
    "b3a1": 1668,
    "c7a6": 1669,
    "b8h8": 1670,
    "f7b7": 1671,
    "g2g6": 1672,
    "b4a6": 1673,
    "b1g6": 1674,
    "b6h6": 1675,
    "b6c8": 1676,
    "a8f3": 1677,
    "a4a1": 1678,
    "b1h1": 1679,
    "a2e6": 1680,
    "a6g6": 1681,
    "h4e1": 1682,
    "e1a5": 1683,
    "g1d1": 1684,
    "e6h6": 1685,
    "e1g2": 1686,
    "c6h6": 1687,
    "h2h7": 1688,
    "c7g3": 1689,
    "b2b5": 1690,
    "d2h2": 1691,
    "b3h3": 1692,
    "h3b3": 1693,
    "g8g1": 1694,
    "a8g2": 1695,
    "a4e8": 1696,
    "a4a8": 1697,
    "g2e1": 1698,
    "f7g8q": 1699,
    "f2a7": 1700,
    "h3h7": 1701,
    "h8d4": 1702,
    "e6a2": 1703,
    "a4h4": 1704,
    "a1f6": 1705,
    "a7e7": 1706,
    "g2c2": 1707,
    "h1d5": 1708,
    "f3b3": 1709,
    "a6a2": 1710,
    "h2b8": 1711,
    "f5h3": 1712,
    "g5g2": 1713,
    "h3g1": 1714,
    "a1a5": 1715,
    "g7c7": 1716,
    "a1b3": 1717,
    "f1h2": 1718,
    "a3h3": 1719,
    "g7g4": 1720,
    "c2c8": 1721,
    "b4b7": 1722,
    "a1g7": 1723,
    "b2h2": 1724,
    "f7h8": 1725,
    "h8g6": 1726,
    "c2a1": 1727,
    "a1c2": 1728,
    "b7a5": 1729,
    "f7b3": 1730,
    "e5h8": 1731,
    "c2h2": 1732,
    "a2c1": 1733,
    "h7h4": 1734,
    "h7f6": 1735,
    "g8a8": 1736,
    "c1a2": 1737,
    "f4f1": 1738,
    "c4a4": 1739,
    "h7b7": 1740,
    "h2f2": 1741,
    "g2b2": 1742,
    "g1d4": 1743,
    "b5h5": 1744,
    "h3c3": 1745,
    "h5h1": 1746,
    "h7c7": 1747,
    "g7f8q": 1748,
    "g5g7": 1749,
    "h5c5": 1750,
    "b5g5": 1751,
    "h5b5": 1752,
    "g4g8": 1753,
    "f2d1": 1754,
    "b5e5": 1755,
    "d1f2": 1756,
    "f7h5": 1757,
    "h2b2": 1758,
    "h6b6": 1759,
    "h4c4": 1760,
    "d7c8q": 1761,
    "a5e1": 1762,
    "b2a4": 1763,
    "f1d2": 1764,
    "a2c4": 1765,
    "a6e6": 1766,
    "a4f4": 1767,
    "g7e8": 1768,
    "b4f4": 1769,
    "h5d1": 1770,
    "h2c2": 1771,
    "f2h3": 1772,
    "a5a1": 1773,
    "a5g5": 1774,
    "g2g7": 1775,
    "h4a4": 1776,
    "b4g4": 1777,
    "h1a8": 1778,
    "a2g8": 1779,
    "a3g3": 1780,
    "e5a1": 1781,
    "f2f1n": 1782,
    "e2e1n": 1783,
    "h4b4": 1784,
    "h2h1r": 1785,
    "g1b6": 1786,
    "g8a2": 1787,
    "g6a6": 1788,
    "b3g3": 1789,
    "a5h5": 1790,
    "f5a5": 1791,
    "c7d8q": 1792,
    "c3h3": 1793,
    "f7a2": 1794,
    "g5c5": 1795,
    "f2a2": 1796,
    "g3g8": 1797,
    "b3f3": 1798,
    "b2h8": 1799,
    "a2b1q": 1800,
    "a8h1": 1801,
    "g4c4": 1802,
    "h7d7": 1803,
    "c6h1": 1804,
    "h7c2": 1805,
    "e7f8q": 1806,
    "f4a4": 1807,
    "g8c4": 1808,
    "h1f2": 1809,
    "g3a3": 1810,
    "h7b1": 1811,
    "e2h2": 1812,
    "a3f3": 1813,
    "c3h8": 1814,
    "a2f7": 1815,
    "b7h1": 1816,
    "g2g8": 1817,
    "h8f7": 1818,
    "b1h7": 1819,
    "b2a1q": 1820,
    "g8b3": 1821,
    "h2g1q": 1822,
    "h2d2": 1823,
    "h8b2": 1824,
    "a3a8": 1825,
    "e2f1q": 1826,
    "d7e8q": 1827,
    "g5b5": 1828,
    "f2e1q": 1829,
    "d2e1q": 1830,
    "g7h8q": 1831,
    "d2d1n": 1832,
    "d2c1q": 1833,
    "f7f8r": 1834,
    "e2d1q": 1835,
    "*": 1836,
    "f2g1q": 1837,
    "e7d8q": 1838,
    "f7e8q": 1839,
    "a1h8": 1840,
    "a7g1": 1841,
    "e7e8n": 1842,
    "b7a8q": 1843,
    "b2c1q": 1844,
    "a7b8q": 1845,
    "g2h1q": 1846,
    "h7g8q": 1847,
    "h7h8r": 1848,
    "c2c1r": 1849,
    "d7d8n": 1850,
    "a2a1r": 1851,
    "b7b8r": 1852,
    "c7c8n": 1853,
    "b7c8q": 1854,
    "g7g8b": 1855,
    "g2g1n": 1856,
    "c2b1q": 1857,
    "c2d1q": 1858,
    "d2d1r": 1859,
    "e7d8r": 1860,
    "e7e8b": 1861,
    "g7f8r": 1862,
    "g7g8n": 1863,
    "c7d8r": 1864,
    "a7a8r": 1865,
    "e7e8r": 1866,
    "b7c8b": 1867,
    "b7b8n": 1868,
    "a7a8n": 1869,
    "e7f8r": 1870,
    "g7g8r": 1871,
    "e7d8n": 1872,
    "a2b1r": 1873,
    "b2b1r": 1874,
    "f7f8n": 1875,
    "a2a1n": 1876,
    "c2c1n": 1877,
    "g7f8n": 1878,
    "c7c8r": 1879,
    "g2g1r": 1880,
    "a2a1b": 1881
}