{
    "UNK": 0,
    "<|startofgame|>": 1,
    "<|endofgame|>": 2,
    "d2d4": 3,
    "g8f6": 4,
    "c1f4": 5,
    "g7g6": 6,
    "e2e3": 7,
    "f8g7": 8,
    "g1f3": 9,
    "e8g8": 10,
    "h2h3": 11,
    "d7d6": 12,
    "f1e2": 13,
    "c7c6": 14,
    "e1g1": 15,
    "b8d7": 16,
    "f4h2": 17,
    "f8e8": 18,
    "c2c4": 19,
    "e7e5": 20,
    "b1c3": 21,
    "e5e4": 22,
    "f3d2": 23,
    "d7f8": 24,
    "d1c2": 25,
    "c8f5": 26,
    "c2b3": 27,
    "a8b8": 28,
    "c4c5": 29,
    "d6d5": 30,
    "h2b8": 31,
    "d8b8": 32,
    "b3d1": 33,
    "h7h5": 34,
    "f1e1": 35,
    "h5h4": 36,
    "f2f3": 37,
    "f8h7": 38,
    "f3e4": 39,
    "d5e4": 40,
    "d2c4": 41,
    "e8d8": 42,
    "c4d6": 43,
    "d8d6": 44,
    "c5d6": 45,
    "b8d6": 46,
    "e1f1": 47,
    "h7g5": 48,
    "d1e1": 49,
    "g5h3": 50,
    "g2h3": 51,
    "f5h3": 52,
    "e1h4": 53,
    "h3f1": 54,
    "a1f1": 55,
    "f6d5": 56,
    "c3e4": 57,
    "d6e6": 58,
    "h4d8": 59,
    "g8h7": 60,
    "e4g5": 61,
    "h7h6": 62,
    "g5e6": 63,
    "f7e6": 64,
    "d8h4": 65,
    "1-0": 66,
    "b7b6": 67,
    "e2e4": 68,
    "c8b7": 69,
    "b8c6": 70,
    "c1e3": 71,
    "d1d2": 72,
    "d8d7": 73,
    "d4d5": 74,
    "c6b4": 75,
    "a2a3": 76,
    "b4a6": 77,
    "b2b4": 78,
    "e8c8": 79,
    "a1b1": 80,
    "e7e6": 81,
    "c3a4": 82,
    "g8e7": 83,
    "b4b5": 84,
    "a6c5": 85,
    "a4c5": 86,
    "d6c5": 87,
    "d2c2": 88,
    "f7f5": 89,
    "e1f2": 90,
    "f5e4": 91,
    "e6d5": 92,
    "f3g5": 93,
    "h8f8": 94,
    "f2e2": 95,
    "d7g4": 96,
    "e2e1": 97,
    "e7f5": 98,
    "c2e2": 99,
    "g4h4": 100,
    "e2f2": 101,
    "h4f2": 102,
    "e3f2": 103,
    "e4e3": 104,
    "f2g3": 105,
    "g7c3": 106,
    "e1e2": 107,
    "d8d2": 108,
    "d2b2": 109,
    "e1d1": 110,
    "b2b1": 111,
    "b1f1": 112,
    "h1f1": 113,
    "c3d4": 114,
    "e6d4": 115,
    "c5d4": 116,
    "b7g2": 117,
    "g3f4": 118,
    "g2e4": 119,
    "d4d3": 120,
    "0-1": 121,
    "d7d5": 122,
    "e4e5": 123,
    "b1d2": 124,
    "d2b3": 125,
    "c6c5": 126,
    "d4c5": 127,
    "a7a5": 128,
    "a2a4": 129,
    "d8c7": 130,
    "f8c5": 131,
    "f3d4": 132,
    "b3d4": 133,
    "f2f4": 134,
    "d4b5": 135,
    "c7d7": 136,
    "b5d6": 137,
    "e8f8": 138,
    "f1d3": 139,
    "d3f5": 140,
    "d6f5": 141,
    "g6f5": 142,
    "f8e7": 143,
    "h8g8": 144,
    "e7e8": 145,
    "b2b3": 146,
    "d7e7": 147,
    "e8d7": 148,
    "g8g4": 149,
    "a8g8": 150,
    "g2g3": 151,
    "d5d4": 152,
    "e3d4": 153,
    "c6d4": 154,
    "f2d4": 155,
    "d7c8": 156,
    "d4a7": 157,
    "e7h4": 158,
    "a7a8": 159,
    "c8c7": 160,
    "a8a5": 161,
    "a1d1": 162,
    "a5c5": 163,
    "c5c8": 164,
    "e8e7": 165,
    "d1d7": 166,
    "c1b2": 167,
    "c7c5": 168,
    "c8b8": 169,
    "e3e4": 170,
    "g7g5": 171,
    "d6e5": 172,
    "d4e5": 173,
    "f6h5": 174,
    "d2e4": 175,
    "h5f4": 176,
    "e4d6": 177,
    "e7d6": 178,
    "e5d6": 179,
    "c7d6": 180,
    "d6c7": 181,
    "g5g4": 182,
    "h3g4": 183,
    "f4e2": 184,
    "d8g8": 185,
    "f3e5": 186,
    "g4g3": 187,
    "b3d3": 188,
    "d6e7": 189,
    "f7f6": 190,
    "e5c6": 191,
    "b7c6": 192,
    "b5c6": 193,
    "b8c7": 194,
    "d3d7": 195,
    "e7d7": 196,
    "c6d7": 197,
    "b2f6": 198,
    "f6e5": 199,
    "g4c4": 200,
    "e5f4": 201,
    "d7c6": 202,
    "e3e2": 203,
    "c6d5": 204,
    "e2d2": 205,
    "c4d4": 206,
    "g1f2": 207,
    "e6e5": 208,
    "f4f5": 209,
    "e4f5": 210,
    "e2d3": 211,
    "f5e5": 212,
    "e5d5": 213,
    "d3e2": 214,
    "d5c5": 215,
    "c5c4": 216,
    "c4b4": 217,
    "c2d2": 218,
    "b4a4": 219,
    "d2d3": 220,
    "a4b4": 221,
    "d3d4": 222,
    "a5a4": 223,
    "a4a3": 224,
    "e5f6": 225,
    "a3a2": 226,
    "f6g7": 227,
    "b6b5": 228,
    "g7h7": 229,
    "b4c3": 230,
    "b5b4": 231,
    "f6e4": 232,
    "f4g3": 233,
    "e2h5": 234,
    "h3h4": 235,
    "d6b7": 236,
    "d8g5": 237,
    "g3h4": 238,
    "g5h4": 239,
    "h5f7": 240,
    "f8f7": 241,
    "h4h3": 242,
    "b7d6": 243,
    "f7f8": 244,
    "e6f5": 245,
    "g8g5": 246,
    "d2b4": 247,
    "g5h5": 248,
    "c5c6": 249,
    "f8g8": 250,
    "b4c4": 251,
    "g8g7": 252,
    "d7f6": 253,
    "f1d1": 254,
    "h3h1": 255,
    "e5d4": 256,
    "f8b4": 257,
    "b4e7": 258,
    "d5c6": 259,
    "g5f3": 260,
    "c1d2": 261,
    "f6g4": 262,
    "g4f6": 263,
    "e8e6": 264,
    "e1e6": 265,
    "d7e6": 266,
    "d8e7": 267,
    "e7f6": 268,
    "h6g5": 269,
    "c2c1": 270,
    "d2g5": 271,
    "f6d4": 272,
    "g5e3": 273,
    "d4f6": 274,
    "e3g5": 275,
    "d3h7": 276,
    "d1d4": 277,
    "c1c2": 278,
    "c2d3": 279,
    "g5f6": 280,
    "a8f8": 281,
    "f4e5": 282,
    "d4h4": 283,
    "h7g8": 284,
    "h4h8": 285,
    "g8f7": 286,
    "h8g7": 287,
    "d7d1": 288,
    "g1h2": 289,
    "f6g5": 290,
    "g6f6": 291,
    "f6f4": 292,
    "e4d3": 293,
    "d7d4": 294,
    "f4d2": 295,
    "d3c4": 296,
    "d1e2": 297,
    "c3d5": 298,
    "d5c3": 299,
    "e5h5": 300,
    "c8g4": 301,
    "e2b5": 302,
    "b5b7": 303,
    "a8d8": 304,
    "b7d5": 305,
    "d5h5": 306,
    "g4h5": 307,
    "d2f3": 308,
    "d1d8": 309,
    "h8e8": 310,
    "d4c3": 311,
    "f2g1": 312,
    "e4c3": 313,
    "b2c3": 314,
    "h5f3": 315,
    "g2f3": 316,
    "e8e3": 317,
    "f1c4": 318,
    "e3c3": 319,
    "c4b3": 320,
    "c3f3": 321,
    "g1g2": 322,
    "f3f4": 323,
    "h1d1": 324,
    "d1d3": 325,
    "d3c3": 326,
    "c7b6": 327,
    "g3g2": 328,
    "c3c4": 329,
    "b6c5": 330,
    "b4g4": 331,
    "b3e6": 332,
    "e6b3": 333,
    "c5b5": 334,
    "b3a4": 335,
    "b5c5": 336,
    "a4e8": 337,
    "e5e2": 338,
    "e2c2": 339,
    "e8f7": 340,
    "c2h2": 341,
    "g4g5": 342,
    "c5b4": 343,
    "f3g4": 344,
    "h2g2": 345,
    "g2f2": 346,
    "b4a3": 347,
    "f7g6": 348,
    "f2h2": 349,
    "h4g5": 350,
    "h2b2": 351,
    "g6h7": 352,
    "b2b5": 353,
    "g5h6": 354,
    "b5b6": 355,
    "g4g6": 356,
    "b6b7": 357,
    "g6g5": 358,
    "g5a5": 359,
    "h6g7": 360,
    "b6h6": 361,
    "h7g6": 362,
    "h6h7": 363,
    "g7f8": 364,
    "h7f7": 365,
    "g6f7": 366,
    "a3b4": 367,
    "c2c3": 368,
    "d8b6": 369,
    "d1b3": 370,
    "b3b6": 371,
    "a7b6": 372,
    "f3h4": 373,
    "f5c2": 374,
    "e2d1": 375,
    "c2d1": 376,
    "f6d7": 377,
    "h4f3": 378,
    "d7b6": 379,
    "d1b1": 380,
    "a8a4": 381,
    "a1a4": 382,
    "b6a4": 383,
    "b1b7": 384,
    "a4c3": 385,
    "b7c7": 386,
    "c6e5": 387,
    "e7b4": 388,
    "c7b7": 389,
    "c3a2": 390,
    "d2f1": 391,
    "f8c8": 392,
    "d4f3": 393,
    "g7f6": 394,
    "b7a7": 395,
    "a2b4": 396,
    "c3e5": 397,
    "h4g6": 398,
    "g6e5": 399,
    "a8a1": 400,
    "c4c3": 401,
    "f1g3": 402,
    "g1f1": 403,
    "c3c2": 404,
    "g3e2": 405,
    "f5d3": 406,
    "g1e2": 407,
    "d5c4": 408,
    "e2d4": 409,
    "d4c6": 410,
    "b6c6": 411,
    "c4c6": 412,
    "e7d5": 413,
    "a1c1": 414,
    "e4c5": 415,
    "c1c5": 416,
    "f1c1": 417,
    "h8c8": 418,
    "a8a6": 419,
    "b8b5": 420,
    "c6b5": 421,
    "a6c6": 422,
    "c2c6": 423,
    "d5b6": 424,
    "d2e3": 425,
    "g3g4": 426,
    "h5g4": 427,
    "b6c4": 428,
    "f4g5": 429,
    "c4e5": 430,
    "d3e3": 431,
    "e5g4": 432,
    "e3f4": 433,
    "g4f2": 434,
    "c3f6": 435,
    "f2e4": 436,
    "f6d8": 437,
    "e4d2": 438,
    "d8f6": 439,
    "f4g4": 440,
    "g4f5": 441,
    "f5f4": 442,
    "f4f3": 443,
    "d5e6": 444,
    "f5e6": 445,
    "f5g6": 446,
    "f3e2": 447,
    "g6h5": 448,
    "e2f3": 449,
    "h5g6": 450,
    "1/2-1/2": 451,
    "c8d7": 452,
    "c1g5": 453,
    "d4d2": 454,
    "g5f4": 455,
    "e1c1": 456,
    "a8c8": 457,
    "c1b1": 458,
    "d8a5": 459,
    "d2a5": 460,
    "c6a5": 461,
    "f1b5": 462,
    "a5c6": 463,
    "a7a6": 464,
    "b5a4": 465,
    "b7b5": 466,
    "a4b3": 467,
    "d4b3": 468,
    "a2b3": 469,
    "c8c5": 470,
    "b3b4": 471,
    "e7d8": 472,
    "d5e3": 473,
    "h4f5": 474,
    "e3d5": 475,
    "d1d5": 476,
    "g8d8": 477,
    "b1c2": 478,
    "c6b6": 479,
    "d1a1": 480,
    "a1a2": 481,
    "b8h8": 482,
    "f5h6": 483,
    "h8a8": 484,
    "d5d1": 485,
    "b6e3": 486,
    "h6f5": 487,
    "h2h4": 488,
    "h4h5": 489,
    "e4d5": 490,
    "a2a1": 491,
    "c8c6": 492,
    "f1g2": 493,
    "c6e7": 494,
    "g4h3": 495,
    "f1f2": 496,
    "h3g2": 497,
    "f2g2": 498,
    "f5d4": 499,
    "h5f6": 500,
    "d4e2": 501,
    "g1h1": 502,
    "e2g3": 503,
    "e4g3": 504,
    "f3f2": 505,
    "h6h5": 506,
    "g3e4": 507,
    "f6f3": 508,
    "f8d6": 509,
    "f4d6": 510,
    "e7g6": 511,
    "d6f8": 512,
    "g6h4": 513,
    "c8e6": 514,
    "e2g4": 515,
    "e6g4": 516,
    "d1g4": 517,
    "f1f8": 518,
    "g6f8": 519,
    "g8f8": 520,
    "g4g7": 521,
    "g7d4": 522,
    "f1f6": 523,
    "c6c7": 524,
    "d4d6": 525,
    "c7c8": 526,
    "f6f8": 527,
    "e4f2": 528,
    "c4d5": 529,
    "g5e7": 530,
    "d5d6": 531,
    "e7g7": 532,
    "c3e2": 533,
    "h2g3": 534,
    "h1h4": 535,
    "h8h4": 536,
    "e4f6": 537,
    "f8g6": 538,
    "f1h3": 539,
    "d7e8": 540,
    "e8h5": 541,
    "d8c8": 542,
    "g7g2": 543,
    "e5f3": 544,
    "f8f3": 545,
    "c5b6": 546,
    "e7g5": 547,
    "a8a3": 548,
    "e3d2": 549,
    "f6c3": 550,
    "b1b8": 551,
    "g4e6": 552,
    "g8h8": 553,
    "a2f2": 554,
    "d4f2": 555,
    "b8c8": 556,
    "d3g6": 557,
    "c5h5": 558,
    "c5e7": 559,
    "d5f6": 560,
    "d6f6": 561,
    "d3e4": 562,
    "d8d4": 563,
    "a3a4": 564,
    "d4b4": 565,
    "b4b2": 566,
    "e5e7": 567,
    "c3b2": 568,
    "d7c5": 569,
    "g7h6": 570,
    "b2d4": 571,
    "c5a5": 572,
    "g2f1": 573,
    "c8a8": 574,
    "f5g4": 575,
    "g4d7": 576,
    "c5c3": 577,
    "c5f8": 578,
    "c8f8": 579,
    "c3c7": 580,
    "d7b5": 581,
    "d3b5": 582,
    "g2g4": 583,
    "e3g1": 584,
    "g4h6": 585,
    "g1b6": 586,
    "d6b5": 587,
    "f8a8": 588,
    "h6f7": 589,
    "f1f7": 590,
    "d1f1": 591,
    "f7g8": 592,
    "a4a5": 593,
    "d2f4": 594,
    "f3g1": 595,
    "e4f3": 596,
    "f8f4": 597,
    "b5c4": 598,
    "e2c4": 599,
    "a8e8": 600,
    "d1c1": 601,
    "c1c4": 602,
    "g4f4": 603,
    "b2a3": 604,
    "a3b2": 605,
    "d7f7": 606,
    "b7e7": 607,
    "d6b8": 608,
    "f4f1": 609,
    "f7f1": 610,
    "f2f7": 611,
    "b3d2": 612,
    "b6a6": 613,
    "a6f6": 614,
    "g2b7": 615,
    "c8e8": 616,
    "e5c4": 617,
    "f5c8": 618,
    "c8h3": 619,
    "c4e3": 620,
    "d2d1": 621,
    "f3d1": 622,
    "d4b2": 623,
    "e8b8": 624,
    "e3c4": 625,
    "c4d2": 626,
    "b8d8": 627,
    "b1b5": 628,
    "f8d8": 629,
    "b5d5": 630,
    "d4g7": 631,
    "e1e8": 632,
    "d8e8": 633,
    "d6e8": 634,
    "e8f6": 635,
    "a4b6": 636,
    "b6d5": 637,
    "g4f3": 638,
    "d5f4": 639,
    "g4d1": 640,
    "f4e6": 641,
    "e6f4": 642,
    "c6a4": 643,
    "a4c2": 644,
    "f6h4": 645,
    "h4g3": 646,
    "f4h3": 647,
    "h1g2": 648,
    "g3b8": 649,
    "c2e4": 650,
    "g2g1": 651,
    "c4b2": 652,
    "d3c2": 653,
    "b2c4": 654,
    "c4a3": 655,
    "c3b4": 656,
    "h3g5": 657,
    "f2e3": 658,
    "b2c1": 659,
    "f2f1q": 660,
    "e5e6": 661,
    "e4c6": 662,
    "e6d6": 663,
    "f1f4": 664,
    "f4f8": 665,
    "e3d3": 666,
    "c6b7": 667,
    "c4b5": 668,
    "b4b7": 669,
    "f4b8": 670,
    "b8b2": 671,
    "e4g2": 672,
    "e5f7": 673,
    "a4d7": 674,
    "f7h6": 675,
    "e3h6": 676,
    "f2f8": 677,
    "h6f8": 678,
    "f8f2": 679,
    "f2f5": 680,
    "d5f5": 681,
    "d4b6": 682,
    "b6c7": 683,
    "f3e3": 684,
    "d6f4": 685,
    "d3d2": 686,
    "e2c3": 687,
    "f4c1": 688,
    "e8e1": 689,
    "c1e1": 690,
    "c7f4": 691,
    "e1e4": 692,
    "e4e7": 693,
    "e7e3": 694,
    "e3e7": 695,
    "e7h7": 696,
    "h5h6": 697,
    "h7h8q": 698,
    "h8c3": 699,
    "b3c4": 700,
    "c3d3": 701,
    "c4d3": 702,
    "c4a4": 703,
    "e7c5": 704,
    "h4f6": 705,
    "d5b3": 706,
    "b3c2": 707,
    "b3c3": 708,
    "c8c3": 709,
    "c1c3": 710,
    "b4a2": 711,
    "c3c1": 712,
    "b1c1": 713,
    "a2c1": 714,
    "d4e6": 715,
    "e1d2": 716,
    "d2c1": 717,
    "a6a5": 718,
    "c5d5": 719,
    "f5f6": 720,
    "f6f7": 721,
    "e6f7": 722,
    "a2a1q": 723,
    "a1e1": 724,
    "h4g4": 725,
    "b7b8": 726,
    "b8a8": 727,
    "a8a7": 728,
    "h3h2": 729,
    "a7b8": 730,
    "h2h1q": 731,
    "h1h3": 732,
    "h3f3": 733,
    "g4e4": 734,
    "b8a7": 735,
    "f3d3": 736,
    "e4c4": 737,
    "b6a7": 738,
    "d3b3": 739,
    "c4b6": 740,
    "b6b3": 741,
    "f4e3": 742,
    "c6g2": 743,
    "b8b7": 744,
    "d1d6": 745,
    "d6a6": 746,
    "a1a6": 747,
    "e4d4": 748,
    "d4c4": 749,
    "c5e5": 750,
    "b7a6": 751,
    "a6a7": 752,
    "f6g6": 753,
    "b7b8q": 754,
    "f6f5": 755,
    "h5h8": 756,
    "f5g5": 757,
    "c3b5": 758,
    "f3e1": 759,
    "e4b1": 760,
    "d6c6": 761,
    "d2c3": 762,
    "e1g2": 763,
    "g2e1": 764,
    "e1c2": 765,
    "e3f3": 766,
    "f3g2": 767,
    "c2a3": 768,
    "a3c2": 769,
    "c2e1": 770,
    "c3d2": 771,
    "e1f3": 772,
    "d1f3": 773,
    "e5c3": 774,
    "b3d5": 775,
    "f3g3": 776,
    "d5g5": 777,
    "d8d5": 778,
    "g3f3": 779,
    "f3d5": 780,
    "c1c8": 781,
    "e4e8": 782,
    "f6e7": 783,
    "d5f7": 784,
    "g7f7": 785,
    "e8h8": 786,
    "h7g7": 787,
    "c8g8": 788,
    "f8f6": 789,
    "e6f6": 790,
    "h8b8": 791,
    "b5c7": 792,
    "c7a8": 793,
    "d8a8": 794,
    "h8h5": 795,
    "e2e6": 796,
    "f8e6": 797,
    "e1e5": 798,
    "e6g5": 799,
    "h5g5": 800,
    "a6d6": 801,
    "b7c8": 802,
    "e5e8": 803,
    "f8h8": 804,
    "h8h7": 805,
    "h7h8": 806,
    "d6b4": 807,
    "h7c2": 808,
    "e3e8": 809,
    "g5f7": 810,
    "f7d8": 811,
    "e8e4": 812,
    "f4c7": 813,
    "d8f8": 814,
    "c3b1": 815,
    "g5g6": 816,
    "h1e1": 817,
    "c4e6": 818,
    "e6c4": 819,
    "d8d1": 820,
    "c6g6": 821,
    "e7f7": 822,
    "f7f3": 823,
    "e3b6": 824,
    "h1h2": 825,
    "d1g1": 826,
    "f3f6": 827,
    "g4e3": 828,
    "g3h5": 829,
    "e3g2": 830,
    "g2g7": 831,
    "g7c7": 832,
    "f5f1": 833,
    "f1h1": 834,
    "a5a6": 835,
    "h4h1": 836,
    "b6b8": 837,
    "h1a1": 838,
    "a1a3": 839,
    "a3a7": 840,
    "e7c6": 841,
    "b7d7": 842,
    "e6e1": 843,
    "f7f4": 844,
    "b4c6": 845,
    "g2d5": 846,
    "d5g2": 847,
    "c3c6": 848,
    "g5d5": 849,
    "e1e7": 850,
    "f4h4": 851,
    "d2h2": 852,
    "h4h2": 853,
    "f8f5": 854,
    "f5b5": 855,
    "b5f5": 856,
    "f6e8": 857,
    "e8d6": 858,
    "f5g3": 859,
    "c2a4": 860,
    "f2e1": 861,
    "e1c3": 862,
    "f4d3": 863,
    "f6d6": 864,
    "g5f5": 865,
    "d6d3": 866,
    "d3d5": 867,
    "c2b2": 868,
    "h4c4": 869,
    "c5g5": 870,
    "e1b1": 871,
    "a5a3": 872,
    "b1b3": 873,
    "b3b2": 874,
    "a1g1": 875,
    "g1g3": 876,
    "g3h3": 877,
    "d4e4": 878,
    "h2e2": 879,
    "e4f4": 880,
    "e2e7": 881,
    "e3c5": 882,
    "b6b2": 883,
    "c5d3": 884,
    "d3c1": 885,
    "h1c1": 886,
    "c8c1": 887,
    "b4d2": 888,
    "c4g8": 889,
    "a6b5": 890,
    "a4b5": 891,
    "b2b6": 892,
    "f5h4": 893,
    "f3f5": 894,
    "h4e4": 895,
    "f3f7": 896,
    "g4c8": 897,
    "f7c4": 898,
    "c4c2": 899,
    "e3e1": 900,
    "d2d1q": 901,
    "h1g1": 902,
    "h8h1": 903,
    "g2h1": 904,
    "e6d7": 905,
    "b4b3": 906,
    "h3d7": 907,
    "b8b4": 908,
    "d7d8": 909,
    "b4b8": 910,
    "h4h7": 911,
    "c8d8": 912,
    "g4e2": 913,
    "d7e5": 914,
    "a5e5": 915,
    "c3d1": 916,
    "e4g6": 917,
    "d1c3": 918,
    "g6d3": 919,
    "e3g3": 920,
    "c8a6": 921,
    "a6b7": 922,
    "d3g3": 923,
    "c6e4": 924,
    "g3g5": 925,
    "e4e2": 926,
    "g5g3": 927,
    "f3a8": 928,
    "a8b7": 929,
    "d2d6": 930,
    "b7f3": 931,
    "d6d4": 932,
    "c6c8": 933,
    "c6a6": 934,
    "a6g6": 935,
    "g6g3": 936,
    "e2e1q": 937,
    "a7a8q": 938,
    "h3g3": 939,
    "g3f2": 940,
    "b4c5": 941,
    "b3b5": 942,
    "e5g6": 943,
    "a3a6": 944,
    "c1a3": 945,
    "c3a1": 946,
    "d5b5": 947,
    "h2g1": 948,
    "a2e2": 949,
    "b5b8": 950,
    "c7b8": 951,
    "a6c8": 952,
    "e6a6": 953,
    "c2b1": 954,
    "b1a1": 955,
    "e2b2": 956,
    "b6a5": 957,
    "a5e1": 958,
    "b8e5": 959,
    "e5d7": 960,
    "d7f5": 961,
    "d6h2": 962,
    "f6h6": 963,
    "f1f3": 964,
    "h6h2": 965,
    "g3e5": 966,
    "e5g7": 967,
    "e1e3": 968,
    "g5c1": 969,
    "a5b4": 970,
    "a8a2": 971,
    "a2d2": 972,
    "g8a8": 973,
    "a3a1": 974,
    "g3e3": 975,
    "c1d1": 976,
    "d3d1": 977,
    "d1h1": 978,
    "h1h5": 979,
    "h5e5": 980,
    "d5d7": 981,
    "f4e4": 982,
    "f6e6": 983,
    "c4c7": 984,
    "b2b1q": 985,
    "b1b4": 986,
    "c7c3": 987,
    "d3b4": 988,
    "b4c2": 989,
    "g3f1": 990,
    "f1d2": 991,
    "c2a1": 992,
    "a1c2": 993,
    "c2d4": 994,
    "d4c2": 995,
    "e2f4": 996,
    "f4d5": 997,
    "c1c6": 998,
    "b2e5": 999,
    "e5c7": 1000,
    "d5c7": 1001,
    "c7b5": 1002,
    "b5a3": 1003,
    "a3c4": 1004,
    "c5a6": 1005,
    "a6c7": 1006,
    "c5b7": 1007,
    "c7a6": 1008,
    "a6b4": 1009,
    "b4d3": 1010,
    "f3h2": 1011,
    "g2h2": 1012,
    "c5e3": 1013,
    "b6d4": 1014,
    "d4e3": 1015,
    "e8e5": 1016,
    "b1a2": 1017,
    "f7b7": 1018,
    "e5c5": 1019,
    "f8b8": 1020,
    "d7h3": 1021,
    "d2b1": 1022,
    "e2c1": 1023,
    "c3e3": 1024,
    "e3a7": 1025,
    "a7c5": 1026,
    "e6g6": 1027,
    "g6e8": 1028,
    "g8e8": 1029,
    "g8g1": 1030,
    "c7g7": 1031,
    "g2d2": 1032,
    "d2g2": 1033,
    "g7g4": 1034,
    "h2h1": 1035,
    "b7e4": 1036,
    "a1a7": 1037,
    "b5b2": 1038,
    "b2b8": 1039,
    "c3a5": 1040,
    "e1a1": 1041,
    "a1a5": 1042,
    "a5a1": 1043,
    "a7a2": 1044,
    "c4a5": 1045,
    "c7a5": 1046,
    "a5a2": 1047,
    "c5e6": 1048,
    "a2a5": 1049,
    "h3f5": 1050,
    "a4a6": 1051,
    "d2h6": 1052,
    "h6h3": 1053,
    "b8e8": 1054,
    "h3e6": 1055,
    "e6e8": 1056,
    "b1b2": 1057,
    "g4b4": 1058,
    "b4d4": 1059,
    "c2c1q": 1060,
    "f2f1": 1061,
    "c5b3": 1062,
    "g7h8": 1063,
    "h5g3": 1064,
    "h4h6": 1065,
    "b6f6": 1066,
    "g7e5": 1067,
    "g4e5": 1068,
    "g5d2": 1069,
    "h6e3": 1070,
    "d5e5": 1071,
    "c6d8": 1072,
    "d8e6": 1073,
    "e6c5": 1074,
    "a2g2": 1075,
    "c5e4": 1076,
    "a3d6": 1077,
    "e6e7": 1078,
    "c7e6": 1079,
    "d6d7": 1080,
    "g8b8": 1081,
    "b8g8": 1082,
    "d7d8q": 1083,
    "e4h7": 1084,
    "h7e4": 1085,
    "d6a3": 1086,
    "e3c1": 1087,
    "e6g8": 1088,
    "b2e2": 1089,
    "e5a5": 1090,
    "d5b7": 1091,
    "d6f7": 1092,
    "f7e7": 1093,
    "e7e1": 1094,
    "d2e1": 1095,
    "c7e8": 1096,
    "d6c8": 1097,
    "d6d8": 1098,
    "e8c7": 1099,
    "e1d3": 1100,
    "d3b2": 1101,
    "a5b6": 1102,
    "b3a3": 1103,
    "g6g7": 1104,
    "g7g8q": 1105,
    "g8c8": 1106,
    "a3b3": 1107,
    "c8c4": 1108,
    "b3b7": 1109,
    "b3c5": 1110,
    "b7a8": 1111,
    "g8h6": 1112,
    "f1b1": 1113,
    "d7a4": 1114,
    "b8b6": 1115,
    "b6b1": 1116,
    "b8b1": 1117,
    "b2a2": 1118,
    "h3f2": 1119,
    "f2g4": 1120,
    "a4d1": 1121,
    "a2c2": 1122,
    "e7f8": 1123,
    "d4f5": 1124,
    "h4e7": 1125,
    "g5h7": 1126,
    "c2g6": 1127,
    "c5f2": 1128,
    "h5h7": 1129,
    "f4h6": 1130,
    "b5a6": 1131,
    "c6e8": 1132,
    "e4b7": 1133,
    "e8c6": 1134,
    "c6f3": 1135,
    "a2b2": 1136,
    "a6c4": 1137,
    "d7d3": 1138,
    "c3b3": 1139,
    "b3a2": 1140,
    "a2b1": 1141,
    "b3e3": 1142,
    "e3b3": 1143,
    "c7e5": 1144,
    "e5e3": 1145,
    "h5g7": 1146,
    "g7e6": 1147,
    "a4c4": 1148,
    "c4e4": 1149,
    "c2d1q": 1150,
    "a5c3": 1151,
    "f5e3": 1152,
    "f1a1": 1153,
    "e5d3": 1154,
    "d3f4": 1155,
    "d3a6": 1156,
    "d4d1": 1157,
    "e3e5": 1158,
    "h2g4": 1159,
    "e5b8": 1160,
    "g1h3": 1161,
    "d6g3": 1162,
    "b5d3": 1163,
    "f2d3": 1164,
    "a5c4": 1165,
    "g3d3": 1166,
    "d3f3": 1167,
    "g8g3": 1168,
    "g3c3": 1169,
    "c3g3": 1170,
    "h1h7": 1171,
    "h7a7": 1172,
    "a5a8": 1173,
    "a4a2": 1174,
    "a7d4": 1175,
    "h4g2": 1176,
    "f6h8": 1177,
    "b6b4": 1178,
    "d1a4": 1179,
    "b6d8": 1180,
    "a4c6": 1181,
    "b7b2": 1182,
    "a3e7": 1183,
    "h6g4": 1184,
    "g4h2": 1185,
    "b2c2": 1186,
    "c2c7": 1187,
    "c1c7": 1188,
    "b5d7": 1189,
    "f7d7": 1190,
    "a7d7": 1191,
    "e6g7": 1192,
    "g6e4": 1193,
    "e8e2": 1194,
    "e4g4": 1195,
    "h5h3": 1196,
    "e4e1": 1197,
    "h3c3": 1198,
    "b3f3": 1199,
    "c2e3": 1200,
    "g3h1": 1201,
    "h1g3": 1202,
    "g4d4": 1203,
    "d4a4": 1204,
    "a4a7": 1205,
    "a7a3": 1206,
    "a3e3": 1207,
    "a4g4": 1208,
    "b1h1": 1209,
    "f4f6": 1210,
    "b5c3": 1211,
    "g5e4": 1212,
    "e2a2": 1213,
    "d5e7": 1214,
    "f7e5": 1215,
    "c6d6": 1216,
    "h6d6": 1217,
    "b5a5": 1218,
    "d5f3": 1219,
    "e2f1": 1220,
    "a5d5": 1221,
    "d5d2": 1222,
    "d7c7": 1223,
    "h7d3": 1224,
    "d3f1": 1225,
    "c2f5": 1226,
    "g8g2": 1227,
    "f5h5": 1228,
    "c7g3": 1229,
    "c4f7": 1230,
    "g6c6": 1231,
    "c6f6": 1232,
    "a7e7": 1233,
    "h5h1": 1234,
    "a4e4": 1235,
    "h1b1": 1236,
    "e4e6": 1237,
    "a4d4": 1238,
    "f8d7": 1239,
    "e6c6": 1240,
    "d1f2": 1241,
    "a5b3": 1242,
    "a6d3": 1243,
    "f8a3": 1244,
    "b1e1": 1245,
    "c8h8": 1246,
    "h1h8": 1247,
    "c1h1": 1248,
    "d8h8": 1249,
    "c5d7": 1250,
    "g3f5": 1251,
    "f5e7": 1252,
    "b5d4": 1253,
    "e7a7": 1254,
    "a3c5": 1255,
    "f3h3": 1256,
    "f3h5": 1257,
    "e6e4": 1258,
    "f5f2": 1259,
    "e3a3": 1260,
    "f1g1": 1261,
    "h3f4": 1262,
    "f2c2": 1263,
    "e4h4": 1264,
    "c5a4": 1265,
    "e2e8": 1266,
    "d8c6": 1267,
    "d6d2": 1268,
    "f4g6": 1269,
    "d2e2": 1270,
    "e6c8": 1271,
    "g3h2": 1272,
    "d2d8": 1273,
    "g6e7": 1274,
    "e3d1": 1275,
    "c7c4": 1276,
    "f7e8": 1277,
    "d1e3": 1278,
    "c1h6": 1279,
    "g5g7": 1280,
    "b4d6": 1281,
    "g7g3": 1282,
    "c3h8": 1283,
    "f6b6": 1284,
    "b7c5": 1285,
    "c5a3": 1286,
    "g3c7": 1287,
    "d6c4": 1288,
    "c4f1": 1289,
    "f6a1": 1290,
    "g2c6": 1291,
    "f6c6": 1292,
    "e8g6": 1293,
    "h6g6": 1294,
    "b2d2": 1295,
    "g1g6": 1296,
    "g6g1": 1297,
    "f4b4": 1298,
    "b7b4": 1299,
    "g1c1": 1300,
    "a7c7": 1301,
    "e6a2": 1302,
    "a2e6": 1303,
    "e7a3": 1304,
    "b1b6": 1305,
    "e7c8": 1306,
    "c8a7": 1307,
    "a7b5": 1308,
    "c4a2": 1309,
    "a3b1": 1310,
    "g3e1": 1311,
    "g6g8": 1312,
    "d7b7": 1313,
    "f7g7": 1314,
    "a2c4": 1315,
    "b4a5": 1316,
    "d2f2": 1317,
    "c2b4": 1318,
    "c7c2": 1319,
    "c2a2": 1320,
    "a2a8": 1321,
    "c3a3": 1322,
    "a3a5": 1323,
    "a5d2": 1324,
    "f2d2": 1325,
    "f1a6": 1326,
    "e2a6": 1327,
    "b8a6": 1328,
    "f2d1": 1329,
    "h2a2": 1330,
    "a8c7": 1331,
    "h1e4": 1332,
    "d6e4": 1333,
    "e3h3": 1334,
    "f4c4": 1335,
    "b2f2": 1336,
    "b4b1": 1337,
    "c6b8": 1338,
    "c8c2": 1339,
    "g1g7": 1340,
    "g7e7": 1341,
    "d3c5": 1342,
    "c4c8": 1343,
    "e6c7": 1344,
    "c7d5": 1345,
    "d3f2": 1346,
    "f2h3": 1347,
    "d5b4": 1348,
    "b1a3": 1349,
    "f4g2": 1350,
    "g2f4": 1351,
    "e5g3": 1352,
    "h8d8": 1353,
    "e3c2": 1354,
    "g6h6": 1355,
    "d7g7": 1356,
    "h7d7": 1357,
    "f7a7": 1358,
    "g2b2": 1359,
    "e4c2": 1360,
    "c7a7": 1361,
    "a7f2": 1362,
    "b1e4": 1363,
    "e7b7": 1364,
    "f2h4": 1365,
    "h6g8": 1366,
    "b3c1": 1367,
    "c1d3": 1368,
    "c6e6": 1369,
    "c2c8": 1370,
    "b4d5": 1371,
    "a4h4": 1372,
    "g6g2": 1373,
    "d6b6": 1374,
    "b6d6": 1375,
    "c7e7": 1376,
    "g3d6": 1377,
    "h4f4": 1378,
    "f3c6": 1379,
    "a6e2": 1380,
    "f5d6": 1381,
    "h7h1": 1382,
    "g1g5": 1383,
    "b7b3": 1384,
    "b8b3": 1385,
    "c7c1": 1386,
    "a3d3": 1387,
    "d3d8": 1388,
    "g6c2": 1389,
    "e1h1": 1390,
    "g6e6": 1391,
    "g2g5": 1392,
    "g1g4": 1393,
    "g2g6": 1394,
    "c5g1": 1395,
    "e5e1": 1396,
    "c4a6": 1397,
    "h5h2": 1398,
    "h2c2": 1399,
    "c2g2": 1400,
    "c6c1": 1401,
    "c3g7": 1402,
    "a6b6": 1403,
    "b6f2": 1404,
    "g7g8": 1405,
    "f2h1": 1406,
    "a1h1": 1407,
    "h1h6": 1408,
    "h6e6": 1409,
    "e4a4": 1410,
    "c3c8": 1411,
    "d5d8": 1412,
    "a3c1": 1413,
    "c7c8q": 1414,
    "c4c1": 1415,
    "a2d5": 1416,
    "f6a6": 1417,
    "h2f2": 1418,
    "e7c7": 1419,
    "f6g8": 1420,
    "h3h8": 1421,
    "h8f6": 1422,
    "c7d8": 1423,
    "f6h7": 1424,
    "g3g6": 1425,
    "e5h2": 1426,
    "g4g2": 1427,
    "f8h6": 1428,
    "d3e5": 1429,
    "f4d4": 1430,
    "e2g2": 1431,
    "c4e2": 1432,
    "f7h5": 1433,
    "f1h2": 1434,
    "g5g1": 1435,
    "f1e3": 1436,
    "e7e2": 1437,
    "a6f1": 1438,
    "a1b2": 1439,
    "a4f4": 1440,
    "g8g6": 1441,
    "c4h4": 1442,
    "c6a7": 1443,
    "c5c1": 1444,
    "b5f1": 1445,
    "a4a1": 1446,
    "a3g3": 1447,
    "a2a7": 1448,
    "a7a4": 1449,
    "a6a3": 1450,
    "a3f8": 1451,
    "c3e1": 1452,
    "h6h4": 1453,
    "d1h5": 1454,
    "f7g5": 1455,
    "b2a4": 1456,
    "h7b7": 1457,
    "b2g2": 1458,
    "a5d8": 1459,
    "h8h6": 1460,
    "g6g4": 1461,
    "b4e1": 1462,
    "g6f4": 1463,
    "h5e2": 1464,
    "d2d5": 1465,
    "a6b8": 1466,
    "h4e1": 1467,
    "b4b6": 1468,
    "b1d1": 1469,
    "h6d2": 1470,
    "d4g1": 1471,
    "h3b3": 1472,
    "b3h3": 1473,
    "d8d3": 1474,
    "a5b5": 1475,
    "a3f3": 1476,
    "f3f8": 1477,
    "e8a8": 1478,
    "g7f8r": 1479,
    "d4f4": 1480,
    "f5g7": 1481,
    "f5b1": 1482,
    "h2e5": 1483,
    "g2g8": 1484,
    "g1g8": 1485,
    "c3h3": 1486,
    "h3h6": 1487,
    "h6f6": 1488,
    "b6c8": 1489,
    "c8e7": 1490,
    "e7g8": 1491,
    "a1c3": 1492,
    "g7f5": 1493,
    "e4b4": 1494,
    "b4e4": 1495,
    "a1a8": 1496,
    "g2a8": 1497,
    "b1d3": 1498,
    "e3g4": 1499,
    "h2f1": 1500,
    "f2b6": 1501,
    "g7b7": 1502,
    "g7h5": 1503,
    "b7f7": 1504,
    "a2f7": 1505,
    "h3c8": 1506,
    "e1g3": 1507,
    "h7h2": 1508,
    "h8h2": 1509,
    "c6c4": 1510,
    "a3b5": 1511,
    "f4h5": 1512,
    "e2e5": 1513,
    "f7f8q": 1514,
    "e7e8q": 1515,
    "d8f7": 1516,
    "h5f5": 1517,
    "f5f3": 1518,
    "h2f3": 1519,
    "e2h2": 1520,
    "h3g1": 1521,
    "g2e2": 1522,
    "c7h7": 1523,
    "h2h7": 1524,
    "d2d7": 1525,
    "d7a7": 1526,
    "a6a8": 1527,
    "a8h8": 1528,
    "e6f8": 1529,
    "c3c5": 1530,
    "c8d6": 1531,
    "b8f8": 1532,
    "g1e1": 1533,
    "f7h8": 1534,
    "h8f7": 1535,
    "d5a5": 1536,
    "c5c7": 1537,
    "d3b1": 1538,
    "f2f6": 1539,
    "a2c3": 1540,
    "b2a1": 1541,
    "d7d2": 1542,
    "h7f5": 1543,
    "d3e1": 1544,
    "g7b2": 1545,
    "d3d6": 1546,
    "c7f7": 1547,
    "a7f7": 1548,
    "f7d6": 1549,
    "f2b2": 1550,
    "e4a8": 1551,
    "b4f8": 1552,
    "g7a1": 1553,
    "b5g5": 1554,
    "g5e5": 1555,
    "f3c3": 1556,
    "g3b3": 1557,
    "e3f5": 1558,
    "e6e2": 1559,
    "a5g5": 1560,
    "d6g6": 1561,
    "g6d6": 1562,
    "h7f6": 1563,
    "c1f1": 1564,
    "b5h5": 1565,
    "f4a4": 1566,
    "e6h3": 1567,
    "a7g7": 1568,
    "b3b8": 1569,
    "h8b2": 1570,
    "c2f2": 1571,
    "g4g1": 1572,
    "h5d1": 1573,
    "a5c7": 1574,
    "d2a2": 1575,
    "d3a3": 1576,
    "f7d5": 1577,
    "d5g8": 1578,
    "e5g5": 1579,
    "f7b3": 1580,
    "a7h7": 1581,
    "h6h8": 1582,
    "g6a6": 1583,
    "a1g7": 1584,
    "f5d7": 1585,
    "e5a1": 1586,
    "b3f7": 1587,
    "f5h7": 1588,
    "g8e6": 1589,
    "f2c5": 1590,
    "g5d8": 1591,
    "b6d7": 1592,
    "f5f7": 1593,
    "g5b5": 1594,
    "a1f6": 1595,
    "b2g7": 1596,
    "e4h1": 1597,
    "d7b8": 1598,
    "g5g2": 1599,
    "e3f1": 1600,
    "e5f5": 1601,
    "d5d3": 1602,
    "f3b7": 1603,
    "c1g1": 1604,
    "g1d1": 1605,
    "c4f4": 1606,
    "a7c6": 1607,
    "c1a1": 1608,
    "b7g7": 1609,
    "d4d8": 1610,
    "c2c5": 1611,
    "c5c2": 1612,
    "a3a8": 1613,
    "h6f4": 1614,
    "f4f7": 1615,
    "a5a7": 1616,
    "e8b5": 1617,
    "d4d7": 1618,
    "g7d7": 1619,
    "f8f1": 1620,
    "e8g7": 1621,
    "h7f8": 1622,
    "h6c1": 1623,
    "b3a1": 1624,
    "e7e4": 1625,
    "d6h6": 1626,
    "f1f5": 1627,
    "b5a7": 1628,
    "h3h5": 1629,
    "b8f4": 1630,
    "h3a3": 1631,
    "b2h2": 1632,
    "h4b4": 1633,
    "f5c5": 1634,
    "b5e2": 1635,
    "b7b1": 1636,
    "h6a6": 1637,
    "h8h3": 1638,
    "h7h3": 1639,
    "g2c2": 1640,
    "f4f2": 1641,
    "a6a4": 1642,
    "a7b7": 1643,
    "b8h2": 1644,
    "a4a8": 1645,
    "g7g1": 1646,
    "d4a1": 1647,
    "a1d4": 1648,
    "b1f5": 1649,
    "g3a3": 1650,
    "e5b2": 1651,
    "a4b2": 1652,
    "b2d3": 1653,
    "a1e5": 1654,
    "b7d8": 1655,
    "b3g3": 1656,
    "h6c6": 1657,
    "a1b3": 1658,
    "c6h6": 1659,
    "h1f3": 1660,
    "a8b6": 1661,
    "b6a8": 1662,
    "g2g1q": 1663,
    "b7h1": 1664,
    "g7h8q": 1665,
    "h1a8": 1666,
    "f6f2": 1667,
    "b5e5": 1668,
    "b7a5": 1669,
    "a2h2": 1670,
    "f6b2": 1671,
    "e6e3": 1672,
    "e6h6": 1673,
    "g7e8": 1674,
    "a3c3": 1675,
    "e5h8": 1676,
    "f3f1": 1677,
    "h1d5": 1678,
    "c5a7": 1679,
    "e6b6": 1680,
    "d5a8": 1681,
    "f5f8": 1682,
    "c5f5": 1683,
    "g5g8": 1684,
    "a8d5": 1685,
    "e5b5": 1686,
    "d5a2": 1687,
    "b5b3": 1688,
    "d4g4": 1689,
    "g2e3": 1690,
    "g2h4": 1691,
    "f5a5": 1692,
    "f7h7": 1693,
    "h5e8": 1694,
    "c1a2": 1695,
    "c6a8": 1696,
    "f7f2": 1697,
    "d5h1": 1698,
    "g1a1": 1699,
    "g4a4": 1700,
    "a7e3": 1701,
    "b4h4": 1702,
    "e2g1": 1703,
    "e6d8": 1704,
    "b5e8": 1705,
    "c1e2": 1706,
    "f3h1": 1707,
    "h1c6": 1708,
    "f5d5": 1709,
    "a5f5": 1710,
    "b1g1": 1711,
    "g1b1": 1712,
    "d3h3": 1713,
    "h3d3": 1714,
    "h2f4": 1715,
    "g2a2": 1716,
    "c8b6": 1717,
    "f2a2": 1718,
    "b6e6": 1719,
    "h5c5": 1720,
    "a7a1": 1721,
    "h8g6": 1722,
    "a8e4": 1723,
    "b1g6": 1724,
    "g3g7": 1725,
    "f7c7": 1726,
    "a7c8": 1727,
    "c2h7": 1728,
    "h2d6": 1729,
    "g7a7": 1730,
    "g4g8": 1731,
    "b6g6": 1732,
    "f3a3": 1733,
    "h1b7": 1734,
    "g7g8n": 1735,
    "c6c2": 1736,
    "b4f4": 1737,
    "c6c3": 1738,
    "f7a2": 1739,
    "a6a1": 1740,
    "c1b3": 1741,
    "b3a5": 1742,
    "e8a4": 1743,
    "d4h8": 1744,
    "e3e6": 1745,
    "d8b7": 1746,
    "e7d8q": 1747,
    "h7e7": 1748,
    "a8g2": 1749,
    "a5b7": 1750,
    "h7c7": 1751,
    "h8d4": 1752,
    "a6h6": 1753,
    "b2h8": 1754,
    "h2h8": 1755,
    "d7c8q": 1756,
    "f2g1q": 1757,
    "b6g1": 1758,
    "d6d1": 1759,
    "b2b7": 1760,
    "h2c7": 1761,
    "h5d5": 1762,
    "g1c5": 1763,
    "a2a6": 1764,
    "f6f1": 1765,
    "a6e6": 1766,
    "g8b3": 1767,
    "g8c4": 1768,
    "a8c6": 1769,
    "a8f3": 1770,
    "a6a2": 1771,
    "g5c5": 1772,
    "h3h7": 1773,
    "g3g8": 1774,
    "h5b5": 1775,
    "c7c8n": 1776,
    "b7h7": 1777,
    "e1b4": 1778,
    "g1e3": 1779,
    "a3h3": 1780,
    "h3e3": 1781,
    "f3b3": 1782,
    "b3b1": 1783,
    "h4d4": 1784,
    "g3g1": 1785,
    "a8h1": 1786,
    "d7h7": 1787,
    "c7h2": 1788,
    "e7f8q": 1789,
    "a5h5": 1790,
    "h5a5": 1791,
    "b5b1": 1792,
    "b3g8": 1793,
    "d2c1q": 1794,
    "g6h8": 1795,
    "f2a7": 1796,
    "c4g4": 1797,
    "h2d2": 1798,
    "h6h1": 1799,
    "c6h1": 1800,
    "h2h6": 1801,
    "h1f2": 1802,
    "g6b6": 1803,
    "c7d8q": 1804,
    "h4a4": 1805,
    "a2b1q": 1806,
    "h2h5": 1807,
    "d1b2": 1808,
    "h8e5": 1809,
    "h7h4": 1810,
    "b8g3": 1811,
    "h2h1r": 1812,
    "a2g8": 1813,
    "e1a5": 1814,
    "c7d8r": 1815,
    "h8a1": 1816,
    "b7c8q": 1817,
    "a7a8r": 1818,
    "b2d1": 1819,
    "e2f1q": 1820,
    "g8d5": 1821,
    "g7f8q": 1822,
    "f2f1b": 1823,
    "b2b1b": 1824,
    "a2a1b": 1825,
    "f7e8q": 1826,
    "h6b6": 1827,
    "g1a7": 1828,
    "b1h7": 1829,
    "f2e1q": 1830,
    "d2e1q": 1831,
    "h7b1": 1832,
    "g6b1": 1833,
    "a7b8q": 1834,
    "b2a1q": 1835,
    "c2b1q": 1836,
    "e2d1q": 1837,
    "a7a8n": 1838,
    "h2g1q": 1839,
    "d7e8q": 1840,
    "a2a1r": 1841,
    "f2f1r": 1842,
    "g8a2": 1843,
    "h7g8q": 1844,
    "a7g1": 1845,
    "g2h1q": 1846,
    "a1h8": 1847,
    "b7a8q": 1848,
    "g1d4": 1849,
    "b2c1q": 1850,
    "g2f1q": 1851,
    "b7b8r": 1852,
    "f7g8q": 1853,
    "*": 1854,
    "c7c8b": 1855,
    "d7d8n": 1856,
    "c7b8q": 1857,
    "e2f1n": 1858,
    "e7e8n": 1859,
    "a2a1n": 1860,
    "h7h8n": 1861,
    "h7h8r": 1862,
    "c2c1n": 1863,
    "b7b8n": 1864,
    "g2g1n": 1865,
    "c2c1r": 1866,
    "d2d1r": 1867,
    "f7f8n": 1868,
    "b2a1n": 1869,
    "f7f8r": 1870,
    "d7e8r": 1871,
    "d2d1n": 1872,
    "c7c8r": 1873,
    "g2g1b": 1874,
    "e2e1n": 1875,
    "e2d1r": 1876,
    "h7g8n": 1877,
    "b2b1r": 1878,
    "g2g1r": 1879,
    "g7g8r": 1880,
    "d7e8n": 1881,
    "a7b8r": 1882,
    "h2h1b": 1883,
    "a7a8b": 1884,
    "e2e1r": 1885,
    "e7e8r": 1886,
    "b7c8b": 1887,
    "d2d1b": 1888,
    "f2f1n": 1889,
    "g7h8b": 1890,
    "g7f8n": 1891,
    "b2b1n": 1892,
    "f7e8n": 1893,
    "d2e1r": 1894,
    "e7d8r": 1895,
    "h2h1n": 1896,
    "e7f8n": 1897,
    "d7d8r": 1898,
    "h7h8b": 1899,
    "c2d1r": 1900,
    "c7d8n": 1901,
    "c2b1n": 1902,
    "f7g8r": 1903,
    "b2a1r": 1904,
    "e7e8b": 1905,
    "g7g8b": 1906,
    "e2f1r": 1907,
    "b7b8b": 1908,
    "f7f8b": 1909,
    "g2f1r": 1910,
    "d7d8b": 1911,
    "e7f8r": 1912,
    "e7d8n": 1913,
    "a2b1r": 1914,
    "f2g1n": 1915,
    "c2d1n": 1916,
    "e2e1b": 1917,
    "c2c1b": 1918,
    "d7c8n": 1919,
    "g2f1n": 1920
}