{
    "[UNK]": 0,
    "[PAD]": 1,
    "<|startofgame|>": 2,
    "<|endofgame|>": 3,
    "d2d4": 4,
    "g8f6": 5,
    "c1f4": 6,
    "g7g6": 7,
    "e2e3": 8,
    "f8g7": 9,
    "g1f3": 10,
    "e8g8": 11,
    "h2h3": 12,
    "d7d6": 13,
    "f1e2": 14,
    "c7c6": 15,
    "e1g1": 16,
    "b8d7": 17,
    "f4h2": 18,
    "f8e8": 19,
    "c2c4": 20,
    "e7e5": 21,
    "b1c3": 22,
    "e5e4": 23,
    "f3d2": 24,
    "d7f8": 25,
    "d1c2": 26,
    "c8f5": 27,
    "c2b3": 28,
    "a8b8": 29,
    "c4c5": 30,
    "d6d5": 31,
    "h2b8": 32,
    "d8b8": 33,
    "b3d1": 34,
    "h7h5": 35,
    "f1e1": 36,
    "h5h4": 37,
    "f2f3": 38,
    "f8h7": 39,
    "f3e4": 40,
    "d5e4": 41,
    "d2c4": 42,
    "e8d8": 43,
    "c4d6": 44,
    "d8d6": 45,
    "c5d6": 46,
    "b8d6": 47,
    "e1f1": 48,
    "h7g5": 49,
    "d1e1": 50,
    "g5h3": 51,
    "g2h3": 52,
    "f5h3": 53,
    "e1h4": 54,
    "h3f1": 55,
    "a1f1": 56,
    "f6d5": 57,
    "c3e4": 58,
    "d6e6": 59,
    "h4d8": 60,
    "g8h7": 61,
    "e4g5": 62,
    "h7h6": 63,
    "g5e6": 64,
    "f7e6": 65,
    "d8h4": 66,
    "1-0": 67,
    "b7b6": 68,
    "e2e4": 69,
    "c8b7": 70,
    "b8c6": 71,
    "c1e3": 72,
    "d1d2": 73,
    "d8d7": 74,
    "d4d5": 75,
    "c6b4": 76,
    "a2a3": 77,
    "b4a6": 78,
    "b2b4": 79,
    "e8c8": 80,
    "a1b1": 81,
    "e7e6": 82,
    "c3a4": 83,
    "g8e7": 84,
    "b4b5": 85,
    "a6c5": 86,
    "a4c5": 87,
    "d6c5": 88,
    "d2c2": 89,
    "f7f5": 90,
    "e1f2": 91,
    "f5e4": 92,
    "e6d5": 93,
    "f3g5": 94,
    "h8f8": 95,
    "f2e2": 96,
    "d7g4": 97,
    "e2e1": 98,
    "e7f5": 99,
    "c2e2": 100,
    "g4h4": 101,
    "e2f2": 102,
    "h4f2": 103,
    "e3f2": 104,
    "e4e3": 105,
    "f2g3": 106,
    "g7c3": 107,
    "e1e2": 108,
    "d8d2": 109,
    "d2b2": 110,
    "e1d1": 111,
    "b2b1": 112,
    "b1f1": 113,
    "h1f1": 114,
    "c3d4": 115,
    "e6d4": 116,
    "c5d4": 117,
    "b7g2": 118,
    "g3f4": 119,
    "g2e4": 120,
    "d4d3": 121,
    "0-1": 122,
    "d7d5": 123,
    "e4e5": 124,
    "b1d2": 125,
    "d2b3": 126,
    "c6c5": 127,
    "d4c5": 128,
    "a7a5": 129,
    "a2a4": 130,
    "d8c7": 131,
    "f8c5": 132,
    "f3d4": 133,
    "b3d4": 134,
    "f2f4": 135,
    "d4b5": 136,
    "c7d7": 137,
    "b5d6": 138,
    "e8f8": 139,
    "f1d3": 140,
    "d3f5": 141,
    "d6f5": 142,
    "g6f5": 143,
    "f8e7": 144,
    "h8g8": 145,
    "e7e8": 146,
    "b2b3": 147,
    "d7e7": 148,
    "e8d7": 149,
    "g8g4": 150,
    "a8g8": 151,
    "g2g3": 152,
    "d5d4": 153,
    "e3d4": 154,
    "c6d4": 155,
    "f2d4": 156,
    "d7c8": 157,
    "d4a7": 158,
    "e7h4": 159,
    "a7a8": 160,
    "c8c7": 161,
    "a8a5": 162,
    "a1d1": 163,
    "a5c5": 164,
    "c5c8": 165,
    "e8e7": 166,
    "d1d7": 167,
    "c1b2": 168,
    "c7c5": 169,
    "c8b8": 170,
    "e3e4": 171,
    "g7g5": 172,
    "d6e5": 173,
    "d4e5": 174,
    "f6h5": 175,
    "d2e4": 176,
    "h5f4": 177,
    "e4d6": 178,
    "e7d6": 179,
    "e5d6": 180,
    "c7d6": 181,
    "d6c7": 182,
    "g5g4": 183,
    "h3g4": 184,
    "f4e2": 185,
    "d8g8": 186,
    "f3e5": 187,
    "g4g3": 188,
    "b3d3": 189,
    "d6e7": 190,
    "f7f6": 191,
    "e5c6": 192,
    "b7c6": 193,
    "b5c6": 194,
    "b8c7": 195,
    "d3d7": 196,
    "e7d7": 197,
    "c6d7": 198,
    "b2f6": 199,
    "f6e5": 200,
    "g4c4": 201,
    "e5f4": 202,
    "d7c6": 203,
    "e3e2": 204,
    "c6d5": 205,
    "e2d2": 206,
    "c4d4": 207,
    "g1f2": 208,
    "e6e5": 209,
    "f4f5": 210,
    "e4f5": 211,
    "e2d3": 212,
    "f5e5": 213,
    "e5d5": 214,
    "d3e2": 215,
    "d5c5": 216,
    "c5c4": 217,
    "c4b4": 218,
    "c2d2": 219,
    "b4a4": 220,
    "d2d3": 221,
    "a4b4": 222,
    "d3d4": 223,
    "a5a4": 224,
    "a4a3": 225,
    "e5f6": 226,
    "a3a2": 227,
    "f6g7": 228,
    "b6b5": 229,
    "g7h7": 230,
    "b4c3": 231,
    "b5b4": 232,
    "f6e4": 233,
    "f4g3": 234,
    "e2h5": 235,
    "h3h4": 236,
    "d6b7": 237,
    "d8g5": 238,
    "g3h4": 239,
    "g5h4": 240,
    "h5f7": 241,
    "f8f7": 242,
    "h4h3": 243,
    "b7d6": 244,
    "f7f8": 245,
    "e6f5": 246,
    "g8g5": 247,
    "d2b4": 248,
    "g5h5": 249,
    "c5c6": 250,
    "f8g8": 251,
    "b4c4": 252,
    "g8g7": 253,
    "d7f6": 254,
    "f1d1": 255,
    "h3h1": 256,
    "e5d4": 257,
    "f8b4": 258,
    "b4e7": 259,
    "d5c6": 260,
    "g5f3": 261,
    "c1d2": 262,
    "f6g4": 263,
    "g4f6": 264,
    "e8e6": 265,
    "e1e6": 266,
    "d7e6": 267,
    "d8e7": 268,
    "e7f6": 269,
    "h6g5": 270,
    "c2c1": 271,
    "d2g5": 272,
    "f6d4": 273,
    "g5e3": 274,
    "d4f6": 275,
    "e3g5": 276,
    "d3h7": 277,
    "d1d4": 278,
    "c1c2": 279,
    "c2d3": 280,
    "g5f6": 281,
    "a8f8": 282,
    "f4e5": 283,
    "d4h4": 284,
    "h7g8": 285,
    "h4h8": 286,
    "g8f7": 287,
    "h8g7": 288,
    "d7d1": 289,
    "g1h2": 290,
    "f6g5": 291,
    "g6f6": 292,
    "f6f4": 293,
    "e4d3": 294,
    "d7d4": 295,
    "f4d2": 296,
    "d3c4": 297,
    "d1e2": 298,
    "c3d5": 299,
    "d5c3": 300,
    "e5h5": 301,
    "c8g4": 302,
    "e2b5": 303,
    "b5b7": 304,
    "a8d8": 305,
    "b7d5": 306,
    "d5h5": 307,
    "g4h5": 308,
    "d2f3": 309,
    "d1d8": 310,
    "h8e8": 311,
    "d4c3": 312,
    "f2g1": 313,
    "e4c3": 314,
    "b2c3": 315,
    "h5f3": 316,
    "g2f3": 317,
    "e8e3": 318,
    "f1c4": 319,
    "e3c3": 320,
    "c4b3": 321,
    "c3f3": 322,
    "g1g2": 323,
    "f3f4": 324,
    "h1d1": 325,
    "d1d3": 326,
    "d3c3": 327,
    "c7b6": 328,
    "g3g2": 329,
    "c3c4": 330,
    "b6c5": 331,
    "b4g4": 332,
    "b3e6": 333,
    "e6b3": 334,
    "c5b5": 335,
    "b3a4": 336,
    "b5c5": 337,
    "a4e8": 338,
    "e5e2": 339,
    "e2c2": 340,
    "e8f7": 341,
    "c2h2": 342,
    "g4g5": 343,
    "c5b4": 344,
    "f3g4": 345,
    "h2g2": 346,
    "g2f2": 347,
    "b4a3": 348,
    "f7g6": 349,
    "f2h2": 350,
    "h4g5": 351,
    "h2b2": 352,
    "g6h7": 353,
    "b2b5": 354,
    "g5h6": 355,
    "b5b6": 356,
    "g4g6": 357,
    "b6b7": 358,
    "g6g5": 359,
    "g5a5": 360,
    "h6g7": 361,
    "b6h6": 362,
    "h7g6": 363,
    "h6h7": 364,
    "g7f8": 365,
    "h7f7": 366,
    "g6f7": 367,
    "a3b4": 368,
    "c2c3": 369,
    "d8b6": 370,
    "d1b3": 371,
    "b3b6": 372,
    "a7b6": 373,
    "f3h4": 374,
    "f5c2": 375,
    "e2d1": 376,
    "c2d1": 377,
    "f6d7": 378,
    "h4f3": 379,
    "d7b6": 380,
    "d1b1": 381,
    "a8a4": 382,
    "a1a4": 383,
    "b6a4": 384,
    "b1b7": 385,
    "a4c3": 386,
    "b7c7": 387,
    "c6e5": 388,
    "e7b4": 389,
    "c7b7": 390,
    "c3a2": 391,
    "d2f1": 392,
    "f8c8": 393,
    "d4f3": 394,
    "g7f6": 395,
    "b7a7": 396,
    "a2b4": 397,
    "c3e5": 398,
    "h4g6": 399,
    "g6e5": 400,
    "a8a1": 401,
    "c4c3": 402,
    "f1g3": 403,
    "g1f1": 404,
    "c3c2": 405,
    "g3e2": 406,
    "f5d3": 407,
    "g1e2": 408,
    "d5c4": 409,
    "e2d4": 410,
    "d4c6": 411,
    "b6c6": 412,
    "c4c6": 413,
    "e7d5": 414,
    "a1c1": 415,
    "e4c5": 416,
    "c1c5": 417,
    "f1c1": 418,
    "h8c8": 419,
    "a8a6": 420,
    "b8b5": 421,
    "c6b5": 422,
    "a6c6": 423,
    "c2c6": 424,
    "d5b6": 425,
    "d2e3": 426,
    "g3g4": 427,
    "h5g4": 428,
    "b6c4": 429,
    "f4g5": 430,
    "c4e5": 431,
    "d3e3": 432,
    "e5g4": 433,
    "e3f4": 434,
    "g4f2": 435,
    "c3f6": 436,
    "f2e4": 437,
    "f6d8": 438,
    "e4d2": 439,
    "d8f6": 440,
    "f4g4": 441,
    "g4f5": 442,
    "f5f4": 443,
    "f4f3": 444,
    "d5e6": 445,
    "f5e6": 446,
    "f5g6": 447,
    "f3e2": 448,
    "g6h5": 449,
    "e2f3": 450,
    "h5g6": 451,
    "1/2-1/2": 452,
    "c8d7": 453,
    "c1g5": 454,
    "d4d2": 455,
    "g5f4": 456,
    "e1c1": 457,
    "a8c8": 458,
    "c1b1": 459,
    "d8a5": 460,
    "d2a5": 461,
    "c6a5": 462,
    "f1b5": 463,
    "a5c6": 464,
    "a7a6": 465,
    "b5a4": 466,
    "b7b5": 467,
    "a4b3": 468,
    "d4b3": 469,
    "a2b3": 470,
    "c8c5": 471,
    "b3b4": 472,
    "e7d8": 473,
    "d5e3": 474,
    "h4f5": 475,
    "e3d5": 476,
    "d1d5": 477,
    "g8d8": 478,
    "b1c2": 479,
    "c6b6": 480,
    "d1a1": 481,
    "a1a2": 482,
    "b8h8": 483,
    "f5h6": 484,
    "h8a8": 485,
    "d5d1": 486,
    "b6e3": 487,
    "h6f5": 488,
    "h2h4": 489,
    "h4h5": 490,
    "e4d5": 491,
    "a2a1": 492,
    "c8c6": 493,
    "f1g2": 494,
    "c6e7": 495,
    "g4h3": 496,
    "f1f2": 497,
    "h3g2": 498,
    "f2g2": 499,
    "f5d4": 500,
    "h5f6": 501,
    "d4e2": 502,
    "g1h1": 503,
    "e2g3": 504,
    "e4g3": 505,
    "f3f2": 506,
    "h6h5": 507,
    "g3e4": 508,
    "f6f3": 509,
    "f8d6": 510,
    "f4d6": 511,
    "e7g6": 512,
    "d6f8": 513,
    "g6h4": 514,
    "c8e6": 515,
    "e2g4": 516,
    "e6g4": 517,
    "d1g4": 518,
    "f1f8": 519,
    "g6f8": 520,
    "g8f8": 521,
    "g4g7": 522,
    "g7d4": 523,
    "f1f6": 524,
    "c6c7": 525,
    "d4d6": 526,
    "c7c8": 527,
    "f6f8": 528,
    "e4f2": 529,
    "c4d5": 530,
    "g5e7": 531,
    "d5d6": 532,
    "e7g7": 533,
    "c3e2": 534,
    "h2g3": 535,
    "h1h4": 536,
    "h8h4": 537,
    "e4f6": 538,
    "f8g6": 539,
    "f1h3": 540,
    "d7e8": 541,
    "e8h5": 542,
    "d8c8": 543,
    "g7g2": 544,
    "e5f3": 545,
    "f8f3": 546,
    "c5b6": 547,
    "e7g5": 548,
    "a8a3": 549,
    "e3d2": 550,
    "f6c3": 551,
    "b1b8": 552,
    "g4e6": 553,
    "g8h8": 554,
    "a2f2": 555,
    "d4f2": 556,
    "b8c8": 557,
    "d3g6": 558,
    "c5h5": 559,
    "c5e7": 560,
    "d5f6": 561,
    "d6f6": 562,
    "d3e4": 563,
    "d8d4": 564,
    "a3a4": 565,
    "d4b4": 566,
    "b4b2": 567,
    "e5e7": 568,
    "c3b2": 569,
    "d7c5": 570,
    "g7h6": 571,
    "b2d4": 572,
    "c5a5": 573,
    "g2f1": 574,
    "c8a8": 575,
    "f5g4": 576,
    "g4d7": 577,
    "c5c3": 578,
    "c5f8": 579,
    "c8f8": 580,
    "c3c7": 581,
    "d7b5": 582,
    "d3b5": 583,
    "g2g4": 584,
    "e3g1": 585,
    "g4h6": 586,
    "g1b6": 587,
    "d6b5": 588,
    "f8a8": 589,
    "h6f7": 590,
    "f1f7": 591,
    "d1f1": 592,
    "f7g8": 593,
    "a4a5": 594,
    "d2f4": 595,
    "f3g1": 596,
    "e4f3": 597,
    "f8f4": 598,
    "b5c4": 599,
    "e2c4": 600,
    "a8e8": 601,
    "d1c1": 602,
    "c1c4": 603,
    "g4f4": 604,
    "b2a3": 605,
    "a3b2": 606,
    "d7f7": 607,
    "b7e7": 608,
    "d6b8": 609,
    "f4f1": 610,
    "f7f1": 611,
    "f2f7": 612,
    "b3d2": 613,
    "b6a6": 614,
    "a6f6": 615,
    "g2b7": 616,
    "c8e8": 617,
    "e5c4": 618,
    "f5c8": 619,
    "c8h3": 620,
    "c4e3": 621,
    "d2d1": 622,
    "f3d1": 623,
    "d4b2": 624,
    "e8b8": 625,
    "e3c4": 626,
    "c4d2": 627,
    "b8d8": 628,
    "b1b5": 629,
    "f8d8": 630,
    "b5d5": 631,
    "d4g7": 632,
    "e1e8": 633,
    "d8e8": 634,
    "d6e8": 635,
    "e8f6": 636,
    "a4b6": 637,
    "b6d5": 638,
    "g4f3": 639,
    "d5f4": 640,
    "g4d1": 641,
    "f4e6": 642,
    "e6f4": 643,
    "c6a4": 644,
    "a4c2": 645,
    "f6h4": 646,
    "h4g3": 647,
    "f4h3": 648,
    "h1g2": 649,
    "g3b8": 650,
    "c2e4": 651,
    "g2g1": 652,
    "c4b2": 653,
    "d3c2": 654,
    "b2c4": 655,
    "c4a3": 656,
    "c3b4": 657,
    "h3g5": 658,
    "f2e3": 659,
    "b2c1": 660,
    "f2f1q": 661,
    "e5e6": 662,
    "e4c6": 663,
    "e6d6": 664,
    "f1f4": 665,
    "f4f8": 666,
    "e3d3": 667,
    "c6b7": 668,
    "c4b5": 669,
    "b4b7": 670,
    "f4b8": 671,
    "b8b2": 672,
    "e4g2": 673,
    "e5f7": 674,
    "a4d7": 675,
    "f7h6": 676,
    "e3h6": 677,
    "f2f8": 678,
    "h6f8": 679,
    "f8f2": 680,
    "f2f5": 681,
    "d5f5": 682,
    "d4b6": 683,
    "b6c7": 684,
    "f3e3": 685,
    "d6f4": 686,
    "d3d2": 687,
    "e2c3": 688,
    "f4c1": 689,
    "e8e1": 690,
    "c1e1": 691,
    "c7f4": 692,
    "e1e4": 693,
    "e4e7": 694,
    "e7e3": 695,
    "e3e7": 696,
    "e7h7": 697,
    "h5h6": 698,
    "h7h8q": 699,
    "h8c3": 700,
    "b3c4": 701,
    "c3d3": 702,
    "c4d3": 703,
    "c4a4": 704,
    "e7c5": 705,
    "h4f6": 706,
    "d5b3": 707,
    "b3c2": 708,
    "b3c3": 709,
    "c8c3": 710,
    "c1c3": 711,
    "b4a2": 712,
    "c3c1": 713,
    "b1c1": 714,
    "a2c1": 715,
    "d4e6": 716,
    "e1d2": 717,
    "d2c1": 718,
    "a6a5": 719,
    "c5d5": 720,
    "f5f6": 721,
    "f6f7": 722,
    "e6f7": 723,
    "a2a1q": 724,
    "a1e1": 725,
    "h4g4": 726,
    "b7b8": 727,
    "b8a8": 728,
    "a8a7": 729,
    "h3h2": 730,
    "a7b8": 731,
    "h2h1q": 732,
    "h1h3": 733,
    "h3f3": 734,
    "g4e4": 735,
    "b8a7": 736,
    "f3d3": 737,
    "e4c4": 738,
    "b6a7": 739,
    "d3b3": 740,
    "c4b6": 741,
    "b6b3": 742,
    "f4e3": 743,
    "c6g2": 744,
    "b8b7": 745,
    "d1d6": 746,
    "d6a6": 747,
    "a1a6": 748,
    "e4d4": 749,
    "d4c4": 750,
    "c5e5": 751,
    "b7a6": 752,
    "a6a7": 753,
    "f6g6": 754,
    "b7b8q": 755,
    "f6f5": 756,
    "h5h8": 757,
    "f5g5": 758,
    "c3b5": 759,
    "f3e1": 760,
    "e4b1": 761,
    "d6c6": 762,
    "d2c3": 763,
    "e1g2": 764,
    "g2e1": 765,
    "e1c2": 766,
    "e3f3": 767,
    "f3g2": 768,
    "c2a3": 769,
    "a3c2": 770,
    "c2e1": 771,
    "c3d2": 772,
    "e1f3": 773,
    "d1f3": 774,
    "e5c3": 775,
    "b3d5": 776,
    "f3g3": 777,
    "d5g5": 778,
    "d8d5": 779,
    "g3f3": 780,
    "f3d5": 781,
    "c1c8": 782,
    "e4e8": 783,
    "f6e7": 784,
    "d5f7": 785,
    "g7f7": 786,
    "e8h8": 787,
    "h7g7": 788,
    "c8g8": 789,
    "f8f6": 790,
    "e6f6": 791,
    "h8b8": 792,
    "b5c7": 793,
    "c7a8": 794,
    "d8a8": 795,
    "h8h5": 796,
    "e2e6": 797,
    "f8e6": 798,
    "e1e5": 799,
    "e6g5": 800,
    "h5g5": 801,
    "a6d6": 802,
    "b7c8": 803,
    "e5e8": 804,
    "f8h8": 805,
    "h8h7": 806,
    "h7h8": 807,
    "d6b4": 808,
    "h7c2": 809,
    "e3e8": 810,
    "g5f7": 811,
    "f7d8": 812,
    "e8e4": 813,
    "f4c7": 814,
    "d8f8": 815,
    "c3b1": 816,
    "g5g6": 817,
    "h1e1": 818,
    "c4e6": 819,
    "e6c4": 820,
    "d8d1": 821,
    "c6g6": 822,
    "e7f7": 823,
    "f7f3": 824,
    "e3b6": 825,
    "h1h2": 826,
    "d1g1": 827,
    "f3f6": 828,
    "g4e3": 829,
    "g3h5": 830,
    "e3g2": 831,
    "g2g7": 832,
    "g7c7": 833,
    "f5f1": 834,
    "f1h1": 835,
    "a5a6": 836,
    "h4h1": 837,
    "b6b8": 838,
    "h1a1": 839,
    "a1a3": 840,
    "a3a7": 841,
    "e7c6": 842,
    "b7d7": 843,
    "e6e1": 844,
    "f7f4": 845,
    "b4c6": 846,
    "g2d5": 847,
    "d5g2": 848,
    "c3c6": 849,
    "g5d5": 850,
    "e1e7": 851,
    "f4h4": 852,
    "d2h2": 853,
    "h4h2": 854,
    "f8f5": 855,
    "f5b5": 856,
    "b5f5": 857,
    "f6e8": 858,
    "e8d6": 859,
    "f5g3": 860,
    "c2a4": 861,
    "f2e1": 862,
    "e1c3": 863,
    "f4d3": 864,
    "f6d6": 865,
    "g5f5": 866,
    "d6d3": 867,
    "d3d5": 868,
    "c2b2": 869,
    "h4c4": 870,
    "c5g5": 871,
    "e1b1": 872,
    "a5a3": 873,
    "b1b3": 874,
    "b3b2": 875,
    "a1g1": 876,
    "g1g3": 877,
    "g3h3": 878,
    "d4e4": 879,
    "h2e2": 880,
    "e4f4": 881,
    "e2e7": 882,
    "e3c5": 883,
    "b6b2": 884,
    "c5d3": 885,
    "d3c1": 886,
    "h1c1": 887,
    "c8c1": 888,
    "b4d2": 889,
    "c4g8": 890,
    "a6b5": 891,
    "a4b5": 892,
    "b2b6": 893,
    "f5h4": 894,
    "f3f5": 895,
    "h4e4": 896,
    "f3f7": 897,
    "g4c8": 898,
    "f7c4": 899,
    "c4c2": 900,
    "e3e1": 901,
    "d2d1q": 902,
    "h1g1": 903,
    "h8h1": 904,
    "g2h1": 905,
    "e6d7": 906,
    "b4b3": 907,
    "h3d7": 908,
    "b8b4": 909,
    "d7d8": 910,
    "b4b8": 911,
    "h4h7": 912,
    "c8d8": 913,
    "g4e2": 914,
    "d7e5": 915,
    "a5e5": 916,
    "c3d1": 917,
    "e4g6": 918,
    "d1c3": 919,
    "g6d3": 920,
    "e3g3": 921,
    "c8a6": 922,
    "a6b7": 923,
    "d3g3": 924,
    "c6e4": 925,
    "g3g5": 926,
    "e4e2": 927,
    "g5g3": 928,
    "f3a8": 929,
    "a8b7": 930,
    "d2d6": 931,
    "b7f3": 932,
    "d6d4": 933,
    "c6c8": 934,
    "c6a6": 935,
    "a6g6": 936,
    "g6g3": 937,
    "e2e1q": 938,
    "a7a8q": 939,
    "h3g3": 940,
    "g3f2": 941,
    "b4c5": 942,
    "b3b5": 943,
    "e5g6": 944,
    "a3a6": 945,
    "c1a3": 946,
    "c3a1": 947,
    "d5b5": 948,
    "h2g1": 949,
    "a2e2": 950,
    "b5b8": 951,
    "c7b8": 952,
    "a6c8": 953,
    "e6a6": 954,
    "c2b1": 955,
    "b1a1": 956,
    "e2b2": 957,
    "b6a5": 958,
    "a5e1": 959,
    "b8e5": 960,
    "e5d7": 961,
    "d7f5": 962,
    "d6h2": 963,
    "f6h6": 964,
    "f1f3": 965,
    "h6h2": 966,
    "g3e5": 967,
    "e5g7": 968,
    "e1e3": 969,
    "g5c1": 970,
    "a5b4": 971,
    "a8a2": 972,
    "a2d2": 973,
    "g8a8": 974,
    "a3a1": 975,
    "g3e3": 976,
    "c1d1": 977,
    "d3d1": 978,
    "d1h1": 979,
    "h1h5": 980,
    "h5e5": 981,
    "d5d7": 982,
    "f4e4": 983,
    "f6e6": 984,
    "c4c7": 985,
    "b2b1q": 986,
    "b1b4": 987,
    "c7c3": 988,
    "d3b4": 989,
    "b4c2": 990,
    "g3f1": 991,
    "f1d2": 992,
    "c2a1": 993,
    "a1c2": 994,
    "c2d4": 995,
    "d4c2": 996,
    "e2f4": 997,
    "f4d5": 998,
    "c1c6": 999,
    "b2e5": 1000,
    "e5c7": 1001,
    "d5c7": 1002,
    "c7b5": 1003,
    "b5a3": 1004,
    "a3c4": 1005,
    "c5a6": 1006,
    "a6c7": 1007,
    "c5b7": 1008,
    "c7a6": 1009,
    "a6b4": 1010,
    "b4d3": 1011,
    "f3h2": 1012,
    "g2h2": 1013,
    "c5e3": 1014,
    "b6d4": 1015,
    "d4e3": 1016,
    "e8e5": 1017,
    "b1a2": 1018,
    "f7b7": 1019,
    "e5c5": 1020,
    "f8b8": 1021,
    "d7h3": 1022,
    "d2b1": 1023,
    "e2c1": 1024,
    "c3e3": 1025,
    "e3a7": 1026,
    "a7c5": 1027,
    "e6g6": 1028,
    "g6e8": 1029,
    "g8e8": 1030,
    "g8g1": 1031,
    "c7g7": 1032,
    "g2d2": 1033,
    "d2g2": 1034,
    "g7g4": 1035,
    "h2h1": 1036,
    "b7e4": 1037,
    "a1a7": 1038,
    "b5b2": 1039,
    "b2b8": 1040,
    "c3a5": 1041,
    "e1a1": 1042,
    "a1a5": 1043,
    "a5a1": 1044,
    "a7a2": 1045,
    "c4a5": 1046,
    "c7a5": 1047,
    "a5a2": 1048,
    "c5e6": 1049,
    "a2a5": 1050,
    "h3f5": 1051,
    "a4a6": 1052,
    "d2h6": 1053,
    "h6h3": 1054,
    "b8e8": 1055,
    "h3e6": 1056,
    "e6e8": 1057,
    "b1b2": 1058,
    "g4b4": 1059,
    "b4d4": 1060,
    "c2c1q": 1061,
    "f2f1": 1062,
    "c5b3": 1063,
    "g7h8": 1064,
    "h5g3": 1065,
    "h4h6": 1066,
    "b6f6": 1067,
    "g7e5": 1068,
    "g4e5": 1069,
    "g5d2": 1070,
    "h6e3": 1071,
    "d5e5": 1072,
    "c6d8": 1073,
    "d8e6": 1074,
    "e6c5": 1075,
    "a2g2": 1076,
    "c5e4": 1077,
    "a3d6": 1078,
    "e6e7": 1079,
    "c7e6": 1080,
    "d6d7": 1081,
    "g8b8": 1082,
    "b8g8": 1083,
    "d7d8q": 1084,
    "e4h7": 1085,
    "h7e4": 1086,
    "d6a3": 1087,
    "e3c1": 1088,
    "e6g8": 1089,
    "b2e2": 1090,
    "e5a5": 1091,
    "d5b7": 1092,
    "d6f7": 1093,
    "f7e7": 1094,
    "e7e1": 1095,
    "d2e1": 1096,
    "c7e8": 1097,
    "d6c8": 1098,
    "d6d8": 1099,
    "e8c7": 1100,
    "e1d3": 1101,
    "d3b2": 1102,
    "a5b6": 1103,
    "b3a3": 1104,
    "g6g7": 1105,
    "g7g8q": 1106,
    "g8c8": 1107,
    "a3b3": 1108,
    "c8c4": 1109,
    "b3b7": 1110,
    "b3c5": 1111,
    "b7a8": 1112,
    "g8h6": 1113,
    "f1b1": 1114,
    "d7a4": 1115,
    "b8b6": 1116,
    "b6b1": 1117,
    "b8b1": 1118,
    "b2a2": 1119,
    "h3f2": 1120,
    "f2g4": 1121,
    "a4d1": 1122,
    "a2c2": 1123,
    "e7f8": 1124,
    "d4f5": 1125,
    "h4e7": 1126,
    "g5h7": 1127,
    "c2g6": 1128,
    "c5f2": 1129,
    "h5h7": 1130,
    "f4h6": 1131,
    "b5a6": 1132,
    "c6e8": 1133,
    "e4b7": 1134,
    "e8c6": 1135,
    "c6f3": 1136,
    "a2b2": 1137,
    "a6c4": 1138,
    "d7d3": 1139,
    "c3b3": 1140,
    "b3a2": 1141,
    "a2b1": 1142,
    "b3e3": 1143,
    "e3b3": 1144,
    "c7e5": 1145,
    "e5e3": 1146,
    "h5g7": 1147,
    "g7e6": 1148,
    "a4c4": 1149,
    "c4e4": 1150,
    "c2d1q": 1151,
    "a5c3": 1152,
    "f5e3": 1153,
    "f1a1": 1154,
    "e5d3": 1155,
    "d3f4": 1156,
    "d3a6": 1157,
    "d4d1": 1158,
    "e3e5": 1159,
    "h2g4": 1160,
    "e5b8": 1161,
    "g1h3": 1162,
    "d6g3": 1163,
    "b5d3": 1164,
    "f2d3": 1165,
    "a5c4": 1166,
    "g3d3": 1167,
    "d3f3": 1168,
    "g8g3": 1169,
    "g3c3": 1170,
    "c3g3": 1171,
    "h1h7": 1172,
    "h7a7": 1173,
    "a5a8": 1174,
    "a4a2": 1175,
    "a7d4": 1176,
    "h4g2": 1177,
    "f6h8": 1178,
    "b6b4": 1179,
    "d1a4": 1180,
    "b6d8": 1181,
    "a4c6": 1182,
    "b7b2": 1183,
    "a3e7": 1184,
    "h6g4": 1185,
    "g4h2": 1186,
    "b2c2": 1187,
    "c2c7": 1188,
    "c1c7": 1189,
    "b5d7": 1190,
    "f7d7": 1191,
    "a7d7": 1192,
    "e6g7": 1193,
    "g6e4": 1194,
    "e8e2": 1195,
    "e4g4": 1196,
    "h5h3": 1197,
    "e4e1": 1198,
    "h3c3": 1199,
    "b3f3": 1200,
    "c2e3": 1201,
    "g3h1": 1202,
    "h1g3": 1203,
    "g4d4": 1204,
    "d4a4": 1205,
    "a4a7": 1206,
    "a7a3": 1207,
    "a3e3": 1208,
    "a4g4": 1209,
    "b1h1": 1210,
    "f4f6": 1211,
    "b5c3": 1212,
    "g5e4": 1213,
    "e2a2": 1214,
    "d5e7": 1215,
    "f7e5": 1216,
    "c6d6": 1217,
    "h6d6": 1218,
    "b5a5": 1219,
    "d5f3": 1220,
    "e2f1": 1221,
    "a5d5": 1222,
    "d5d2": 1223,
    "d7c7": 1224,
    "h7d3": 1225,
    "d3f1": 1226,
    "c2f5": 1227,
    "g8g2": 1228,
    "f5h5": 1229,
    "c7g3": 1230,
    "c4f7": 1231,
    "g6c6": 1232,
    "c6f6": 1233,
    "a7e7": 1234,
    "h5h1": 1235,
    "a4e4": 1236,
    "h1b1": 1237,
    "e4e6": 1238,
    "a4d4": 1239,
    "f8d7": 1240,
    "e6c6": 1241,
    "d1f2": 1242,
    "a5b3": 1243,
    "a6d3": 1244,
    "f8a3": 1245,
    "b1e1": 1246,
    "c8h8": 1247,
    "h1h8": 1248,
    "c1h1": 1249,
    "d8h8": 1250,
    "c5d7": 1251,
    "g3f5": 1252,
    "f5e7": 1253,
    "b5d4": 1254,
    "e7a7": 1255,
    "a3c5": 1256,
    "f3h3": 1257,
    "f3h5": 1258,
    "e6e4": 1259,
    "f5f2": 1260,
    "e3a3": 1261,
    "f1g1": 1262,
    "h3f4": 1263,
    "f2c2": 1264,
    "e4h4": 1265,
    "c5a4": 1266,
    "e2e8": 1267,
    "d8c6": 1268,
    "d6d2": 1269,
    "f4g6": 1270,
    "d2e2": 1271,
    "e6c8": 1272,
    "g3h2": 1273,
    "d2d8": 1274,
    "g6e7": 1275,
    "e3d1": 1276,
    "c7c4": 1277,
    "f7e8": 1278,
    "d1e3": 1279,
    "c1h6": 1280,
    "g5g7": 1281,
    "b4d6": 1282,
    "g7g3": 1283,
    "c3h8": 1284,
    "f6b6": 1285,
    "b7c5": 1286,
    "c5a3": 1287,
    "g3c7": 1288,
    "d6c4": 1289,
    "c4f1": 1290,
    "f6a1": 1291,
    "g2c6": 1292,
    "f6c6": 1293,
    "e8g6": 1294,
    "h6g6": 1295,
    "b2d2": 1296,
    "g1g6": 1297,
    "g6g1": 1298,
    "f4b4": 1299,
    "b7b4": 1300,
    "g1c1": 1301,
    "a7c7": 1302,
    "e6a2": 1303,
    "a2e6": 1304,
    "e7a3": 1305,
    "b1b6": 1306,
    "e7c8": 1307,
    "c8a7": 1308,
    "a7b5": 1309,
    "c4a2": 1310,
    "a3b1": 1311,
    "g3e1": 1312,
    "g6g8": 1313,
    "d7b7": 1314,
    "f7g7": 1315,
    "a2c4": 1316,
    "b4a5": 1317,
    "d2f2": 1318,
    "c2b4": 1319,
    "c7c2": 1320,
    "c2a2": 1321,
    "a2a8": 1322,
    "c3a3": 1323,
    "a3a5": 1324,
    "a5d2": 1325,
    "f2d2": 1326,
    "f1a6": 1327,
    "e2a6": 1328,
    "b8a6": 1329,
    "f2d1": 1330,
    "h2a2": 1331,
    "a8c7": 1332,
    "h1e4": 1333,
    "d6e4": 1334,
    "e3h3": 1335,
    "f4c4": 1336,
    "b2f2": 1337,
    "b4b1": 1338,
    "c6b8": 1339,
    "c8c2": 1340,
    "g1g7": 1341,
    "g7e7": 1342,
    "d3c5": 1343,
    "c4c8": 1344,
    "e6c7": 1345,
    "c7d5": 1346,
    "d3f2": 1347,
    "f2h3": 1348,
    "d5b4": 1349,
    "b1a3": 1350,
    "f4g2": 1351,
    "g2f4": 1352,
    "e5g3": 1353,
    "h8d8": 1354,
    "e3c2": 1355,
    "g6h6": 1356,
    "d7g7": 1357,
    "h7d7": 1358,
    "f7a7": 1359,
    "g2b2": 1360,
    "e4c2": 1361,
    "c7a7": 1362,
    "a7f2": 1363,
    "b1e4": 1364,
    "e7b7": 1365,
    "f2h4": 1366,
    "h6g8": 1367,
    "b3c1": 1368,
    "c1d3": 1369,
    "c6e6": 1370,
    "c2c8": 1371,
    "b4d5": 1372,
    "a4h4": 1373,
    "g6g2": 1374,
    "d6b6": 1375,
    "b6d6": 1376,
    "c7e7": 1377,
    "g3d6": 1378,
    "h4f4": 1379,
    "f3c6": 1380,
    "a6e2": 1381,
    "f5d6": 1382,
    "h7h1": 1383,
    "g1g5": 1384,
    "b7b3": 1385,
    "b8b3": 1386,
    "c7c1": 1387,
    "a3d3": 1388,
    "d3d8": 1389,
    "g6c2": 1390,
    "e1h1": 1391,
    "g6e6": 1392,
    "g2g5": 1393,
    "g1g4": 1394,
    "g2g6": 1395,
    "c5g1": 1396,
    "e5e1": 1397,
    "c4a6": 1398,
    "h5h2": 1399,
    "h2c2": 1400,
    "c2g2": 1401,
    "c6c1": 1402,
    "c3g7": 1403,
    "a6b6": 1404,
    "b6f2": 1405,
    "g7g8": 1406,
    "f2h1": 1407,
    "a1h1": 1408,
    "h1h6": 1409,
    "h6e6": 1410,
    "e4a4": 1411,
    "c3c8": 1412,
    "d5d8": 1413,
    "a3c1": 1414,
    "c7c8q": 1415,
    "c4c1": 1416,
    "a2d5": 1417,
    "f6a6": 1418,
    "h2f2": 1419,
    "e7c7": 1420,
    "f6g8": 1421,
    "h3h8": 1422,
    "h8f6": 1423,
    "c7d8": 1424,
    "f6h7": 1425,
    "g3g6": 1426,
    "e5h2": 1427,
    "g4g2": 1428,
    "f8h6": 1429,
    "d3e5": 1430,
    "f4d4": 1431,
    "e2g2": 1432,
    "c4e2": 1433,
    "f7h5": 1434,
    "f1h2": 1435,
    "g5g1": 1436,
    "f1e3": 1437,
    "e7e2": 1438,
    "a6f1": 1439,
    "a1b2": 1440,
    "a4f4": 1441,
    "g8g6": 1442,
    "c4h4": 1443,
    "c6a7": 1444,
    "c5c1": 1445,
    "b5f1": 1446,
    "a4a1": 1447,
    "a3g3": 1448,
    "a2a7": 1449,
    "a7a4": 1450,
    "a6a3": 1451,
    "a3f8": 1452,
    "c3e1": 1453,
    "h6h4": 1454,
    "d1h5": 1455,
    "f7g5": 1456,
    "b2a4": 1457,
    "h7b7": 1458,
    "b2g2": 1459,
    "a5d8": 1460,
    "h8h6": 1461,
    "g6g4": 1462,
    "b4e1": 1463,
    "g6f4": 1464,
    "h5e2": 1465,
    "d2d5": 1466,
    "a6b8": 1467,
    "h4e1": 1468,
    "b4b6": 1469,
    "b1d1": 1470,
    "h6d2": 1471,
    "d4g1": 1472,
    "h3b3": 1473,
    "b3h3": 1474,
    "d8d3": 1475,
    "a5b5": 1476,
    "a3f3": 1477,
    "f3f8": 1478,
    "e8a8": 1479,
    "g7f8r": 1480,
    "d4f4": 1481,
    "f5g7": 1482,
    "f5b1": 1483,
    "h2e5": 1484,
    "g2g8": 1485,
    "g1g8": 1486,
    "c3h3": 1487,
    "h3h6": 1488,
    "h6f6": 1489,
    "b6c8": 1490,
    "c8e7": 1491,
    "e7g8": 1492,
    "a1c3": 1493,
    "g7f5": 1494,
    "e4b4": 1495,
    "b4e4": 1496,
    "a1a8": 1497,
    "g2a8": 1498,
    "b1d3": 1499,
    "e3g4": 1500,
    "h2f1": 1501,
    "f2b6": 1502,
    "g7b7": 1503,
    "g7h5": 1504,
    "b7f7": 1505,
    "a2f7": 1506,
    "h3c8": 1507,
    "e1g3": 1508,
    "h7h2": 1509,
    "h8h2": 1510,
    "c6c4": 1511,
    "a3b5": 1512,
    "f4h5": 1513,
    "e2e5": 1514,
    "f7f8q": 1515,
    "e7e8q": 1516,
    "d8f7": 1517,
    "h5f5": 1518,
    "f5f3": 1519,
    "h2f3": 1520,
    "e2h2": 1521,
    "h3g1": 1522,
    "g2e2": 1523,
    "c7h7": 1524,
    "h2h7": 1525,
    "d2d7": 1526,
    "d7a7": 1527,
    "a6a8": 1528,
    "a8h8": 1529,
    "e6f8": 1530,
    "c3c5": 1531,
    "c8d6": 1532,
    "b8f8": 1533,
    "g1e1": 1534,
    "f7h8": 1535,
    "h8f7": 1536,
    "d5a5": 1537,
    "c5c7": 1538,
    "d3b1": 1539,
    "f2f6": 1540,
    "a2c3": 1541,
    "b2a1": 1542,
    "d7d2": 1543,
    "h7f5": 1544,
    "d3e1": 1545,
    "g7b2": 1546,
    "d3d6": 1547,
    "c7f7": 1548,
    "a7f7": 1549,
    "f7d6": 1550,
    "f2b2": 1551,
    "e4a8": 1552,
    "b4f8": 1553,
    "g7a1": 1554,
    "b5g5": 1555,
    "g5e5": 1556,
    "f3c3": 1557,
    "g3b3": 1558,
    "e3f5": 1559,
    "e6e2": 1560,
    "a5g5": 1561,
    "d6g6": 1562,
    "g6d6": 1563,
    "h7f6": 1564,
    "c1f1": 1565,
    "b5h5": 1566,
    "f4a4": 1567,
    "e6h3": 1568,
    "a7g7": 1569,
    "b3b8": 1570,
    "h8b2": 1571,
    "c2f2": 1572,
    "g4g1": 1573,
    "h5d1": 1574,
    "a5c7": 1575,
    "d2a2": 1576,
    "d3a3": 1577,
    "f7d5": 1578,
    "d5g8": 1579,
    "e5g5": 1580,
    "f7b3": 1581,
    "a7h7": 1582,
    "h6h8": 1583,
    "g6a6": 1584,
    "a1g7": 1585,
    "f5d7": 1586,
    "e5a1": 1587,
    "b3f7": 1588,
    "f5h7": 1589,
    "g8e6": 1590,
    "f2c5": 1591,
    "g5d8": 1592,
    "b6d7": 1593,
    "f5f7": 1594,
    "g5b5": 1595,
    "a1f6": 1596,
    "b2g7": 1597,
    "e4h1": 1598,
    "d7b8": 1599,
    "g5g2": 1600,
    "e3f1": 1601,
    "e5f5": 1602,
    "d5d3": 1603,
    "f3b7": 1604,
    "c1g1": 1605,
    "g1d1": 1606,
    "c4f4": 1607,
    "a7c6": 1608,
    "c1a1": 1609,
    "b7g7": 1610,
    "d4d8": 1611,
    "c2c5": 1612,
    "c5c2": 1613,
    "a3a8": 1614,
    "h6f4": 1615,
    "f4f7": 1616,
    "a5a7": 1617,
    "e8b5": 1618,
    "d4d7": 1619,
    "g7d7": 1620,
    "f8f1": 1621,
    "e8g7": 1622,
    "h7f8": 1623,
    "h6c1": 1624,
    "b3a1": 1625,
    "e7e4": 1626,
    "d6h6": 1627,
    "f1f5": 1628,
    "b5a7": 1629,
    "h3h5": 1630,
    "b8f4": 1631,
    "h3a3": 1632,
    "b2h2": 1633,
    "h4b4": 1634,
    "f5c5": 1635,
    "b5e2": 1636,
    "b7b1": 1637,
    "h6a6": 1638,
    "h8h3": 1639,
    "h7h3": 1640,
    "g2c2": 1641,
    "f4f2": 1642,
    "a6a4": 1643,
    "a7b7": 1644,
    "b8h2": 1645,
    "a4a8": 1646,
    "g7g1": 1647,
    "d4a1": 1648,
    "a1d4": 1649,
    "b1f5": 1650,
    "g3a3": 1651,
    "e5b2": 1652,
    "a4b2": 1653,
    "b2d3": 1654,
    "a1e5": 1655,
    "b7d8": 1656,
    "b3g3": 1657,
    "h6c6": 1658,
    "a1b3": 1659,
    "c6h6": 1660,
    "h1f3": 1661,
    "a8b6": 1662,
    "b6a8": 1663,
    "g2g1q": 1664,
    "b7h1": 1665,
    "g7h8q": 1666,
    "h1a8": 1667,
    "f6f2": 1668,
    "b5e5": 1669,
    "b7a5": 1670,
    "a2h2": 1671,
    "f6b2": 1672,
    "e6e3": 1673,
    "e6h6": 1674,
    "g7e8": 1675,
    "a3c3": 1676,
    "e5h8": 1677,
    "f3f1": 1678,
    "h1d5": 1679,
    "c5a7": 1680,
    "e6b6": 1681,
    "d5a8": 1682,
    "f5f8": 1683,
    "c5f5": 1684,
    "g5g8": 1685,
    "a8d5": 1686,
    "e5b5": 1687,
    "d5a2": 1688,
    "b5b3": 1689,
    "d4g4": 1690,
    "g2e3": 1691,
    "g2h4": 1692,
    "f5a5": 1693,
    "f7h7": 1694,
    "h5e8": 1695,
    "c1a2": 1696,
    "c6a8": 1697,
    "f7f2": 1698,
    "d5h1": 1699,
    "g1a1": 1700,
    "g4a4": 1701,
    "a7e3": 1702,
    "b4h4": 1703,
    "e2g1": 1704,
    "e6d8": 1705,
    "b5e8": 1706,
    "c1e2": 1707,
    "f3h1": 1708,
    "h1c6": 1709,
    "f5d5": 1710,
    "a5f5": 1711,
    "b1g1": 1712,
    "g1b1": 1713,
    "d3h3": 1714,
    "h3d3": 1715,
    "h2f4": 1716,
    "g2a2": 1717,
    "c8b6": 1718,
    "f2a2": 1719,
    "b6e6": 1720,
    "h5c5": 1721,
    "a7a1": 1722,
    "h8g6": 1723,
    "a8e4": 1724,
    "b1g6": 1725,
    "g3g7": 1726,
    "f7c7": 1727,
    "a7c8": 1728,
    "c2h7": 1729,
    "h2d6": 1730,
    "g7a7": 1731,
    "g4g8": 1732,
    "b6g6": 1733,
    "f3a3": 1734,
    "h1b7": 1735,
    "g7g8n": 1736,
    "c6c2": 1737,
    "b4f4": 1738,
    "c6c3": 1739,
    "f7a2": 1740,
    "a6a1": 1741,
    "c1b3": 1742,
    "b3a5": 1743,
    "e8a4": 1744,
    "d4h8": 1745,
    "e3e6": 1746,
    "d8b7": 1747,
    "e7d8q": 1748,
    "h7e7": 1749,
    "a8g2": 1750,
    "a5b7": 1751,
    "h7c7": 1752,
    "h8d4": 1753,
    "a6h6": 1754,
    "b2h8": 1755,
    "h2h8": 1756,
    "d7c8q": 1757,
    "f2g1q": 1758,
    "b6g1": 1759,
    "d6d1": 1760,
    "b2b7": 1761,
    "h2c7": 1762,
    "h5d5": 1763,
    "g1c5": 1764,
    "a2a6": 1765,
    "f6f1": 1766,
    "a6e6": 1767,
    "g8b3": 1768,
    "g8c4": 1769,
    "a8c6": 1770,
    "a8f3": 1771,
    "a6a2": 1772,
    "g5c5": 1773,
    "h3h7": 1774,
    "g3g8": 1775,
    "h5b5": 1776,
    "c7c8n": 1777,
    "b7h7": 1778,
    "e1b4": 1779,
    "g1e3": 1780,
    "a3h3": 1781,
    "h3e3": 1782,
    "f3b3": 1783,
    "b3b1": 1784,
    "h4d4": 1785,
    "g3g1": 1786,
    "a8h1": 1787,
    "d7h7": 1788,
    "c7h2": 1789,
    "e7f8q": 1790,
    "a5h5": 1791,
    "h5a5": 1792,
    "b5b1": 1793,
    "b3g8": 1794,
    "d2c1q": 1795,
    "g6h8": 1796,
    "f2a7": 1797,
    "c4g4": 1798,
    "h2d2": 1799,
    "h6h1": 1800,
    "c6h1": 1801,
    "h2h6": 1802,
    "h1f2": 1803,
    "g6b6": 1804,
    "c7d8q": 1805,
    "h4a4": 1806,
    "a2b1q": 1807,
    "h2h5": 1808,
    "d1b2": 1809,
    "h8e5": 1810,
    "h7h4": 1811,
    "b8g3": 1812,
    "h2h1r": 1813,
    "a2g8": 1814,
    "e1a5": 1815,
    "c7d8r": 1816,
    "h8a1": 1817,
    "b7c8q": 1818,
    "a7a8r": 1819,
    "b2d1": 1820,
    "e2f1q": 1821,
    "g8d5": 1822,
    "g7f8q": 1823,
    "f2f1b": 1824,
    "b2b1b": 1825,
    "a2a1b": 1826,
    "f7e8q": 1827,
    "h6b6": 1828,
    "g1a7": 1829,
    "b1h7": 1830,
    "f2e1q": 1831,
    "d2e1q": 1832,
    "h7b1": 1833,
    "g6b1": 1834,
    "a7b8q": 1835,
    "b2a1q": 1836,
    "c2b1q": 1837,
    "e2d1q": 1838,
    "a7a8n": 1839,
    "h2g1q": 1840,
    "d7e8q": 1841,
    "a2a1r": 1842,
    "f2f1r": 1843,
    "g8a2": 1844,
    "h7g8q": 1845,
    "a7g1": 1846,
    "g2h1q": 1847,
    "a1h8": 1848,
    "b7a8q": 1849,
    "g1d4": 1850,
    "b2c1q": 1851,
    "g2f1q": 1852,
    "b7b8r": 1853,
    "f7g8q": 1854,
    "*": 1855,
    "c7c8b": 1856,
    "d7d8n": 1857,
    "c7b8q": 1858,
    "e2f1n": 1859,
    "e7e8n": 1860,
    "a2a1n": 1861,
    "h7h8n": 1862,
    "h7h8r": 1863,
    "c2c1n": 1864,
    "b7b8n": 1865,
    "g2g1n": 1866,
    "c2c1r": 1867,
    "d2d1r": 1868,
    "f7f8n": 1869,
    "b2a1n": 1870,
    "f7f8r": 1871,
    "d7e8r": 1872,
    "d2d1n": 1873,
    "c7c8r": 1874,
    "g2g1b": 1875,
    "e2e1n": 1876,
    "e2d1r": 1877,
    "h7g8n": 1878,
    "b2b1r": 1879,
    "g2g1r": 1880,
    "g7g8r": 1881,
    "d7e8n": 1882,
    "a7b8r": 1883,
    "h2h1b": 1884,
    "a7a8b": 1885,
    "e2e1r": 1886,
    "e7e8r": 1887,
    "b7c8b": 1888,
    "f2f1n": 1889,
    "g7f8n": 1890,
    "b2b1n": 1891,
    "h2h1n": 1892,
    "c2d1n": 1893,
    "d2e1r": 1894,
    "d2d1b": 1895,
    "h7h8b": 1896,
    "f7e8n": 1897,
    "d7d8r": 1898,
    "e7f8n": 1899,
    "e2d1n": 1900,
    "b2a1r": 1901,
    "f2e1r": 1902,
    "e2f1r": 1903,
    "g2f1n": 1904,
    "e2e1b": 1905,
    "f7f8b": 1906,
    "c2c1b": 1907,
    "c7b8b": 1908,
    "g7g8b": 1909,
    "f7e8r": 1910,
    "g2f1r": 1911,
    "a2b1b": 1912,
    "b7b8b": 1913,
    "e7e8b": 1914,
    "g7h8b": 1915,
    "e2f1b": 1916,
    "d2c1r": 1917,
    "d2c1n": 1918,
    "a2b1r": 1919,
    "e7d8r": 1920,
    "c2d1r": 1921,
    "c7d8n": 1922,
    "c2b1n": 1923,
    "f7g8r": 1924,
    "d7d8b": 1925,
    "e7f8r": 1926,
    "e7d8n": 1927,
    "f2g1n": 1928,
    "d7c8n": 1929
}